{"id": "2508.10530", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10530", "abs": "https://arxiv.org/abs/2508.10530", "authors": ["Zetian Sun", "Dongfang Li", "Baotian Hu"], "title": "Diversity First, Quality Later: A Two-Stage Assumption for Language Model Alignment", "comment": null, "summary": "The alignment of language models (LMs) with human preferences is critical for\nbuilding reliable AI systems. The problem is typically framed as optimizing an\nLM policy to maximize the expected reward that reflects human preferences.\nRecently, Direct Preference Optimization (DPO) was proposed as a LM alignment\nmethod that directly optimize the policy from static preference data, and\nfurther improved by incorporating on-policy sampling (i.e., preference\ncandidates generated during the training loop) for better LM alignment.\nHowever, we show on-policy data is not always optimal, with systematic\neffectiveness difference emerging between static and on-policy preference\ncandidates. For example, on-policy data can result in a 3$\\times$ effectiveness\ncompared with static data for Llama-3, and a 0.4$\\times$ effectiveness for\nZephyr. To explain the phenomenon, we propose the alignment stage assumption,\nwhich divides the alignment process into two distinct stages: the preference\ninjection stage, which benefits from diverse data, and the preference\nfine-tuning stage, which favors high-quality data. Through theoretical and\nempirical analysis, we characterize these stages and propose an effective\nalgorithm to identify the boundaries between them. We perform experiments on 5\nmodels (Llama, Zephyr, Phi-2, Qwen, Pythia) and 2 alignment methods (DPO,\nSLiC-HF) to show the generalizability of alignment stage assumption and\nboundary measurement.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO", "direct preference optimization", "SLiC"], "score": 5}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10530", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10530", "abs": "https://arxiv.org/abs/2508.10530", "authors": ["Zetian Sun", "Dongfang Li", "Baotian Hu"], "title": "Diversity First, Quality Later: A Two-Stage Assumption for Language Model Alignment", "comment": null, "summary": "The alignment of language models (LMs) with human preferences is critical for\nbuilding reliable AI systems. The problem is typically framed as optimizing an\nLM policy to maximize the expected reward that reflects human preferences.\nRecently, Direct Preference Optimization (DPO) was proposed as a LM alignment\nmethod that directly optimize the policy from static preference data, and\nfurther improved by incorporating on-policy sampling (i.e., preference\ncandidates generated during the training loop) for better LM alignment.\nHowever, we show on-policy data is not always optimal, with systematic\neffectiveness difference emerging between static and on-policy preference\ncandidates. For example, on-policy data can result in a 3$\\times$ effectiveness\ncompared with static data for Llama-3, and a 0.4$\\times$ effectiveness for\nZephyr. To explain the phenomenon, we propose the alignment stage assumption,\nwhich divides the alignment process into two distinct stages: the preference\ninjection stage, which benefits from diverse data, and the preference\nfine-tuning stage, which favors high-quality data. Through theoretical and\nempirical analysis, we characterize these stages and propose an effective\nalgorithm to identify the boundaries between them. We perform experiments on 5\nmodels (Llama, Zephyr, Phi-2, Qwen, Pythia) and 2 alignment methods (DPO,\nSLiC-HF) to show the generalizability of alignment stage assumption and\nboundary measurement.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO", "direct preference optimization", "SLiC"], "score": 5}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10316", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10316", "abs": "https://arxiv.org/abs/2508.10316", "authors": ["Yuanzhi Liang", "Yijie Fang", "Rui Li", "Ziqi Ni", "Ruijie Su", "Chi Zhang", "Xuelong Li"], "title": "Integrating Reinforcement Learning with Visual Generative Models: Foundations and Advances", "comment": "Ongoing work", "summary": "Generative models have made significant progress in synthesizing visual\ncontent, including images, videos, and 3D/4D structures. However, they are\ntypically trained with surrogate objectives such as likelihood or\nreconstruction loss, which often misalign with perceptual quality, semantic\naccuracy, or physical realism. Reinforcement learning (RL) offers a principled\nframework for optimizing non-differentiable, preference-driven, and temporally\nstructured objectives. Recent advances demonstrate its effectiveness in\nenhancing controllability, consistency, and human alignment across generative\ntasks. This survey provides a systematic overview of RL-based methods for\nvisual content generation. We review the evolution of RL from classical control\nto its role as a general-purpose optimization tool, and examine its integration\ninto image, video, and 3D/4D generation. Across these domains, RL serves not\nonly as a fine-tuning mechanism but also as a structural component for aligning\ngeneration with complex, high-level goals. We conclude with open challenges and\nfuture research directions at the intersection of RL and generative modeling.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "preference", "alignment", "human alignment"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10355", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10355", "abs": "https://arxiv.org/abs/2508.10355", "authors": ["Jungyup Lee", "Jemin Kim", "Sang Park", "SeungJae Lee"], "title": "Making Qwen3 Think in Korean with Reinforcement Learning", "comment": null, "summary": "We present a two-stage fine-tuning approach to make the large language model\nQwen3 14B \"think\" natively in Korean. In the first stage, supervised\nfine-tuning (SFT) on a high-quality Korean reasoning dataset establishes a\nstrong foundation in Korean logical reasoning, yielding notable improvements in\nKorean-language tasks and even some gains in general reasoning ability. In the\nsecond stage, we employ reinforcement learning with a customized Group Relative\nPolicy Optimization (GRPO) algorithm to further enhance both Korean reasoning\nalignment and overall problem-solving performance. We address critical\nstability challenges in GRPO training - such as reward hacking and policy\ncollapse - by introducing an oracle judge model that calibrates the reward\nsignal. Our approach achieves stable learning (avoiding the collapse observed\nin naive GRPO) and leads to steady, incremental performance gains. The final\nRL-tuned model demonstrates substantially improved results on advanced\nreasoning benchmarks (particularly math and coding tasks) while maintaining\nknowledge and language proficiency, successfully conducting its internal\nchain-of-thought entirely in Korean.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization", "alignment", "reward hacking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10858", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10858", "abs": "https://arxiv.org/abs/2508.10858", "authors": ["Harold Haodong Chen", "Haojian Huang", "Qifeng Chen", "Harry Yang", "Ser-Nam Lim"], "title": "Hierarchical Fine-grained Preference Optimization for Physically Plausible Video Generation", "comment": "Project Page: https://haroldchen19.github.io/PhysHPO-Page/", "summary": "Recent advancements in video generation have enabled the creation of\nhigh-quality, visually compelling videos. However, generating videos that\nadhere to the laws of physics remains a critical challenge for applications\nrequiring realism and accuracy. In this work, we propose PhysHPO, a novel\nframework for Hierarchical Cross-Modal Direct Preference Optimization, to\ntackle this challenge by enabling fine-grained preference alignment for\nphysically plausible video generation. PhysHPO optimizes video alignment across\nfour hierarchical granularities: a) Instance Level, aligning the overall video\ncontent with the input prompt; b) State Level, ensuring temporal consistency\nusing boundary frames as anchors; c) Motion Level, modeling motion trajectories\nfor realistic dynamics; and d) Semantic Level, maintaining logical consistency\nbetween narrative and visuals. Recognizing that real-world videos are the best\nreflections of physical phenomena, we further introduce an automated data\nselection pipeline to efficiently identify and utilize \"good data\" from\nexisting large-scale text-video datasets, thereby eliminating the need for\ncostly and time-intensive dataset construction. Extensive experiments on both\nphysics-focused and general capability benchmarks demonstrate that PhysHPO\nsignificantly improves physical plausibility and overall video generation\nquality of advanced models. To the best of our knowledge, this is the first\nwork to explore fine-grained preference alignment and data selection for video\ngeneration, paving the way for more realistic and human-preferred video\ngeneration paradigms.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.09997", "categories": ["cs.CL", "cs.CY"], "pdf": "https://arxiv.org/pdf/2508.09997", "abs": "https://arxiv.org/abs/2508.09997", "authors": ["Johannes Schneider", "Béatrice S. Hasler", "Michaela Varrone", "Fabian Hoya", "Thomas Schroffenegger", "Dana-Kristin Mah", "Karl Peböck"], "title": "Thematic and Task-Based Categorization of K-12 GenAI Usages with Hierarchical Topic Modeling", "comment": "Accepted at the International Conference on Computer-Human\n  Interaction Research and Applications (CHIRA), 2025", "summary": "We analyze anonymous interaction data of minors in class-rooms spanning\nseveral months, schools, and subjects employing a novel, simple topic modeling\napproach. Specifically, we categorize more than 17,000 messages generated by\nstudents, teachers, and ChatGPT in two dimensions: content (such as nature and\npeople) and tasks (such as writing and explaining). Our hierarchical\ncategorization done separately for each dimension includes exemplary prompts,\nand provides both a high-level overview as well as tangible insights. Prior\nworks mostly lack a content or thematic categorization. While task\ncategorizations are more prevalent in education, most have not been supported\nby real-world data for K-12. In turn, it is not surprising that our analysis\nyielded a number of novel applications. In deriving these insights, we found\nthat many of the well-established classical and emerging computational methods,\ni.e., topic modeling, for analysis of large amounts of texts underperform,\nleading us to directly apply state-of-the-art LLMs with adequate pre-processing\nto achieve hierarchical topic structures with better human alignment through\nexplicit instructions than prior approaches. Our findings support fellow\nresearchers, teachers and students in enriching the usage of GenAI, while our\ndiscussion also highlights a number of concerns and open questions for future\nresearch.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "human alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dimension"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10001", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10001", "abs": "https://arxiv.org/abs/2508.10001", "authors": ["Rakesh Thakur", "Sneha Sharma", "Gauri Chopra"], "title": "HiFACTMix: A Code-Mixed Benchmark and Graph-Aware Model for EvidenceBased Political Claim Verification in Hinglish", "comment": null, "summary": "Fact-checking in code-mixed, low-resource languages such as Hinglish remains\nan underexplored challenge in natural language processing. Existing\nfact-verification systems largely focus on high-resource, monolingual settings\nand fail to generalize to real-world political discourse in linguistically\ndiverse regions like India. Given the widespread use of Hinglish by public\nfigures, particularly political figures, and the growing influence of social\nmedia on public opinion, there's a critical need for robust, multilingual and\ncontext-aware fact-checking tools. To address this gap a novel benchmark HiFACT\ndataset is introduced with 1,500 realworld factual claims made by 28 Indian\nstate Chief Ministers in Hinglish, under a highly code-mixed low-resource\nsetting. Each claim is annotated with textual evidence and veracity labels. To\nevaluate this benchmark, a novel graphaware, retrieval-augmented fact-checking\nmodel is proposed that combines multilingual contextual encoding,\nclaim-evidence semantic alignment, evidence graph construction, graph neural\nreasoning, and natural language explanation generation. Experimental results\nshow that HiFACTMix outperformed accuracy in comparison to state of art\nmultilingual baselines models and provides faithful justifications for its\nverdicts. This work opens a new direction for multilingual, code-mixed, and\npolitically grounded fact verification research.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10293", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10293", "abs": "https://arxiv.org/abs/2508.10293", "authors": ["Chuhuai Yue", "Chengqi Dong", "Yinan Gao", "Hang He", "Jiajun Chai", "Guojun Yin", "Wei Lin"], "title": "Promoting Efficient Reasoning with Verifiable Stepwise Reward", "comment": null, "summary": "Large reasoning models (LRMs) have recently achieved significant progress in\ncomplex reasoning tasks, aided by reinforcement learning with verifiable\nrewards. However, LRMs often suffer from overthinking, expending excessive\ncomputation on simple problems and reducing efficiency. Existing efficient\nreasoning methods typically require accurate task assessment to preset token\nbudgets or select reasoning modes, which limits their flexibility and\nreliability. In this work, we revisit the essence of overthinking and identify\nthat encouraging effective steps while penalizing ineffective ones is key to\nits solution. To this end, we propose a novel rule-based verifiable stepwise\nreward mechanism (VSRM), which assigns rewards based on the performance of\nintermediate states in the reasoning trajectory. This approach is intuitive and\nnaturally fits the step-by-step nature of reasoning tasks. We conduct extensive\nexperiments on standard mathematical reasoning benchmarks, including AIME24 and\nAIME25, by integrating VSRM with PPO and Reinforce++. Results show that our\nmethod achieves substantial output length reduction while maintaining original\nreasoning performance, striking an optimal balance between efficiency and\naccuracy. Further analysis of overthinking frequency and pass@k score before\nand after training demonstrates that our approach in deed effectively\nsuppresses ineffective steps and encourages effective reasoning, fundamentally\nalleviating the overthinking problem. All code will be released upon\nacceptance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["PPO", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "accuracy", "mathematical reasoning"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10340", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10340", "abs": "https://arxiv.org/abs/2508.10340", "authors": ["Chak Lam Shek", "Guangyao Shi", "Pratap Tokekar"], "title": "Multi-Agent Trust Region Policy Optimisation: A Joint Constraint Approach", "comment": null, "summary": "Multi-agent reinforcement learning (MARL) requires coordinated and stable\npolicy updates among interacting agents. Heterogeneous-Agent Trust Region\nPolicy Optimization (HATRPO) enforces per-agent trust region constraints using\nKullback-Leibler (KL) divergence to stabilize training. However, assigning each\nagent the same KL threshold can lead to slow and locally optimal updates,\nespecially in heterogeneous settings. To address this limitation, we propose\ntwo approaches for allocating the KL divergence threshold across agents:\nHATRPO-W, a Karush-Kuhn-Tucker-based (KKT-based) method that optimizes\nthreshold assignment under global KL constraints, and HATRPO-G, a greedy\nalgorithm that prioritizes agents based on improvement-to-divergence ratio. By\nconnecting sequential policy optimization with constrained threshold\nscheduling, our approach enables more flexible and effective learning in\nheterogeneous-agent settings. Experimental results demonstrate that our methods\nsignificantly boost the performance of HATRPO, achieving faster convergence and\nhigher final rewards across diverse MARL benchmarks. Specifically, HATRPO-W and\nHATRPO-G achieve comparable improvements in final performance, each exceeding\n22.5%. Notably, HATRPO-W also demonstrates more stable learning dynamics, as\nreflected by its lower variance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10433", "categories": ["cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10433", "abs": "https://arxiv.org/abs/2508.10433", "authors": ["Runqi Qiao", "Qiuna Tan", "Peiqing Yang", "Yanzi Wang", "Xiaowan Wang", "Enhui Wan", "Sitong Zhou", "Guanting Dong", "Yuchen Zeng", "Yida Xu", "Jie Wang", "Chong Sun", "Chen Li", "Honggang Zhang"], "title": "We-Math 2.0: A Versatile MathBook System for Incentivizing Visual Mathematical Reasoning", "comment": "Working in progress", "summary": "Multimodal Large Language Models (MLLMs) have demonstrated impressive\ncapabilities across various tasks, but still struggle with complex mathematical\nreasoning. Existing research primarily focuses on dataset construction and\nmethod optimization, often overlooking two critical aspects: comprehensive\nknowledge-driven design and model-centric data space modeling. In this paper,\nwe introduce We-Math 2.0, a unified system that integrates a structured\nmathematical knowledge system, model-centric data space modeling, and a\nreinforcement learning (RL)-based training paradigm to comprehensively enhance\nthe mathematical reasoning abilities of MLLMs. The key contributions of We-Math\n2.0 are fourfold: (1) MathBook Knowledge System: We construct a five-level\nhierarchical system encompassing 491 knowledge points and 1,819 fundamental\nprinciples. (2) MathBook-Standard & Pro: We develop MathBook-Standard, a\ndataset that ensures broad conceptual coverage and flexibility through dual\nexpansion. Additionally, we define a three-dimensional difficulty space and\ngenerate 7 progressive variants per problem to build MathBook-Pro, a\nchallenging dataset for robust training. (3) MathBook-RL: We propose a\ntwo-stage RL framework comprising: (i) Cold-Start Fine-tuning, which aligns the\nmodel with knowledge-oriented chain-of-thought reasoning; and (ii) Progressive\nAlignment RL, leveraging average-reward learning and dynamic data scheduling to\nachieve progressive alignment across difficulty levels. (4) MathBookEval: We\nintroduce a comprehensive benchmark covering all 491 knowledge points with\ndiverse reasoning step distributions. Experimental results show that\nMathBook-RL performs competitively with existing baselines on four widely-used\nbenchmarks and achieves strong results on MathBookEval, suggesting promising\ngeneralization in mathematical reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "mathematical reasoning"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10501", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10501", "abs": "https://arxiv.org/abs/2508.10501", "authors": ["Yushi Feng", "Junye Du", "Yingying Hong", "Qifan Wang", "Lequan Yu"], "title": "PASS: Probabilistic Agentic Supernet Sampling for Interpretable and Adaptive Chest X-Ray Reasoning", "comment": null, "summary": "Existing tool-augmented agentic systems are limited in the real world by (i)\nblack-box reasoning steps that undermine trust of decision-making and pose\nsafety risks, (ii) poor multimodal integration, which is inherently critical\nfor healthcare tasks, and (iii) rigid and computationally inefficient agentic\npipelines. We introduce PASS (Probabilistic Agentic Supernet Sampling), the\nfirst multimodal framework to address these challenges in the context of Chest\nX-Ray (CXR) reasoning. PASS adaptively samples agentic workflows over a\nmulti-tool graph, yielding decision paths annotated with interpretable\nprobabilities. Given the complex CXR reasoning task with multimodal medical\ndata, PASS leverages its learned task-conditioned distribution over the agentic\nsupernet. Thus, it adaptively selects the most suitable tool at each supernet\nlayer, offering probability-annotated trajectories for post-hoc audits and\ndirectly enhancing medical AI safety. PASS also continuously compresses salient\nfindings into an evolving personalized memory, while dynamically deciding\nwhether to deepen its reasoning path or invoke an early exit for efficiency. To\noptimize a Pareto frontier balancing performance and cost, we design a novel\nthree-stage training procedure, including expert knowledge warm-up, contrastive\npath-ranking, and cost-aware reinforcement learning. To facilitate rigorous\nevaluation, we introduce CAB-E, a comprehensive benchmark for multi-step,\nsafety-critical, free-form CXR reasoning. Experiments across various benchmarks\nvalidate that PASS significantly outperforms strong baselines in multiple\nmetrics (e.g., accuracy, AUC, LLM-J.) while balancing computational costs,\npushing a new paradigm shift towards interpretable, adaptive, and multimodal\nmedical agentic systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "ranking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "safety", "accuracy"], "score": 4}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10028", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10028", "abs": "https://arxiv.org/abs/2508.10028", "authors": ["Xiao Fu", "Hossein A. Rahmani", "Bin Wu", "Jerome Ramos", "Emine Yilmaz", "Aldo Lipani"], "title": "PREF: Reference-Free Evaluation of Personalised Text Generation in LLMs", "comment": "7 pages", "summary": "Personalised text generation is essential for user-centric information\nsystems, yet most evaluation methods overlook the individuality of users. We\nintroduce \\textbf{PREF}, a \\textbf{P}ersonalised \\textbf{R}eference-free\n\\textbf{E}valuation \\textbf{F}ramework that jointly measures general output\nquality and user-specific alignment without requiring gold personalised\nreferences. PREF operates in a three-step pipeline: (1) a coverage stage uses a\nlarge language model (LLM) to generate a comprehensive, query-specific\nguideline covering universal criteria such as factuality, coherence, and\ncompleteness; (2) a preference stage re-ranks and selectively augments these\nfactors using the target user's profile, stated or inferred preferences, and\ncontext, producing a personalised evaluation rubric; and (3) a scoring stage\napplies an LLM judge to rate candidate answers against this rubric, ensuring\nbaseline adequacy while capturing subjective priorities. This separation of\ncoverage from preference improves robustness, transparency, and reusability,\nand allows smaller models to approximate the personalised quality of larger\nones. Experiments on the PrefEval benchmark, including implicit\npreference-following tasks, show that PREF achieves higher accuracy, better\ncalibration, and closer alignment with human judgments than strong baselines.\nBy enabling scalable, interpretable, and user-aligned evaluation, PREF lays the\ngroundwork for more reliable assessment and development of personalised\nlanguage generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality", "accuracy", "rubric", "criteria"], "score": 6}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10001", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10001", "abs": "https://arxiv.org/abs/2508.10001", "authors": ["Rakesh Thakur", "Sneha Sharma", "Gauri Chopra"], "title": "HiFACTMix: A Code-Mixed Benchmark and Graph-Aware Model for EvidenceBased Political Claim Verification in Hinglish", "comment": null, "summary": "Fact-checking in code-mixed, low-resource languages such as Hinglish remains\nan underexplored challenge in natural language processing. Existing\nfact-verification systems largely focus on high-resource, monolingual settings\nand fail to generalize to real-world political discourse in linguistically\ndiverse regions like India. Given the widespread use of Hinglish by public\nfigures, particularly political figures, and the growing influence of social\nmedia on public opinion, there's a critical need for robust, multilingual and\ncontext-aware fact-checking tools. To address this gap a novel benchmark HiFACT\ndataset is introduced with 1,500 realworld factual claims made by 28 Indian\nstate Chief Ministers in Hinglish, under a highly code-mixed low-resource\nsetting. Each claim is annotated with textual evidence and veracity labels. To\nevaluate this benchmark, a novel graphaware, retrieval-augmented fact-checking\nmodel is proposed that combines multilingual contextual encoding,\nclaim-evidence semantic alignment, evidence graph construction, graph neural\nreasoning, and natural language explanation generation. Experimental results\nshow that HiFACTMix outperformed accuracy in comparison to state of art\nmultilingual baselines models and provides faithful justifications for its\nverdicts. This work opens a new direction for multilingual, code-mixed, and\npolitically grounded fact verification research.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10308", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10308", "abs": "https://arxiv.org/abs/2508.10308", "authors": ["Sihang Zeng", "Kai Tian", "Kaiyan Zhang", "Yuru wang", "Junqi Gao", "Runze Liu", "Sa Yang", "Jingxuan Li", "Xinwei Long", "Jiaheng Ma", "Biqing Qi", "Bowen Zhou"], "title": "ReviewRL: Towards Automated Scientific Review with RL", "comment": "13 pages, 5 figures", "summary": "Peer review is essential for scientific progress but faces growing challenges\ndue to increasing submission volumes and reviewer fatigue. Existing automated\nreview approaches struggle with factual accuracy, rating consistency, and\nanalytical depth, often generating superficial or generic feedback lacking the\ninsights characteristic of high-quality human reviews. We introduce ReviewRL, a\nreinforcement learning framework for generating comprehensive and factually\ngrounded scientific paper reviews. Our approach combines: (1) an ArXiv-MCP\nretrieval-augmented context generation pipeline that incorporates relevant\nscientific literature, (2) supervised fine-tuning that establishes foundational\nreviewing capabilities, and (3) a reinforcement learning procedure with a\ncomposite reward function that jointly enhances review quality and rating\naccuracy. Experiments on ICLR 2025 papers demonstrate that ReviewRL\nsignificantly outperforms existing methods across both rule-based metrics and\nmodel-based quality assessments. ReviewRL establishes a foundational framework\nfor RL-driven automatic critique generation in scientific discovery,\ndemonstrating promising potential for future development in this domain. The\nimplementation of ReviewRL will be released at GitHub.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10028", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10028", "abs": "https://arxiv.org/abs/2508.10028", "authors": ["Xiao Fu", "Hossein A. Rahmani", "Bin Wu", "Jerome Ramos", "Emine Yilmaz", "Aldo Lipani"], "title": "PREF: Reference-Free Evaluation of Personalised Text Generation in LLMs", "comment": "7 pages", "summary": "Personalised text generation is essential for user-centric information\nsystems, yet most evaluation methods overlook the individuality of users. We\nintroduce \\textbf{PREF}, a \\textbf{P}ersonalised \\textbf{R}eference-free\n\\textbf{E}valuation \\textbf{F}ramework that jointly measures general output\nquality and user-specific alignment without requiring gold personalised\nreferences. PREF operates in a three-step pipeline: (1) a coverage stage uses a\nlarge language model (LLM) to generate a comprehensive, query-specific\nguideline covering universal criteria such as factuality, coherence, and\ncompleteness; (2) a preference stage re-ranks and selectively augments these\nfactors using the target user's profile, stated or inferred preferences, and\ncontext, producing a personalised evaluation rubric; and (3) a scoring stage\napplies an LLM judge to rate candidate answers against this rubric, ensuring\nbaseline adequacy while capturing subjective priorities. This separation of\ncoverage from preference improves robustness, transparency, and reusability,\nand allows smaller models to approximate the personalised quality of larger\nones. Experiments on the PrefEval benchmark, including implicit\npreference-following tasks, show that PREF achieves higher accuracy, better\ncalibration, and closer alignment with human judgments than strong baselines.\nBy enabling scalable, interpretable, and user-aligned evaluation, PREF lays the\ngroundwork for more reliable assessment and development of personalised\nlanguage generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality", "accuracy", "rubric", "criteria"], "score": 6}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10308", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10308", "abs": "https://arxiv.org/abs/2508.10308", "authors": ["Sihang Zeng", "Kai Tian", "Kaiyan Zhang", "Yuru wang", "Junqi Gao", "Runze Liu", "Sa Yang", "Jingxuan Li", "Xinwei Long", "Jiaheng Ma", "Biqing Qi", "Bowen Zhou"], "title": "ReviewRL: Towards Automated Scientific Review with RL", "comment": "13 pages, 5 figures", "summary": "Peer review is essential for scientific progress but faces growing challenges\ndue to increasing submission volumes and reviewer fatigue. Existing automated\nreview approaches struggle with factual accuracy, rating consistency, and\nanalytical depth, often generating superficial or generic feedback lacking the\ninsights characteristic of high-quality human reviews. We introduce ReviewRL, a\nreinforcement learning framework for generating comprehensive and factually\ngrounded scientific paper reviews. Our approach combines: (1) an ArXiv-MCP\nretrieval-augmented context generation pipeline that incorporates relevant\nscientific literature, (2) supervised fine-tuning that establishes foundational\nreviewing capabilities, and (3) a reinforcement learning procedure with a\ncomposite reward function that jointly enhances review quality and rating\naccuracy. Experiments on ICLR 2025 papers demonstrate that ReviewRL\nsignificantly outperforms existing methods across both rule-based metrics and\nmodel-based quality assessments. ReviewRL establishes a foundational framework\nfor RL-driven automatic critique generation in scientific discovery,\ndemonstrating promising potential for future development in this domain. The\nimplementation of ReviewRL will be released at GitHub.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10795", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10795", "abs": "https://arxiv.org/abs/2508.10795", "authors": ["Osama Mohammed Afzal", "Preslav Nakov", "Tom Hope", "Iryna Gurevych"], "title": "Beyond \"Not Novel Enough\": Enriching Scholarly Critique with LLM-Assisted Feedback", "comment": null, "summary": "Novelty assessment is a central yet understudied aspect of peer review,\nparticularly in high volume fields like NLP where reviewer capacity is\nincreasingly strained. We present a structured approach for automated novelty\nevaluation that models expert reviewer behavior through three stages: content\nextraction from submissions, retrieval and synthesis of related work, and\nstructured comparison for evidence based assessment. Our method is informed by\na large scale analysis of human written novelty reviews and captures key\npatterns such as independent claim verification and contextual reasoning.\nEvaluated on 182 ICLR 2025 submissions with human annotated reviewer novelty\nassessments, the approach achieves 86.5% alignment with human reasoning and\n75.3% agreement on novelty conclusions - substantially outperforming existing\nLLM based baselines. The method produces detailed, literature aware analyses\nand improves consistency over ad hoc reviewer judgments. These results\nhighlight the potential for structured LLM assisted approaches to support more\nrigorous and transparent peer review without displacing human expertise. Data\nand code are made available.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement", "consistency"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10433", "categories": ["cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10433", "abs": "https://arxiv.org/abs/2508.10433", "authors": ["Runqi Qiao", "Qiuna Tan", "Peiqing Yang", "Yanzi Wang", "Xiaowan Wang", "Enhui Wan", "Sitong Zhou", "Guanting Dong", "Yuchen Zeng", "Yida Xu", "Jie Wang", "Chong Sun", "Chen Li", "Honggang Zhang"], "title": "We-Math 2.0: A Versatile MathBook System for Incentivizing Visual Mathematical Reasoning", "comment": "Working in progress", "summary": "Multimodal Large Language Models (MLLMs) have demonstrated impressive\ncapabilities across various tasks, but still struggle with complex mathematical\nreasoning. Existing research primarily focuses on dataset construction and\nmethod optimization, often overlooking two critical aspects: comprehensive\nknowledge-driven design and model-centric data space modeling. In this paper,\nwe introduce We-Math 2.0, a unified system that integrates a structured\nmathematical knowledge system, model-centric data space modeling, and a\nreinforcement learning (RL)-based training paradigm to comprehensively enhance\nthe mathematical reasoning abilities of MLLMs. The key contributions of We-Math\n2.0 are fourfold: (1) MathBook Knowledge System: We construct a five-level\nhierarchical system encompassing 491 knowledge points and 1,819 fundamental\nprinciples. (2) MathBook-Standard & Pro: We develop MathBook-Standard, a\ndataset that ensures broad conceptual coverage and flexibility through dual\nexpansion. Additionally, we define a three-dimensional difficulty space and\ngenerate 7 progressive variants per problem to build MathBook-Pro, a\nchallenging dataset for robust training. (3) MathBook-RL: We propose a\ntwo-stage RL framework comprising: (i) Cold-Start Fine-tuning, which aligns the\nmodel with knowledge-oriented chain-of-thought reasoning; and (ii) Progressive\nAlignment RL, leveraging average-reward learning and dynamic data scheduling to\nachieve progressive alignment across difficulty levels. (4) MathBookEval: We\nintroduce a comprehensive benchmark covering all 491 knowledge points with\ndiverse reasoning step distributions. Experimental results show that\nMathBook-RL performs competitively with existing baselines on four widely-used\nbenchmarks and achieves strong results on MathBookEval, suggesting promising\ngeneralization in mathematical reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "mathematical reasoning"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10104", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10104", "abs": "https://arxiv.org/abs/2508.10104", "authors": ["Oriane Siméoni", "Huy V. Vo", "Maximilian Seitzer", "Federico Baldassarre", "Maxime Oquab", "Cijo Jose", "Vasil Khalidov", "Marc Szafraniec", "Seungeun Yi", "Michaël Ramamonjisoa", "Francisco Massa", "Daniel Haziza", "Luca Wehrstedt", "Jianyuan Wang", "Timothée Darcet", "Théo Moutakanni", "Leonel Sentana", "Claire Roberts", "Andrea Vedaldi", "Jamie Tolan", "John Brandt", "Camille Couprie", "Julien Mairal", "Hervé Jégou", "Patrick Labatut", "Piotr Bojanowski"], "title": "DINOv3", "comment": null, "summary": "Self-supervised learning holds the promise of eliminating the need for manual\ndata annotation, enabling models to scale effortlessly to massive datasets and\nlarger architectures. By not being tailored to specific tasks or domains, this\ntraining paradigm has the potential to learn visual representations from\ndiverse sources, ranging from natural to aerial images -- using a single\nalgorithm. This technical report introduces DINOv3, a major milestone toward\nrealizing this vision by leveraging simple yet effective strategies. First, we\nleverage the benefit of scaling both dataset and model size by careful data\npreparation, design, and optimization. Second, we introduce a new method called\nGram anchoring, which effectively addresses the known yet unsolved issue of\ndense feature maps degrading during long training schedules. Finally, we apply\npost-hoc strategies that further enhance our models' flexibility with respect\nto resolution, model size, and alignment with text. As a result, we present a\nversatile vision foundation model that outperforms the specialized state of the\nart across a broad range of settings, without fine-tuning. DINOv3 produces\nhigh-quality dense features that achieve outstanding performance on various\nvision tasks, significantly surpassing previous self- and weakly-supervised\nfoundation models. We also share the DINOv3 suite of vision models, designed to\nadvance the state of the art on a wide spectrum of tasks and data by providing\nscalable solutions for diverse resource constraints and deployment scenarios.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10108", "categories": ["cs.AI", "cs.CL", "I.2.7; I.2.6; E.0"], "pdf": "https://arxiv.org/pdf/2508.10108", "abs": "https://arxiv.org/abs/2508.10108", "authors": ["Sattvik Sahai", "Prasoon Goyal", "Michael Johnston", "Anna Gottardi", "Yao Lu", "Lucy Hu", "Luke Dai", "Shaohua Liu", "Samyuth Sagi", "Hangjie Shi", "Desheng Zhang", "Lavina Vaz", "Leslie Ball", "Maureen Murray", "Rahul Gupta", "Shankar Ananthakrishna"], "title": "Amazon Nova AI Challenge -- Trusted AI: Advancing secure, AI-assisted software development", "comment": "18 pages, 1st Proceedings of Amazon Nova AI Challenge (Trusted AI\n  2025)", "summary": "AI systems for software development are rapidly gaining prominence, yet\nsignificant challenges remain in ensuring their safety. To address this, Amazon\nlaunched the Trusted AI track of the Amazon Nova AI Challenge, a global\ncompetition among 10 university teams to drive advances in secure AI. In the\nchallenge, five teams focus on developing automated red teaming bots, while the\nother five create safe AI assistants. This challenge provides teams with a\nunique platform to evaluate automated red-teaming and safety alignment methods\nthrough head-to-head adversarial tournaments where red teams have multi-turn\nconversations with the competing AI coding assistants to test their safety\nalignment. Along with this, the challenge provides teams with a feed of high\nquality annotated data to fuel iterative improvement. Throughout the challenge,\nteams developed state-of-the-art techniques, introducing novel approaches in\nreasoning-based safety alignment, robust model guardrails, multi-turn\njail-breaking, and efficient probing of large language models (LLMs). To\nsupport these efforts, the Amazon Nova AI Challenge team made substantial\nscientific and engineering investments, including building a custom baseline\ncoding specialist model for the challenge from scratch, developing a tournament\norchestration service, and creating an evaluation harness. This paper outlines\nthe advancements made by university teams and the Amazon Nova AI Challenge team\nin addressing the safety challenges of AI for software development,\nhighlighting this collaborative effort to raise the bar for AI safety.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10146", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10146", "abs": "https://arxiv.org/abs/2508.10146", "authors": ["Hana Derouiche", "Zaki Brahmi", "Haithem Mazeni"], "title": "Agentic AI Frameworks: Architectures, Protocols, and Design Challenges", "comment": null, "summary": "The emergence of Large Language Models (LLMs) has ushered in a transformative\nparadigm in artificial intelligence, Agentic AI, where intelligent agents\nexhibit goal-directed autonomy, contextual reasoning, and dynamic multi-agent\ncoordination. This paper provides a systematic review and comparative analysis\nof leading Agentic AI frameworks, including CrewAI, LangGraph, AutoGen,\nSemantic Kernel, Agno, Google ADK, and MetaGPT, evaluating their architectural\nprinciples, communication mechanisms, memory management, safety guardrails, and\nalignment with service-oriented computing paradigms. Furthermore, we identify\nkey limitations, emerging trends, and open challenges in the field. To address\nthe issue of agent communication, we conduct an in-depth analysis of protocols\nsuch as the Contract Net Protocol (CNP), Agent-to-Agent (A2A), Agent Network\nProtocol (ANP), and Agora. Our findings not only establish a foundational\ntaxonomy for Agentic AI systems but also propose future research directions to\nenhance scalability, robustness, and interoperability. This work serves as a\ncomprehensive reference for researchers and practitioners working to advance\nthe next generation of autonomous AI systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10164", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10164", "abs": "https://arxiv.org/abs/2508.10164", "authors": ["Bin Hong", "Jiayu Liu", "Zhenya Huang", "Kai Zhang", "Mengdi Zhang"], "title": "Pruning Long Chain-of-Thought of Large Reasoning Models via Small-Scale Preference Optimization", "comment": "19 pages, 5 figures", "summary": "Recent advances in Large Reasoning Models (LRMs) have demonstrated strong\nperformance on complex tasks through long Chain-of-Thought (CoT) reasoning.\nHowever, their lengthy outputs increase computational costs and may lead to\noverthinking, raising challenges in balancing reasoning effectiveness and\nefficiency. Current methods for efficient reasoning often compromise reasoning\nquality or require extensive resources. This paper investigates efficient\nmethods to reduce the generation length of LRMs. We analyze generation path\ndistributions and filter generated trajectories through difficulty estimation.\nSubsequently, we analyze the convergence behaviors of the objectives of various\npreference optimization methods under a Bradley-Terry loss based framework.\nBased on the analysis, we propose Length Controlled Preference Optimization\n(LCPO) that directly balances the implicit reward related to NLL loss. LCPO can\neffectively learn length preference with limited data and training. Extensive\nexperiments demonstrate that our approach significantly reduces the average\noutput length by over 50\\% across multiple benchmarks while maintaining the\nreasoning performance. Our work highlights the potential for computationally\nefficient approaches in guiding LRMs toward efficient reasoning.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10007", "categories": ["cs.CL", "stat.ME"], "pdf": "https://arxiv.org/pdf/2508.10007", "abs": "https://arxiv.org/abs/2508.10007", "authors": ["Y. Lyu", "D. Combs", "D. Neumann", "Y. C. Leong"], "title": "Automated scoring of the Ambiguous Intentions Hostility Questionnaire using fine-tuned large language models", "comment": "We have no known conflict of interest", "summary": "Hostile attribution bias is the tendency to interpret social interactions as\nintentionally hostile. The Ambiguous Intentions Hostility Questionnaire (AIHQ)\nis commonly used to measure hostile attribution bias, and includes open-ended\nquestions where participants describe the perceived intentions behind a\nnegative social situation and how they would respond. While these questions\nprovide insights into the contents of hostile attributions, they require\ntime-intensive scoring by human raters. In this study, we assessed whether\nlarge language models can automate the scoring of AIHQ open-ended responses. We\nused a previously collected dataset in which individuals with traumatic brain\ninjury (TBI) and healthy controls (HC) completed the AIHQ and had their\nopen-ended responses rated by trained human raters. We used half of these\nresponses to fine-tune the two models on human-generated ratings, and tested\nthe fine-tuned models on the remaining half of AIHQ responses. Results showed\nthat model-generated ratings aligned with human ratings for both attributions\nof hostility and aggression responses, with fine-tuned models showing higher\nalignment. This alignment was consistent across ambiguous, intentional, and\naccidental scenario types, and replicated previous findings on group\ndifferences in attributions of hostility and aggression responses between TBI\nand HC groups. The fine-tuned models also generalized well to an independent\nnonclinical dataset. To support broader adoption, we provide an accessible\nscoring interface that includes both local and cloud-based options. Together,\nour findings suggest that large language models can streamline AIHQ scoring in\nboth research and clinical contexts, revealing their potential to facilitate\npsychological assessments across different populations.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10241", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10241", "abs": "https://arxiv.org/abs/2508.10241", "authors": ["Mark Zilberman"], "title": "Extending the Entropic Potential of Events for Uncertainty Quantification and Decision-Making in Artificial Intelligence", "comment": "10 pages", "summary": "This work demonstrates how the concept of the entropic potential of events --\na parameter quantifying the influence of discrete events on the expected future\nentropy of a system -- can enhance uncertainty quantification, decision-making,\nand interpretability in artificial intelligence (AI). Building on its original\nformulation in physics, the framework is adapted for AI by introducing an\nevent-centric measure that captures how actions, observations, or other\ndiscrete occurrences impact uncertainty at future time horizons. Both the\noriginal and AI-adjusted definitions of entropic potential are formalized, with\nthe latter emphasizing conditional expectations to account for counterfactual\nscenarios. Applications are explored in policy evaluation, intrinsic reward\ndesign, explainable AI, and anomaly detection, highlighting the metric's\npotential to unify and strengthen uncertainty modeling in intelligent systems.\nConceptual examples illustrate its use in reinforcement learning, Bayesian\ninference, and anomaly detection, while practical considerations for\ncomputation in complex AI models are discussed. The entropic potential\nframework offers a theoretically grounded, interpretable, and versatile\napproach to managing uncertainty in AI, bridging principles from\nthermodynamics, information theory, and machine learning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10008", "categories": ["cs.CL", "cs.LG", "68", "I.2.7"], "pdf": "https://arxiv.org/pdf/2508.10008", "abs": "https://arxiv.org/abs/2508.10008", "authors": ["Antonio Leandro Martins Candido", "Jose Everardo Bessa Maia"], "title": "Multidimensional classification of posts for online course discussion forum curation", "comment": "8 pages, 1 figure", "summary": "The automatic curation of discussion forums in online courses requires\nconstant updates, making frequent retraining of Large Language Models (LLMs) a\nresource-intensive process. To circumvent the need for costly fine-tuning, this\npaper proposes and evaluates the use of Bayesian fusion. The approach combines\nthe multidimensional classification scores of a pre-trained generic LLM with\nthose of a classifier trained on local data. The performance comparison\ndemonstrated that the proposed fusion improves the results compared to each\nclassifier individually, and is competitive with the LLM fine-tuning approach", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10337", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10337", "abs": "https://arxiv.org/abs/2508.10337", "authors": ["Chenliang Zhang", "Lin Wang", "Yuanyuan Lu", "Yusheng Qi", "Kexin Wang", "Peixu Hou", "Wenshi Chen"], "title": "A Curriculum Learning Approach to Reinforcement Learning: Leveraging RAG for Multimodal Question Answering", "comment": null, "summary": "This paper describes the solutions of the Dianping-Trust-Safety team for the\nMETA CRAG-MM challenge. The challenge requires building a comprehensive\nretrieval-augmented generation system capable for multi-modal multi-turn\nquestion answering. The competition consists of three tasks: (1) answering\nquestions using structured data retrieved from an image-based mock knowledge\ngraph, (2) synthesizing information from both knowledge graphs and web search\nresults, and (3) handling multi-turn conversations that require context\nunderstanding and information aggregation from multiple sources. For Task 1,\nour solution is based on the vision large language model, enhanced by\nsupervised fine-tuning with knowledge distilled from GPT-4.1. We further\napplied curriculum learning strategies to guide reinforcement learning,\nresulting in improved answer accuracy and reduced hallucination. For Task 2 and\nTask 3, we additionally leveraged web search APIs to incorporate external\nknowledge, enabling the system to better handle complex queries and multi-turn\nconversations. Our approach achieved 1st place in Task 1 with a significant\nlead of 52.38\\%, and 3rd place in Task 3, demonstrating the effectiveness of\nthe integration of curriculum learning with reinforcement learning in our\ntraining pipeline.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "accuracy", "question answering"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10012", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10012", "abs": "https://arxiv.org/abs/2508.10012", "authors": ["Dehao Tao", "Guangjie Liu", "Weizheng", "Yongfeng Huang", "Minghu jiang"], "title": "Guided Navigation in Knowledge-Dense Environments: Structured Semantic Exploration with Guidance Graphs", "comment": null, "summary": "While Large Language Models (LLMs) exhibit strong linguistic capabilities,\ntheir reliance on static knowledge and opaque reasoning processes limits their\nperformance in knowledge intensive tasks. Knowledge graphs (KGs) offer a\npromising solution, but current exploration methods face a fundamental trade\noff: question guided approaches incur redundant exploration due to granularity\nmismatches, while clue guided methods fail to effectively leverage contextual\ninformation for complex scenarios. To address these limitations, we propose\nGuidance Graph guided Knowledge Exploration (GG Explore), a novel framework\nthat introduces an intermediate Guidance Graph to bridge unstructured queries\nand structured knowledge retrieval. The Guidance Graph defines the retrieval\nspace by abstracting the target knowledge' s structure while preserving broader\nsemantic context, enabling precise and efficient exploration. Building upon the\nGuidance Graph, we develop: (1) Structural Alignment that filters incompatible\ncandidates without LLM overhead, and (2) Context Aware Pruning that enforces\nsemantic consistency with graph constraints. Extensive experiments show our\nmethod achieves superior efficiency and outperforms SOTA, especially on complex\ntasks, while maintaining strong performance with smaller LLMs, demonstrating\npractical value.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10358", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10358", "abs": "https://arxiv.org/abs/2508.10358", "authors": ["Mengtao Zhou", "Sifan Wu", "Huan Zhang", "Qi Sima", "Bang Liu"], "title": "What to Ask Next? Probing the Imaginative Reasoning of LLMs with TurtleSoup Puzzles", "comment": null, "summary": "We investigate the capacity of Large Language Models (LLMs) for imaginative\nreasoning--the proactive construction, testing, and revision of hypotheses in\ninformation-sparse environments. Existing benchmarks, often static or focused\non social deduction, fail to capture the dynamic, exploratory nature of this\nreasoning process. To address this gap, we introduce a comprehensive research\nframework based on the classic \"Turtle Soup\" game, integrating a benchmark, an\nagent, and an evaluation protocol. We present TurtleSoup-Bench, the first\nlarge-scale, bilingual, interactive benchmark for imaginative reasoning,\ncomprising 800 turtle soup puzzles sourced from both the Internet and expert\nauthors. We also propose Mosaic-Agent, a novel agent designed to assess LLMs'\nperformance in this setting. To evaluate reasoning quality, we develop a\nmulti-dimensional protocol measuring logical consistency, detail completion,\nand conclusion alignment. Experiments with leading LLMs reveal clear capability\nlimits, common failure patterns, and a significant performance gap compared to\nhumans. Our work offers new insights into LLMs' imaginative reasoning and\nestablishes a foundation for future research on exploratory agent behavior.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "multi-dimensional"], "score": 4}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10280", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10280", "abs": "https://arxiv.org/abs/2508.10280", "authors": ["Danyi Gao"], "title": "High Fidelity Text to Image Generation with Contrastive Alignment and Structural Guidance", "comment": null, "summary": "This paper addresses the performance bottlenecks of existing text-driven\nimage generation methods in terms of semantic alignment accuracy and structural\nconsistency. A high-fidelity image generation method is proposed by integrating\ntext-image contrastive constraints with structural guidance mechanisms. The\napproach introduces a contrastive learning module that builds strong\ncross-modal alignment constraints to improve semantic matching between text and\nimage. At the same time, structural priors such as semantic layout maps or edge\nsketches are used to guide the generator in spatial-level structural modeling.\nThis enhances the layout completeness and detail fidelity of the generated\nimages. Within the overall framework, the model jointly optimizes contrastive\nloss, structural consistency loss, and semantic preservation loss. A\nmulti-objective supervision mechanism is adopted to improve the semantic\nconsistency and controllability of the generated content. Systematic\nexperiments are conducted on the COCO-2014 dataset. Sensitivity analyses are\nperformed on embedding dimensions, text length, and structural guidance\nstrength. Quantitative metrics confirm the superior performance of the proposed\nmethod in terms of CLIP Score, FID, and SSIM. The results show that the method\neffectively bridges the gap between semantic alignment and structural fidelity\nwithout increasing computational complexity. It demonstrates a strong ability\nto generate semantically clear and structurally complete images, offering a\nviable technical path for joint text-image modeling and image generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10016", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10016", "abs": "https://arxiv.org/abs/2508.10016", "authors": ["Tianyu Xie", "Yuhang Wu", "Yongdong Luo", "Jiayi Ji", "Xiawu Zheng"], "title": "Training-Free Multimodal Large Language Model Orchestration", "comment": null, "summary": "Different Multimodal Large Language Models (MLLMs) cannot be integrated into\na unified multimodal input-output system directly. In previous work, training\nhas been considered as an inevitable component due to challenges in modal\nalignment, Text-to-Speech efficiency and other integration issues. In this\npaper, we introduce Multimodal Large Language Model Orchestration, an effective\napproach for creating interactive multimodal AI systems without additional\ntraining. MLLM Orchestration leverages the inherent reasoning capabilities of\nlarge language models to coordinate specialized models through explicit\nworkflows, enabling natural multimodal interactions while maintaining\nmodularity, improving interpretability, and significantly enhancing\ncomputational efficiency. Our orchestration framework is built upon three key\ninnovations: (1) a central controller LLM that analyzes user inputs and\ndynamically routes tasks to appropriate specialized models through carefully\ndesigned agents; (2) a parallel Text-to-Speech architecture that enables true\nfull-duplex interaction with seamless interruption handling and natural\nconversational flow; and (3) a cross-modal memory integration system that\nmaintains coherent context across modalities through intelligent information\nsynthesis and retrieval, selectively avoiding unnecessary modality calls in\ncertain scenarios to improve response speed. Extensive evaluations demonstrate\nthat MLLM Orchestration achieves comprehensive multimodal capabilities without\nadditional training, performance improvements of up to 7.8% over traditional\njointly-trained approaches on standard benchmarks, reduced latency by 10.3%,\nand significantly enhanced interpretability through explicit orchestration\nprocesses.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10297", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10297", "abs": "https://arxiv.org/abs/2508.10297", "authors": ["Yiyi Ma", "Yuanzhi Liang", "Xiu Li", "Chi Zhang", "Xuelong Li"], "title": "InterSyn: Interleaved Learning for Dynamic Motion Synthesis in the Wild", "comment": "Accepted by ICCV2025", "summary": "We present Interleaved Learning for Motion Synthesis (InterSyn), a novel\nframework that targets the generation of realistic interaction motions by\nlearning from integrated motions that consider both solo and multi-person\ndynamics. Unlike previous methods that treat these components separately,\nInterSyn employs an interleaved learning strategy to capture the natural,\ndynamic interactions and nuanced coordination inherent in real-world scenarios.\nOur framework comprises two key modules: the Interleaved Interaction Synthesis\n(INS) module, which jointly models solo and interactive behaviors in a unified\nparadigm from a first-person perspective to support multiple character\ninteractions, and the Relative Coordination Refinement (REC) module, which\nrefines mutual dynamics and ensures synchronized motions among characters.\nExperimental results show that the motion sequences generated by InterSyn\nexhibit higher text-to-motion alignment and improved diversity compared with\nrecent methods, setting a new benchmark for robust and natural motion\nsynthesis. Additionally, our code will be open-sourced in the future to promote\nfurther research and development in this area.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10019", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10019", "abs": "https://arxiv.org/abs/2508.10019", "authors": ["Li Wang", "Changhao Zhang", "Zengqi Xiu", "Kai Lu", "Xin Yu", "Kui Zhang", "Wenjun Wu"], "title": "Decoupling Understanding from Reasoning via Problem Space Mapping for Small-scale Model Reasoning", "comment": null, "summary": "Despite recent advances in the reasoning capabilities of Large Language\nModels (LLMs), improving the reasoning ability of Small Language Models (SLMs,\ne.g., $\\leq$ 1.5B) remains challenging. A key obstacle lies in the complexity\nand variability of natural language: essentially equivalent problems often\nappear in diverse surface forms, often obscured by redundant or distracting\ndetails. This imposes a dual burden on SLMs: they must first extract the core\nproblem from complex linguistic input, and then perform reasoning based on that\nunderstanding. The resulting vast and noisy problem space hinders optimization,\nparticularly for models with limited capacity. To address this, we propose a\nnew framework that decouples understanding from reasoning by mapping natural\nlanguage problems into a canonical problem space-a semantically simplified yet\nexpressive domain. This enables SLMs to focus on reasoning over standardized\ninputs, free from linguistic variability. Within this framework, we introduce\nDURIT (Decoupled Understanding from Reasoning via Iterative Training), a\nthree-step algorithm that iteratively: (1) mapping natural language problems\nvia reinforcement learning, (2) aligns reasoning trajectories through\nself-distillation, and (3) trains reasoning policies in the problem space. The\nmapper and reasoner are co-trained in an alternating loop throughout this\nprocess. Experiments show that DURIT substantially improves SLMs' performance\non both in-domain and out-of-domain mathematical and logical reasoning tasks.\nBeyond improving reasoning capabilities, DURIT also improves the robustness of\nreasoning, validating decoupling understanding from reasoning as an effective\nstrategy for strengthening SLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10024", "categories": ["cs.CL", "cs.AI", "cs.IR", "I.2.0"], "pdf": "https://arxiv.org/pdf/2508.10024", "abs": "https://arxiv.org/abs/2508.10024", "authors": ["J. Pablo Muñoz", "Jinjie Yuan"], "title": "RTTC: Reward-Guided Collaborative Test-Time Compute", "comment": null, "summary": "Test-Time Compute (TTC) has emerged as a powerful paradigm for enhancing the\nperformance of Large Language Models (LLMs) at inference, leveraging strategies\nsuch as Test-Time Training (TTT) and Retrieval-Augmented Generation (RAG).\nHowever, the optimal adaptation strategy varies across queries, and\nindiscriminate application of TTC strategy incurs substantial computational\noverhead. In this work, we introduce Reward-Guided Test-Time Compute (RTTC), a\nnovel framework that adaptively selects the most effective TTC strategy for\neach query via a pretrained reward model, maximizing downstream accuracy across\ndiverse domains and tasks. RTTC operates in a distributed server-client\narchitecture, retrieving relevant samples from a remote knowledge base and\napplying RAG or lightweight fine-tuning on client devices only when necessary.\nTo further mitigate redundant computation, we propose Query-State Caching,\nwhich enables the efficient reuse of historical query states at both retrieval\nand adaptation levels. Extensive experiments across multiple LLMs and\nbenchmarks demonstrate that RTTC consistently achieves superior accuracy\ncompared to vanilla RAG or TTT, validating the necessity of adaptive,\nreward-guided TTC selection and the potential of RTTC for scalable,\nhigh-performance language model adaptation.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test-time training", "test-time compute"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10359", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10359", "abs": "https://arxiv.org/abs/2508.10359", "authors": ["Hao Wang", "Hongkui Zheng", "Kai He", "Abolfazl Razi"], "title": "AtomDiffuser: Time-Aware Degradation Modeling for Drift and Beam Damage in STEM Imaging", "comment": null, "summary": "Scanning transmission electron microscopy (STEM) plays a critical role in\nmodern materials science, enabling direct imaging of atomic structures and\ntheir evolution under external interferences. However, interpreting\ntime-resolved STEM data remains challenging due to two entangled degradation\neffects: spatial drift caused by mechanical and thermal instabilities, and\nbeam-induced signal loss resulting from radiation damage. These factors distort\nboth geometry and intensity in complex, temporally correlated ways, making it\ndifficult for existing methods to explicitly separate their effects or model\nmaterial dynamics at atomic resolution. In this work, we present AtomDiffuser,\na time-aware degradation modeling framework that disentangles sample drift and\nradiometric attenuation by predicting an affine transformation and a spatially\nvarying decay map between any two STEM frames. Unlike traditional denoising or\nregistration pipelines, our method leverages degradation as a physically\nheuristic, temporally conditioned process, enabling interpretable structural\nevolutions across time. Trained on synthetic degradation processes,\nAtomDiffuser also generalizes well to real-world cryo-STEM data. It further\nsupports high-resolution degradation inference and drift alignment, offering\ntools for visualizing and quantifying degradation patterns that correlate with\nradiation-induced atomic instabilities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10599", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10599", "abs": "https://arxiv.org/abs/2508.10599", "authors": ["Xinyan Jiang", "Lin Zhang", "Jiayi Zhang", "Qingsong Yang", "Guimin Hu", "Di Wang", "Lijie Hu"], "title": "MSRS: Adaptive Multi-Subspace Representation Steering for Attribute Alignment in Large Language Models", "comment": null, "summary": "Activation steering offers a promising approach to controlling the behavior\nof Large Language Models by directly manipulating their internal activations.\nHowever, most existing methods struggle to jointly steer multiple attributes,\noften resulting in interference and undesirable trade-offs. To address this\nchallenge, we propose Multi-Subspace Representation Steering (MSRS), a novel\nframework for effective multi-attribute steering via subspace representation\nfine-tuning. MSRS reduces inter-attribute interference by allocating orthogonal\nsubspaces to each attribute, isolating their influence within the model's\nrepresentation space. MSRS also incorporates a hybrid subspace composition\nstrategy: it combines attribute-specific subspaces for unique steering\ndirections with a shared subspace for common steering directions. A dynamic\nweighting function learns to efficiently integrate these components for precise\ncontrol. During inference, MSRS introduces a token-level steering mechanism\nthat dynamically identifies and intervenes on the most semantically relevant\ntokens, enabling fine-grained behavioral modulation. Experimental results show\nthat MSRS significantly reduces attribute conflicts, surpasses existing methods\nacross a range of attributes, and generalizes effectively to diverse downstream\ntasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10026", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10026", "abs": "https://arxiv.org/abs/2508.10026", "authors": ["Kai Zhao", "Yanjun Zhao", "Jiaming Song", "Shien He", "Lusheng Zhang", "Qiang Zhang", "Tianjiao Li"], "title": "SABER: Switchable and Balanced Training for Efficient LLM Reasoning", "comment": null, "summary": "Large language models (LLMs) empowered by chain-of-thought reasoning have\nachieved impressive accuracy on complex tasks but suffer from excessive\ninference costs and latency when applied uniformly to all problems. We propose\nSABER (Switchable and Balanced Training for Efficient LLM Reasoning), a\nreinforcement learning framework that endows LLMs with user-controllable,\ntoken-budgeted reasoning. SABER first profiles each training example's\nbase-model thinking token usage and assigns it to one of the predefined budget\ntiers. During fine-tuning, the model is guided by system prompts and\nlength-aware rewards to respect its assigned budget. In parallel, we\nincorporate no-think examples to ensure the model remains reliable even when\nexplicit reasoning is turned off. SABER further supports four discrete\ninference modes - NoThink, FastThink, CoreThink, and DeepThink, enabling\nflexible trade-offs between latency and reasoning depth. Extensive evaluations\non math reasoning (MATH, GSM8K), code generation (MBPP), and logical reasoning\n(LiveBench-Reasoning) demonstrate that SABER achieves high accuracy under tight\nbudgets, graceful degradation, and effective cross-scale and cross-domain\ngeneralization. In particular, SABER-FastThink cuts reasoning length by 65.4%\nand yields a 3.6% accuracy gain compared with the base model on the MATH\nbenchmark.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "code generation"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10367", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10367", "abs": "https://arxiv.org/abs/2508.10367", "authors": ["Pablo Hernández-Cámara", "Alexandra Gomez-Villa", "Jose Manuel Jaén-Lorites", "Jorge Vila-Tomás", "Jesus Malo", "Valero Laparra"], "title": "Contrast Sensitivity Function of Multimodal Vision-Language Models", "comment": null, "summary": "Assessing the alignment of multimodal vision-language models~(VLMs) with\nhuman perception is essential to understand how they perceive low-level visual\nfeatures. A key characteristic of human vision is the contrast sensitivity\nfunction (CSF), which describes sensitivity to spatial frequency at\nlow-contrasts. Here, we introduce a novel behavioral psychophysics-inspired\nmethod to estimate the CSF of chat-based VLMs by directly prompting them to\njudge pattern visibility at different contrasts for each frequency. This\nmethodology is closer to the real experiments in psychophysics than the\npreviously reported. Using band-pass filtered noise images and a diverse set of\nprompts, we assess model responses across multiple architectures. We find that\nwhile some models approximate human-like CSF shape or magnitude, none fully\nreplicate both. Notably, prompt phrasing has a large effect on the responses,\nraising concerns about prompt stability. Our results provide a new framework\nfor probing visual sensitivity in multimodal models and reveal key gaps between\ntheir visual representations and human perception.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10669", "categories": ["cs.AI", "cs.IR", "H.3.3; I.2.7; H.2.8"], "pdf": "https://arxiv.org/pdf/2508.10669", "abs": "https://arxiv.org/abs/2508.10669", "authors": ["Zhenye Yang", "Jinpeng Chen", "Huan Li", "Xiongnan Jin", "Xuanyang Li", "Junwei Zhang", "Hongbo Gao", "Kaimin Wei", "Senzhang Wang"], "title": "STEP: Stepwise Curriculum Learning for Context-Knowledge Fusion in Conversational Recommendation", "comment": "10 pages; 4 figures; 6 tables; code available at\n  https://github.com/Alex-bupt/STEP", "summary": "Conversational recommender systems (CRSs) aim to proactively capture user\npreferences through natural language dialogue and recommend high-quality items.\nTo achieve this, CRS gathers user preferences via a dialog module and builds\nuser profiles through a recommendation module to generate appropriate\nrecommendations. However, existing CRS faces challenges in capturing the deep\nsemantics of user preferences and dialogue context. In particular, the\nefficient integration of external knowledge graph (KG) information into\ndialogue generation and recommendation remains a pressing issue. Traditional\napproaches typically combine KG information directly with dialogue content,\nwhich often struggles with complex semantic relationships, resulting in\nrecommendations that may not align with user expectations.\n  To address these challenges, we introduce STEP, a conversational recommender\ncentered on pre-trained language models that combines curriculum-guided\ncontext-knowledge fusion with lightweight task-specific prompt tuning. At its\nheart, an F-Former progressively aligns the dialogue context with\nknowledge-graph entities through a three-stage curriculum, thus resolving\nfine-grained semantic mismatches. The fused representation is then injected\ninto the frozen language model via two minimal yet adaptive prefix prompts: a\nconversation prefix that steers response generation toward user intent and a\nrecommendation prefix that biases item ranking toward knowledge-consistent\ncandidates. This dual-prompt scheme allows the model to share cross-task\nsemantics while respecting the distinct objectives of dialogue and\nrecommendation. Experimental results show that STEP outperforms mainstream\nmethods in the precision of recommendation and dialogue quality in two public\ndatasets.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue", "fine-grained"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10382", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10382", "abs": "https://arxiv.org/abs/2508.10382", "authors": ["Hyundo Lee", "Suhyung Choi", "Byoung-Tak Zhang", "Inwoo Hwang"], "title": "Towards Spatially Consistent Image Generation: On Incorporating Intrinsic Scene Properties into Diffusion Models", "comment": null, "summary": "Image generation models trained on large datasets can synthesize high-quality\nimages but often produce spatially inconsistent and distorted images due to\nlimited information about the underlying structures and spatial layouts. In\nthis work, we leverage intrinsic scene properties (e.g., depth, segmentation\nmaps) that provide rich information about the underlying scene, unlike prior\napproaches that solely rely on image-text pairs or use intrinsics as\nconditional inputs. Our approach aims to co-generate both images and their\ncorresponding intrinsics, enabling the model to implicitly capture the\nunderlying scene structure and generate more spatially consistent and realistic\nimages. Specifically, we first extract rich intrinsic scene properties from a\nlarge image dataset with pre-trained estimators, eliminating the need for\nadditional scene information or explicit 3D representations. We then aggregate\nvarious intrinsic scene properties into a single latent variable using an\nautoencoder. Building upon pre-trained large-scale Latent Diffusion Models\n(LDMs), our method simultaneously denoises the image and intrinsic domains by\ncarefully sharing mutual information so that the image and intrinsic reflect\neach other without degrading image quality. Experimental results demonstrate\nthat our method corrects spatial inconsistencies and produces a more natural\nlayout of scenes while maintaining the fidelity and textual alignment of the\nbase model (e.g., Stable Diffusion).", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10703", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10703", "abs": "https://arxiv.org/abs/2508.10703", "authors": ["Yiping Song", "Jiaoyan Chen", "Renate A. Schmidt"], "title": "GenOM: Ontology Matching with Description Generation and Large Language Model", "comment": null, "summary": "Ontology matching (OM) plays an essential role in enabling semantic\ninteroperability and integration across heterogeneous knowledge sources,\nparticularly in the biomedical domain which contains numerous complex concepts\nrelated to diseases and pharmaceuticals. This paper introduces GenOM, a large\nlanguage model (LLM)-based ontology alignment framework, which enriches the\nsemantic representations of ontology concepts via generating textual\ndefinitions, retrieves alignment candidates with an embedding model, and\nincorporates exact matching-based tools to improve precision. Extensive\nexperiments conducted on the OAEI Bio-ML track demonstrate that GenOM can often\nachieve competitive performance, surpassing many baselines including\ntraditional OM systems and recent LLM-based methods. Further ablation studies\nconfirm the effectiveness of semantic enrichment and few-shot prompting,\nhighlighting the framework's robustness and adaptability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10745", "categories": ["cs.AI", "cs.CV", "cs.LG", "cs.MA", "cs.MM"], "pdf": "https://arxiv.org/pdf/2508.10745", "abs": "https://arxiv.org/abs/2508.10745", "authors": ["Sayan Nag", "K J Joseph", "Koustava Goswami", "Vlad I Morariu", "Balaji Vasan Srinivasan"], "title": "Agentic Design Review System", "comment": null, "summary": "Evaluating graphic designs involves assessing it from multiple facets like\nalignment, composition, aesthetics and color choices. Evaluating designs in a\nholistic way involves aggregating feedback from individual expert reviewers.\nTowards this, we propose an Agentic Design Review System (AgenticDRS), where\nmultiple agents collaboratively analyze a design, orchestrated by a meta-agent.\nA novel in-context exemplar selection approach based on graph matching and a\nunique prompt expansion method plays central role towards making each agent\ndesign aware. Towards evaluating this framework, we propose DRS-BENCH\nbenchmark. Thorough experimental evaluation against state-of-the-art baselines\nadapted to the problem setup, backed-up with critical ablation experiments\nbrings out the efficacy of Agentic-DRS in evaluating graphic designs and\ngenerating actionable feedback. We hope that this work will attract attention\nto this pragmatic, yet under-explored research direction.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10747", "categories": ["cs.AI", "cs.RO"], "pdf": "https://arxiv.org/pdf/2508.10747", "abs": "https://arxiv.org/abs/2508.10747", "authors": ["Sangwoo Jeon", "Juchul Shin", "Gyeong-Tae Kim", "YeonJe Cho", "Seongwoo Kim"], "title": "Scaling Up without Fading Out: Goal-Aware Sparse GNN for RL-based Generalized Planning", "comment": "16 pages, 10 figures", "summary": "Generalized planning using deep reinforcement learning (RL) combined with\ngraph neural networks (GNNs) has shown promising results in various symbolic\nplanning domains described by PDDL. However, existing approaches typically\nrepresent planning states as fully connected graphs, leading to a combinatorial\nexplosion in edge information and substantial sparsity as problem scales grow,\nespecially evident in large grid-based environments. This dense representation\nresults in diluted node-level information, exponentially increases memory\nrequirements, and ultimately makes learning infeasible for larger-scale\nproblems. To address these challenges, we propose a sparse, goal-aware GNN\nrepresentation that selectively encodes relevant local relationships and\nexplicitly integrates spatial features related to the goal. We validate our\napproach by designing novel drone mission scenarios based on PDDL within a grid\nworld, effectively simulating realistic mission execution environments. Our\nexperimental results demonstrate that our method scales effectively to larger\ngrid sizes previously infeasible with dense graph representations and\nsubstantially improves policy generalization and success rates. Our findings\nprovide a practical foundation for addressing realistic, large-scale\ngeneralized planning tasks.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10030", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10030", "abs": "https://arxiv.org/abs/2508.10030", "authors": ["Saaduddin Mahmud", "Mason Nakamura", "Kyle H. Wray", "Shlomo Zilberstein"], "title": "Inference-Aware Prompt Optimization for Aligning Black-Box Large Language Models", "comment": "17 pages", "summary": "Prompt optimization methods have demonstrated significant effectiveness in\naligning black-box large language models (LLMs). In parallel, inference scaling\nstrategies such as Best-of-N Sampling and Majority Voting have also proven to\nenhance alignment and performance by trading off computation. However, existing\nprompt optimization approaches are inference strategy agnostic; that is, they\noptimize prompts without regard to the inference strategy employed during\ndeployment. This constitutes a significant methodological gap, as our empirical\nand theoretical analysis reveals a strong interdependence between these two\nparadigms. Moreover, we find that user preferences regarding trade-offs among\nmultiple objectives and inference budgets substantially influence the choice of\nprompt and inference configuration. To address this gap, we introduce a unified\nnovel framework named IAPO (Inference-Aware Prompt Optimization) that jointly\noptimizes the prompt and inference scale, while being aware of the inference\nbudget and different task objectives. We then develop a fixed-budget training\nalgorithm for IAPO, which we call PSST (Prompt Scaling via Sequential\nTrimming), and analyze finite-budget guarantees on error probability. Finally,\nwe evaluate the effectiveness of PSST on six different tasks, including\nmulti-objective text generation and reasoning, and demonstrate the critical\nrole of incorporating inference-awareness when aligning black-box LLMs through\nprompt optimization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10036", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10036", "abs": "https://arxiv.org/abs/2508.10036", "authors": ["Dong Zhao", "Yadong Wang", "Xiang Chen", "Chenxi Wang", "Hongliang Dai", "Chuanxing Geng", "Shengzhong Zhang", "Shaoyuan Li", "Sheng-Jun Huang"], "title": "Reflect then Learn: Active Prompting for Information Extraction Guided by Introspective Confusion", "comment": "Under Review", "summary": "Large Language Models (LLMs) show remarkable potential for few-shot\ninformation extraction (IE), yet their performance is highly sensitive to the\nchoice of in-context examples. Conventional selection strategies often fail to\nprovide informative guidance, as they overlook a key source of model\nfallibility: confusion stemming not just from semantic content, but also from\nthe generation of well-structured formats required by IE tasks. To address\nthis, we introduce Active Prompting for Information Extraction (APIE), a novel\nactive prompting framework guided by a principle we term introspective\nconfusion. Our method empowers an LLM to assess its own confusion through a\ndual-component uncertainty metric that uniquely quantifies both Format\nUncertainty (difficulty in generating correct syntax) and Content Uncertainty\n(inconsistency in extracted semantics). By ranking unlabeled data with this\ncomprehensive score, our framework actively selects the most challenging and\ninformative samples to serve as few-shot exemplars. Extensive experiments on\nfour benchmarks show that our approach consistently outperforms strong\nbaselines, yielding significant improvements in both extraction accuracy and\nrobustness. Our work highlights the critical importance of a fine-grained,\ndual-level view of model uncertainty when it comes to building effective and\nreliable structured generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10180", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10180", "abs": "https://arxiv.org/abs/2508.10180", "authors": ["Wenlong Deng", "Jiaming Zhang", "Qi Zeng", "Christos Thrampoulidis", "Boying Gong", "Xiaoxiao Li"], "title": "Efficient Forward-Only Data Valuation for Pretrained LLMs and VLMs", "comment": null, "summary": "Quantifying the influence of individual training samples is essential for\nenhancing the transparency and accountability of large language models (LLMs)\nand vision-language models (VLMs). However, existing data valuation methods\noften rely on Hessian information or model retraining, making them\ncomputationally prohibitive for billion-parameter models. In this work, we\nintroduce For-Value, a forward-only data valuation framework that enables\nscalable and efficient influence estimation for both LLMs and VLMs. By\nleveraging the rich representations of modern foundation models, For-Value\ncomputes influence scores using a simple closed-form expression based solely on\na single forward pass, thereby eliminating the need for costly gradient\ncomputations. Our theoretical analysis demonstrates that For-Value accurately\nestimates per-sample influence by capturing alignment in hidden representations\nand prediction errors between training and validation samples. Extensive\nexperiments show that For-Value matches or outperforms gradient-based baselines\nin identifying impactful fine-tuning examples and effectively detecting\nmislabeled data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10450", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10450", "abs": "https://arxiv.org/abs/2508.10450", "authors": ["Pablo Hernández-Cámara", "Jesus Malo", "Valero Laparra"], "title": "From Images to Perception: Emergence of Perceptual Properties by Reconstructing Images", "comment": null, "summary": "A number of scientists suggested that human visual perception may emerge from\nimage statistics, shaping efficient neural representations in early vision. In\nthis work, a bio-inspired architecture that can accommodate several known facts\nin the retina-V1 cortex, the PerceptNet, has been end-to-end optimized for\ndifferent tasks related to image reconstruction: autoencoding, denoising,\ndeblurring, and sparsity regularization. Our results show that the encoder\nstage (V1-like layer) consistently exhibits the highest correlation with human\nperceptual judgments on image distortion despite not using perceptual\ninformation in the initialization or training. This alignment exhibits an\noptimum for moderate noise, blur and sparsity. These findings suggest that the\nvisual system may be tuned to remove those particular levels of distortion with\nthat level of sparsity and that biologically inspired models can learn\nperceptual metrics without human supervision.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10453", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10453", "abs": "https://arxiv.org/abs/2508.10453", "authors": ["Qiang Zhu", "Xiandong Meng", "Yuxian Jiang", "Fan Zhang", "David Bull", "Shuyuan Zhu", "Bing Zeng"], "title": "Trajectory-aware Shifted State Space Models for Online Video Super-Resolution", "comment": null, "summary": "Online video super-resolution (VSR) is an important technique for many\nreal-world video processing applications, which aims to restore the current\nhigh-resolution video frame based on temporally previous frames. Most of the\nexisting online VSR methods solely employ one neighboring previous frame to\nachieve temporal alignment, which limits long-range temporal modeling of\nvideos. Recently, state space models (SSMs) have been proposed with linear\ncomputational complexity and a global receptive field, which significantly\nimprove computational efficiency and performance. In this context, this paper\npresents a novel online VSR method based on Trajectory-aware Shifted SSMs\n(TS-Mamba), leveraging both long-term trajectory modeling and low-complexity\nMamba to achieve efficient spatio-temporal information aggregation.\nSpecifically, TS-Mamba first constructs the trajectories within a video to\nselect the most similar tokens from the previous frames. Then, a\nTrajectory-aware Shifted Mamba Aggregation (TSMA) module consisting of proposed\nshifted SSMs blocks is employed to aggregate the selected tokens. The shifted\nSSMs blocks are designed based on Hilbert scannings and corresponding shift\noperations to compensate for scanning losses and strengthen the spatial\ncontinuity of Mamba. Additionally, we propose a trajectory-aware loss function\nto supervise the trajectory generation, ensuring the accuracy of token\nselection when training our model. Extensive experiments on three widely used\nVSR test datasets demonstrate that compared with six online VSR benchmark\nmodels, our TS-Mamba achieves state-of-the-art performance in most cases and\nover 22.7\\% complexity reduction (in MACs). The source code for TS-Mamba will\nbe available at https://github.com.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10464", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10464", "abs": "https://arxiv.org/abs/2508.10464", "authors": ["Bella Specktor-Fadida", "Malte Hoffmann"], "title": "SingleStrip: learning skull-stripping from a single labeled example", "comment": "Accepted as an oral presentation to the MICCAI 2025 Data Engineering\n  in Medical Imaging (DEMI) workshop", "summary": "Deep learning segmentation relies heavily on labeled data, but manual\nlabeling is laborious and time-consuming, especially for volumetric images such\nas brain magnetic resonance imaging (MRI). While recent domain-randomization\ntechniques alleviate the dependency on labeled data by synthesizing diverse\ntraining images from label maps, they offer limited anatomical variability when\nvery few label maps are available. Semi-supervised self-training addresses\nlabel scarcity by iteratively incorporating model predictions into the training\nset, enabling networks to learn from unlabeled data. In this work, we combine\ndomain randomization with self-training to train three-dimensional\nskull-stripping networks using as little as a single labeled example. First, we\nautomatically bin voxel intensities, yielding labels we use to synthesize\nimages for training an initial skull-stripping model. Second, we train a\nconvolutional autoencoder (AE) on the labeled example and use its\nreconstruction error to assess the quality of brain masks predicted for\nunlabeled data. Third, we select the top-ranking pseudo-labels to fine-tune the\nnetwork, achieving skull-stripping performance on out-of-distribution data that\napproaches models trained with more labeled images. We compare AE-based ranking\nto consistency-based ranking under test-time augmentation, finding that the AE\napproach yields a stronger correlation with segmentation accuracy. Our results\nhighlight the potential of combining domain randomization and AE-based quality\ncontrol to enable effective semi-supervised segmentation from extremely limited\nlabeled data. This strategy may ease the labeling burden that slows progress in\nstudies involving new anatomical structures or emerging imaging techniques.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10469", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10469", "abs": "https://arxiv.org/abs/2508.10469", "authors": ["Maimunatu Tunau", "Vincent Gbouna Zakka", "Zhuangzhuang Dai"], "title": "Enhanced Sparse Point Cloud Data Processing for Privacy-aware Human Action Recognition", "comment": null, "summary": "Human Action Recognition (HAR) plays a crucial role in healthcare, fitness\ntracking, and ambient assisted living technologies. While traditional vision\nbased HAR systems are effective, they pose privacy concerns. mmWave radar\nsensors offer a privacy preserving alternative but present challenges due to\nthe sparse and noisy nature of their point cloud data. In the literature, three\nprimary data processing methods: Density-Based Spatial Clustering of\nApplications with Noise (DBSCAN), the Hungarian Algorithm, and Kalman Filtering\nhave been widely used to improve the quality and continuity of radar data.\nHowever, a comprehensive evaluation of these methods, both individually and in\ncombination, remains lacking. This paper addresses that gap by conducting a\ndetailed performance analysis of the three methods using the MiliPoint dataset.\nWe evaluate each method individually, all possible pairwise combinations, and\nthe combination of all three, assessing both recognition accuracy and\ncomputational cost. Furthermore, we propose targeted enhancements to the\nindividual methods aimed at improving accuracy. Our results provide crucial\ninsights into the strengths and trade-offs of each method and their\nintegrations, guiding future work on mmWave based HAR systems", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10019", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10019", "abs": "https://arxiv.org/abs/2508.10019", "authors": ["Li Wang", "Changhao Zhang", "Zengqi Xiu", "Kai Lu", "Xin Yu", "Kui Zhang", "Wenjun Wu"], "title": "Decoupling Understanding from Reasoning via Problem Space Mapping for Small-scale Model Reasoning", "comment": null, "summary": "Despite recent advances in the reasoning capabilities of Large Language\nModels (LLMs), improving the reasoning ability of Small Language Models (SLMs,\ne.g., $\\leq$ 1.5B) remains challenging. A key obstacle lies in the complexity\nand variability of natural language: essentially equivalent problems often\nappear in diverse surface forms, often obscured by redundant or distracting\ndetails. This imposes a dual burden on SLMs: they must first extract the core\nproblem from complex linguistic input, and then perform reasoning based on that\nunderstanding. The resulting vast and noisy problem space hinders optimization,\nparticularly for models with limited capacity. To address this, we propose a\nnew framework that decouples understanding from reasoning by mapping natural\nlanguage problems into a canonical problem space-a semantically simplified yet\nexpressive domain. This enables SLMs to focus on reasoning over standardized\ninputs, free from linguistic variability. Within this framework, we introduce\nDURIT (Decoupled Understanding from Reasoning via Iterative Training), a\nthree-step algorithm that iteratively: (1) mapping natural language problems\nvia reinforcement learning, (2) aligns reasoning trajectories through\nself-distillation, and (3) trains reasoning policies in the problem space. The\nmapper and reasoner are co-trained in an alternating loop throughout this\nprocess. Experiments show that DURIT substantially improves SLMs' performance\non both in-domain and out-of-domain mathematical and logical reasoning tasks.\nBeyond improving reasoning capabilities, DURIT also improves the robustness of\nreasoning, validating decoupling understanding from reasoning as an effective\nstrategy for strengthening SLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10295", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10295", "abs": "https://arxiv.org/abs/2508.10295", "authors": ["Christian M. Angel", "Francis Ferraro"], "title": "Inductive Bias Extraction and Matching for LLM Prompts", "comment": null, "summary": "The active research topic of prompt engineering makes it evident that LLMs\nare sensitive to small changes in prompt wording. A portion of this can be\nascribed to the inductive bias that is present in the LLM. By using an LLM's\noutput as a portion of its prompt, we can more easily create satisfactory\nwording for prompts. This has the effect of creating a prompt that matches the\ninductive bias in model. Empirically, we show that using this Inductive Bias\nExtraction and Matching strategy improves LLM Likert ratings used for\nclassification by up to 19% and LLM Likert ratings used for ranking by up to\n27%.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10498", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10498", "abs": "https://arxiv.org/abs/2508.10498", "authors": ["Jianda Mao", "Kaibo Wang", "Yang Xiang", "Kani Chen"], "title": "TweezeEdit: Consistent and Efficient Image Editing with Path Regularization", "comment": null, "summary": "Large-scale pre-trained diffusion models empower users to edit images through\ntext guidance. However, existing methods often over-align with target prompts\nwhile inadequately preserving source image semantics. Such approaches generate\ntarget images explicitly or implicitly from the inversion noise of the source\nimages, termed the inversion anchors. We identify this strategy as suboptimal\nfor semantic preservation and inefficient due to elongated editing paths. We\npropose TweezeEdit, a tuning- and inversion-free framework for consistent and\nefficient image editing. Our method addresses these limitations by regularizing\nthe entire denoising path rather than relying solely on the inversion anchors,\nensuring source semantic retention and shortening editing paths. Guided by\ngradient-driven regularization, we efficiently inject target prompt semantics\nalong a direct path using a consistency model. Extensive experiments\ndemonstrate TweezeEdit's superior performance in semantic preservation and\ntarget alignment, outperforming existing methods. Remarkably, it requires only\n12 steps (1.6 seconds per edit), underscoring its potential for real-time\napplications.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10024", "categories": ["cs.CL", "cs.AI", "cs.IR", "I.2.0"], "pdf": "https://arxiv.org/pdf/2508.10024", "abs": "https://arxiv.org/abs/2508.10024", "authors": ["J. Pablo Muñoz", "Jinjie Yuan"], "title": "RTTC: Reward-Guided Collaborative Test-Time Compute", "comment": null, "summary": "Test-Time Compute (TTC) has emerged as a powerful paradigm for enhancing the\nperformance of Large Language Models (LLMs) at inference, leveraging strategies\nsuch as Test-Time Training (TTT) and Retrieval-Augmented Generation (RAG).\nHowever, the optimal adaptation strategy varies across queries, and\nindiscriminate application of TTC strategy incurs substantial computational\noverhead. In this work, we introduce Reward-Guided Test-Time Compute (RTTC), a\nnovel framework that adaptively selects the most effective TTC strategy for\neach query via a pretrained reward model, maximizing downstream accuracy across\ndiverse domains and tasks. RTTC operates in a distributed server-client\narchitecture, retrieving relevant samples from a remote knowledge base and\napplying RAG or lightweight fine-tuning on client devices only when necessary.\nTo further mitigate redundant computation, we propose Query-State Caching,\nwhich enables the efficient reuse of historical query states at both retrieval\nand adaptation levels. Extensive experiments across multiple LLMs and\nbenchmarks demonstrate that RTTC consistently achieves superior accuracy\ncompared to vanilla RAG or TTT, validating the necessity of adaptive,\nreward-guided TTC selection and the potential of RTTC for scalable,\nhigh-performance language model adaptation.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test-time training", "test-time compute"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10523", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10523", "abs": "https://arxiv.org/abs/2508.10523", "authors": ["Ayushman Sarkar", "Mohd Yamani Idna Idris", "Zhenyu Yu"], "title": "Reasoning in Computer Vision: Taxonomy, Models, Tasks, and Methodologies", "comment": null, "summary": "Visual reasoning is critical for a wide range of computer vision tasks that\ngo beyond surface-level object detection and classification. Despite notable\nadvances in relational, symbolic, temporal, causal, and commonsense reasoning,\nexisting surveys often address these directions in isolation, lacking a unified\nanalysis and comparison across reasoning types, methodologies, and evaluation\nprotocols. This survey aims to address this gap by categorizing visual\nreasoning into five major types (relational, symbolic, temporal, causal, and\ncommonsense) and systematically examining their implementation through\narchitectures such as graph-based models, memory networks, attention\nmechanisms, and neuro-symbolic systems. We review evaluation protocols designed\nto assess functional correctness, structural consistency, and causal validity,\nand critically analyze their limitations in terms of generalizability,\nreproducibility, and explanatory power. Beyond evaluation, we identify key open\nchallenges in visual reasoning, including scalability to complex scenes, deeper\nintegration of symbolic and neural paradigms, the lack of comprehensive\nbenchmark datasets, and reasoning under weak supervision. Finally, we outline a\nforward-looking research agenda for next-generation vision systems, emphasizing\nthat bridging perception and reasoning is essential for building transparent,\ntrustworthy, and cross-domain adaptive AI systems, particularly in critical\ndomains such as autonomous driving and medical diagnostics.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10026", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10026", "abs": "https://arxiv.org/abs/2508.10026", "authors": ["Kai Zhao", "Yanjun Zhao", "Jiaming Song", "Shien He", "Lusheng Zhang", "Qiang Zhang", "Tianjiao Li"], "title": "SABER: Switchable and Balanced Training for Efficient LLM Reasoning", "comment": null, "summary": "Large language models (LLMs) empowered by chain-of-thought reasoning have\nachieved impressive accuracy on complex tasks but suffer from excessive\ninference costs and latency when applied uniformly to all problems. We propose\nSABER (Switchable and Balanced Training for Efficient LLM Reasoning), a\nreinforcement learning framework that endows LLMs with user-controllable,\ntoken-budgeted reasoning. SABER first profiles each training example's\nbase-model thinking token usage and assigns it to one of the predefined budget\ntiers. During fine-tuning, the model is guided by system prompts and\nlength-aware rewards to respect its assigned budget. In parallel, we\nincorporate no-think examples to ensure the model remains reliable even when\nexplicit reasoning is turned off. SABER further supports four discrete\ninference modes - NoThink, FastThink, CoreThink, and DeepThink, enabling\nflexible trade-offs between latency and reasoning depth. Extensive evaluations\non math reasoning (MATH, GSM8K), code generation (MBPP), and logical reasoning\n(LiveBench-Reasoning) demonstrate that SABER achieves high accuracy under tight\nbudgets, graceful degradation, and effective cross-scale and cross-domain\ngeneralization. In particular, SABER-FastThink cuts reasoning length by 65.4%\nand yields a 3.6% accuracy gain compared with the base model on the MATH\nbenchmark.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "code generation"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10352", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10352", "abs": "https://arxiv.org/abs/2508.10352", "authors": ["Beso Mikaberidze", "Teimuraz Saghinadze", "Simon Ostermann", "Philipp Muller"], "title": "Cross-Prompt Encoder for Low-Performing Languages", "comment": null, "summary": "Soft prompts have emerged as a powerful alternative to adapters in\nparameter-efficient fine-tuning (PEFT), enabling large language models (LLMs)\nto adapt to downstream tasks without architectural changes or parameter\nupdates. While prior work has focused on stabilizing training via parameter\ninteraction in small neural prompt encoders, their broader potential for\ntransfer across languages remains unexplored. In this paper, we demonstrate\nthat a prompt encoder can play a central role in improving performance on\nlow-performing languages-those that achieve poor accuracy even under full-model\nfine-tuning. We introduce the Cross-Prompt Encoder (XPE), which combines a\nlightweight encoding architecture with multi-source training on typologically\ndiverse languages - a design that enables the model to capture abstract and\ntransferable patterns across languages. To complement XPE, we propose a Dual\nSoft Prompt mechanism that combines an encoder-based prompt with a directly\ntrained standard soft prompt. This hybrid design proves especially effective\nfor target languages that benefit from both broadly shared structure and\nlanguage-specific alignment. Experiments on the SIB-200 benchmark reveal a\nconsistent trade-off: XPE is most effective for low-performing languages, while\nhybrid variants offer broader adaptability across multilingual settings.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10030", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10030", "abs": "https://arxiv.org/abs/2508.10030", "authors": ["Saaduddin Mahmud", "Mason Nakamura", "Kyle H. Wray", "Shlomo Zilberstein"], "title": "Inference-Aware Prompt Optimization for Aligning Black-Box Large Language Models", "comment": "17 pages", "summary": "Prompt optimization methods have demonstrated significant effectiveness in\naligning black-box large language models (LLMs). In parallel, inference scaling\nstrategies such as Best-of-N Sampling and Majority Voting have also proven to\nenhance alignment and performance by trading off computation. However, existing\nprompt optimization approaches are inference strategy agnostic; that is, they\noptimize prompts without regard to the inference strategy employed during\ndeployment. This constitutes a significant methodological gap, as our empirical\nand theoretical analysis reveals a strong interdependence between these two\nparadigms. Moreover, we find that user preferences regarding trade-offs among\nmultiple objectives and inference budgets substantially influence the choice of\nprompt and inference configuration. To address this gap, we introduce a unified\nnovel framework named IAPO (Inference-Aware Prompt Optimization) that jointly\noptimizes the prompt and inference scale, while being aware of the inference\nbudget and different task objectives. We then develop a fixed-budget training\nalgorithm for IAPO, which we call PSST (Prompt Scaling via Sequential\nTrimming), and analyze finite-budget guarantees on error probability. Finally,\nwe evaluate the effectiveness of PSST on six different tasks, including\nmulti-objective text generation and reasoning, and demonstrate the critical\nrole of incorporating inference-awareness when aligning black-box LLMs through\nprompt optimization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10036", "categories": ["cs.CL", "cs.AI", "cs.IR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10036", "abs": "https://arxiv.org/abs/2508.10036", "authors": ["Dong Zhao", "Yadong Wang", "Xiang Chen", "Chenxi Wang", "Hongliang Dai", "Chuanxing Geng", "Shengzhong Zhang", "Shaoyuan Li", "Sheng-Jun Huang"], "title": "Reflect then Learn: Active Prompting for Information Extraction Guided by Introspective Confusion", "comment": "Under Review", "summary": "Large Language Models (LLMs) show remarkable potential for few-shot\ninformation extraction (IE), yet their performance is highly sensitive to the\nchoice of in-context examples. Conventional selection strategies often fail to\nprovide informative guidance, as they overlook a key source of model\nfallibility: confusion stemming not just from semantic content, but also from\nthe generation of well-structured formats required by IE tasks. To address\nthis, we introduce Active Prompting for Information Extraction (APIE), a novel\nactive prompting framework guided by a principle we term introspective\nconfusion. Our method empowers an LLM to assess its own confusion through a\ndual-component uncertainty metric that uniquely quantifies both Format\nUncertainty (difficulty in generating correct syntax) and Content Uncertainty\n(inconsistency in extracted semantics). By ranking unlabeled data with this\ncomprehensive score, our framework actively selects the most challenging and\ninformative samples to serve as few-shot exemplars. Extensive experiments on\nfour benchmarks show that our approach consistently outperforms strong\nbaselines, yielding significant improvements in both extraction accuracy and\nrobustness. Our work highlights the critical importance of a fine-grained,\ndual-level view of model uncertainty when it comes to building effective and\nreliable structured generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10404", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10404", "abs": "https://arxiv.org/abs/2508.10404", "authors": ["Huizhen Shu", "Xuying Li", "Qirui Wang", "Yuji Kosuga", "Mengqiu Tian", "Zhuo Li"], "title": "Layer-Wise Perturbations via Sparse Autoencoders for Adversarial Text Generation", "comment": null, "summary": "With the rapid proliferation of Natural Language Processing (NLP), especially\nLarge Language Models (LLMs), generating adversarial examples to jailbreak LLMs\nremains a key challenge for understanding model vulnerabilities and improving\nrobustness. In this context, we propose a new black-box attack method that\nleverages the interpretability of large models. We introduce the Sparse Feature\nPerturbation Framework (SFPF), a novel approach for adversarial text generation\nthat utilizes sparse autoencoders to identify and manipulate critical features\nin text. After using the SAE model to reconstruct hidden layer representations,\nwe perform feature clustering on the successfully attacked texts to identify\nfeatures with higher activations. These highly activated features are then\nperturbed to generate new adversarial texts. This selective perturbation\npreserves the malicious intent while amplifying safety signals, thereby\nincreasing their potential to evade existing defenses. Our method enables a new\nred-teaming strategy that balances adversarial effectiveness with safety\nalignment. Experimental results demonstrate that adversarial texts generated by\nSFPF can bypass state-of-the-art defense mechanisms, revealing persistent\nvulnerabilities in current NLP systems.However, the method's effectiveness\nvaries across prompts and layers, and its generalizability to other\narchitectures and larger models remains to be validated.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10567", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2508.10567", "abs": "https://arxiv.org/abs/2508.10567", "authors": ["Philipp Wolters", "Johannes Gilg", "Torben Teepe", "Gerhard Rigoll"], "title": "SpaRC-AD: A Baseline for Radar-Camera Fusion in End-to-End Autonomous Driving", "comment": "8 pages, 4 figures, 5 tables", "summary": "End-to-end autonomous driving systems promise stronger performance through\nunified optimization of perception, motion forecasting, and planning. However,\nvision-based approaches face fundamental limitations in adverse weather\nconditions, partial occlusions, and precise velocity estimation - critical\nchallenges in safety-sensitive scenarios where accurate motion understanding\nand long-horizon trajectory prediction are essential for collision avoidance.\nTo address these limitations, we propose SpaRC-AD, a query-based end-to-end\ncamera-radar fusion framework for planning-oriented autonomous driving. Through\nsparse 3D feature alignment, and doppler-based velocity estimation, we achieve\nstrong 3D scene representations for refinement of agent anchors, map polylines\nand motion modelling. Our method achieves strong improvements over the\nstate-of-the-art vision-only baselines across multiple autonomous driving\ntasks, including 3D detection (+4.8% mAP), multi-object tracking (+8.3% AMOTA),\nonline mapping (+1.8% mAP), motion prediction (-4.0% mADE), and trajectory\nplanning (-0.1m L2 and -9% TPC). We achieve both spatial coherence and temporal\nconsistency on multiple challenging benchmarks, including real-world open-loop\nnuScenes, long-horizon T-nuScenes, and closed-loop simulator Bench2Drive. We\nshow the effectiveness of radar-based fusion in safety-critical scenarios where\naccurate motion understanding and long-horizon trajectory prediction are\nessential for collision avoidance. The source code of all experiments is\navailable at https://phi-wol.github.io/sparcad/", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "consistency"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10576", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10576", "abs": "https://arxiv.org/abs/2508.10576", "authors": ["Zheng Qin", "Ruobing Zheng", "Yabing Wang", "Tianqi Li", "Yi Yuan", "Jingdong Chen", "Le Wang"], "title": "HumanSense: From Multimodal Perception to Empathetic Context-Aware Responses through Reasoning MLLMs", "comment": null, "summary": "While Multimodal Large Language Models (MLLMs) show immense promise for\nachieving truly human-like interactions, progress is hindered by the lack of\nfine-grained evaluation frameworks for human-centered scenarios, encompassing\nboth the understanding of complex human intentions and the provision of\nempathetic, context-aware responses. Here we introduce HumanSense, a\ncomprehensive benchmark designed to evaluate the human-centered perception and\ninteraction capabilities of MLLMs, with a particular focus on deep\nunderstanding of extended multimodal contexts and the formulation of rational\nfeedback. Our evaluation reveals that leading MLLMs still have considerable\nroom for improvement, particularly for advanced interaction-oriented tasks.\nSupplementing visual input with audio and text information yields substantial\nimprovements, and Omni-modal models show advantages on these tasks.\nFurthermore, we argue that appropriate feedback stems from a contextual\nanalysis of the interlocutor's needs and emotions, with reasoning ability\nserving as the key to unlocking it. Accordingly, we employ a multi-stage,\nmodality-progressive reinforcement learning to enhance the reasoning abilities\nof an Omni model, achieving substantial gains on evaluation results.\nAdditionally, we observe that successful reasoning processes exhibit highly\nconsistent thought patterns. By designing corresponding prompts, we also\nenhance the performance of non-reasoning models in a training-free manner.\nProject page:\n\\textcolor{brightpink}https://digital-avatar.github.io/ai/HumanSense/", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "fine-grained"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10616", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10616", "abs": "https://arxiv.org/abs/2508.10616", "authors": ["Daejune Choi", "Youchan No", "Jinhyung Lee", "Duksu Kim"], "title": "Fourier-Guided Attention Upsampling for Image Super-Resolution", "comment": "15 pages, 7 figures, under submission to a journal", "summary": "We propose Frequency-Guided Attention (FGA), a lightweight upsampling module\nfor single image super-resolution. Conventional upsamplers, such as Sub-Pixel\nConvolution, are efficient but frequently fail to reconstruct high-frequency\ndetails and introduce aliasing artifacts. FGA addresses these issues by\nintegrating (1) a Fourier feature-based Multi-Layer Perceptron (MLP) for\npositional frequency encoding, (2) a cross-resolution Correlation Attention\nLayer for adaptive spatial alignment, and (3) a frequency-domain L1 loss for\nspectral fidelity supervision. Adding merely 0.3M parameters, FGA consistently\nenhances performance across five diverse super-resolution backbones in both\nlightweight and full-capacity scenarios. Experimental results demonstrate\naverage PSNR gains of 0.12~0.14 dB and improved frequency-domain consistency by\nup to 29%, particularly evident on texture-rich datasets. Visual and spectral\nevaluations confirm FGA's effectiveness in reducing aliasing and preserving\nfine details, establishing it as a practical, scalable alternative to\ntraditional upsampling methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "consistency"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10695", "categories": ["cs.CL", "cs.AI", "cs.IR"], "pdf": "https://arxiv.org/pdf/2508.10695", "abs": "https://arxiv.org/abs/2508.10695", "authors": ["Alireza Salemi", "Hamed Zamani"], "title": "Learning from Natural Language Feedback for Personalized Question Answering", "comment": null, "summary": "Personalization is crucial for enhancing both the effectiveness and user\nsatisfaction of language technologies, particularly in information-seeking\ntasks like question answering. Current approaches for personalizing large\nlanguage models (LLMs) often rely on retrieval-augmented generation (RAG),\nfollowed by reinforcement learning with scalar reward signals to teach models\nhow to use retrieved personal context. We believe that these scalar rewards\nsometimes provide weak, non-instructive feedback, limiting learning efficiency\nand personalization quality. We introduce VAC, a novel framework for\npersonalized response generation that replaces scalar rewards with natural\nlanguage feedback (NLF) that are generated conditioned on the user profiles and\nthe question narratives. NLF serves as a rich and actionable supervision\nsignal, allowing the policy model to iteratively refine its outputs and\ninternalize effective personalization strategies. Training alternates between\noptimizing the feedback model and fine-tuning the policy model on the improved\nresponses, resulting in a policy model that no longer requires feedback at\ninference. Evaluation on the LaMP-QA benchmark that consists of three diverse\ndomains demonstrates consistent and significant improvements over the\nstate-of-the-art results. Human evaluations further confirm the superior\nquality of the generated responses. These results demonstrate that NLF provides\nmore effective signals for optimizing personalized question answering.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "question answering"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10839", "categories": ["cs.CL", "cs.AI", "cs.LG", "I.2.7; I.2.8"], "pdf": "https://arxiv.org/pdf/2508.10839", "abs": "https://arxiv.org/abs/2508.10839", "authors": ["Jim Dilkes", "Vahid Yazdanpanah", "Sebastian Stein"], "title": "Reinforced Language Models for Sequential Decision Making", "comment": null, "summary": "Large Language Models (LLMs) show potential as sequential decision-making\nagents, but their application is often limited due to a reliance on large,\ncomputationally expensive models. This creates a need to improve smaller\nmodels, yet existing post-training methods are designed for single-turn\ninteractions and cannot handle credit assignment in multi-step agentic tasks.\nTo address this, we introduce Multi-Step Group-Relative Policy Optimization\n(MS-GRPO), a new algorithm for post-training LLM agents, grounded in formal\nText-Mediated Stochastic Game (TSMG) and Language-Agent Policy (LAP)\nframeworks. For credit assignment, MS-GRPO attributes the entire cumulative\nepisode reward to each individual episode step. We supplement this algorithm\nwith a novel absolute-advantage-weighted episode sampling strategy that we show\nimproves training performance. We evaluate our approach by post-training a\n3-billion parameter model on Snake and Frozen Lake. Our experiments demonstrate\nthat the method is effective in improving decision-making performance: our\npost-trained 3B parameter model outperforms a 72B parameter baseline by 50% on\nthe Frozen Lake task. This work demonstrates that targeted post-training is a\npractical and efficient alternative to relying on model scale for creating\nsequential decision-making agents using LLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10848", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10848", "abs": "https://arxiv.org/abs/2508.10848", "authors": ["Chongyuan Dai", "Jinpeng Hu", "Hongchang Shi", "Zhuo Li", "Xun Yang", "Meng Wang"], "title": "Psyche-R1: Towards Reliable Psychological LLMs through Unified Empathy, Expertise, and Reasoning", "comment": null, "summary": "Amidst a shortage of qualified mental health professionals, the integration\nof large language models (LLMs) into psychological applications offers a\npromising way to alleviate the growing burden of mental health disorders.\nRecent reasoning-augmented LLMs have achieved remarkable performance in\nmathematics and programming, while research in the psychological domain has\npredominantly emphasized emotional support and empathetic dialogue, with\nlimited attention to reasoning mechanisms that are beneficial to generating\nreliable responses. Therefore, in this paper, we propose Psyche-R1, the first\nChinese psychological LLM that jointly integrates empathy, psychological\nexpertise, and reasoning, built upon a novel data curation pipeline.\nSpecifically, we design a comprehensive data synthesis pipeline that produces\nover 75k high-quality psychological questions paired with detailed rationales,\ngenerated through chain-of-thought (CoT) reasoning and iterative\nprompt-rationale optimization, along with 73k empathetic dialogues.\nSubsequently, we employ a hybrid training strategy wherein challenging samples\nare identified through a multi-LLM cross-selection strategy for group relative\npolicy optimization (GRPO) to improve reasoning ability, while the remaining\ndata is used for supervised fine-tuning (SFT) to enhance empathetic response\ngeneration and psychological domain knowledge. Extensive experiment results\ndemonstrate the effectiveness of the Psyche-R1 across several psychological\nbenchmarks, where our 7B Psyche-R1 achieves comparable results to 671B\nDeepSeek-R1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10404", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10404", "abs": "https://arxiv.org/abs/2508.10404", "authors": ["Huizhen Shu", "Xuying Li", "Qirui Wang", "Yuji Kosuga", "Mengqiu Tian", "Zhuo Li"], "title": "Layer-Wise Perturbations via Sparse Autoencoders for Adversarial Text Generation", "comment": null, "summary": "With the rapid proliferation of Natural Language Processing (NLP), especially\nLarge Language Models (LLMs), generating adversarial examples to jailbreak LLMs\nremains a key challenge for understanding model vulnerabilities and improving\nrobustness. In this context, we propose a new black-box attack method that\nleverages the interpretability of large models. We introduce the Sparse Feature\nPerturbation Framework (SFPF), a novel approach for adversarial text generation\nthat utilizes sparse autoencoders to identify and manipulate critical features\nin text. After using the SAE model to reconstruct hidden layer representations,\nwe perform feature clustering on the successfully attacked texts to identify\nfeatures with higher activations. These highly activated features are then\nperturbed to generate new adversarial texts. This selective perturbation\npreserves the malicious intent while amplifying safety signals, thereby\nincreasing their potential to evade existing defenses. Our method enables a new\nred-teaming strategy that balances adversarial effectiveness with safety\nalignment. Experimental results demonstrate that adversarial texts generated by\nSFPF can bypass state-of-the-art defense mechanisms, revealing persistent\nvulnerabilities in current NLP systems.However, the method's effectiveness\nvaries across prompts and layers, and its generalizability to other\narchitectures and larger models remains to be validated.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10667", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10667", "abs": "https://arxiv.org/abs/2508.10667", "authors": ["Shixiong Xu", "Chenghao Zhang", "Lubin Fan", "Yuan Zhou", "Bin Fan", "Shiming Xiang", "Gaofeng Meng", "Jieping Ye"], "title": "AddressVLM: Cross-view Alignment Tuning for Image Address Localization using Large Vision-Language Models", "comment": null, "summary": "Large visual language models (LVLMs) have demonstrated impressive performance\nin coarse-grained geo-localization at the country or city level, but they\nstruggle with fine-grained street-level localization within urban areas. In\nthis paper, we explore integrating city-wide address localization capabilities\ninto LVLMs, facilitating flexible address-related question answering using\nstreet-view images. A key challenge is that the street-view visual\nquestion-and-answer (VQA) data provides only microscopic visual cues, leading\nto subpar performance in fine-tuned models. To tackle this issue, we\nincorporate perspective-invariant satellite images as macro cues and propose\ncross-view alignment tuning including a satellite-view and street-view image\ngrafting mechanism, along with an automatic label generation mechanism. Then\nLVLM's global understanding of street distribution is enhanced through\ncross-view matching. Our proposed model, named AddressVLM, consists of\ntwo-stage training protocols: cross-view alignment tuning and address\nlocalization tuning. Furthermore, we have constructed two street-view VQA\ndatasets based on image address localization datasets from Pittsburgh and San\nFrancisco. Qualitative and quantitative evaluations demonstrate that AddressVLM\noutperforms counterpart LVLMs by over 9% and 12% in average address\nlocalization accuracy on these two datasets, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "question answering", "fine-grained"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10874", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.10874", "abs": "https://arxiv.org/abs/2508.10874", "authors": ["Yuchen Fan", "Kaiyan Zhang", "Heng Zhou", "Yuxin Zuo", "Yanxu Chen", "Yu Fu", "Xinwei Long", "Xuekai Zhu", "Che Jiang", "Yuchen Zhang", "Li Kang", "Gang Chen", "Cheng Huang", "Zhizhou He", "Bingning Wang", "Lei Bai", "Ning Ding", "Bowen Zhou"], "title": "SSRL: Self-Search Reinforcement Learning", "comment": null, "summary": "We investigate the potential of large language models (LLMs) to serve as\nefficient simulators for agentic search tasks in reinforcement learning (RL),\nthereby reducing dependence on costly interactions with external search\nengines. To this end, we first quantify the intrinsic search capability of LLMs\nvia structured prompting and repeated sampling, which we term Self-Search. Our\nresults reveal that LLMs exhibit strong scaling behavior with respect to the\ninference budget, achieving high pass@k on question-answering benchmarks,\nincluding the challenging BrowseComp task. Building on these observations, we\nintroduce Self-Search RL (SSRL), which enhances LLMs' Self-Search capability\nthrough format-based and rule-based rewards. SSRL enables models to iteratively\nrefine their knowledge utilization internally, without requiring access to\nexternal tools. Empirical evaluations demonstrate that SSRL-trained policy\nmodels provide a cost-effective and stable environment for search-driven RL\ntraining, reducing reliance on external search engines and facilitating robust\nsim-to-real transfer. We draw the following conclusions: 1) LLMs possess world\nknowledge that can be effectively elicited to achieve high performance; 2) SSRL\ndemonstrates the potential of leveraging internal knowledge to reduce\nhallucination; 3) SSRL-trained models integrate seamlessly with external search\nengines without additional effort. Our findings highlight the potential of LLMs\nto support more scalable RL agent training.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10469", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10469", "abs": "https://arxiv.org/abs/2508.10469", "authors": ["Maimunatu Tunau", "Vincent Gbouna Zakka", "Zhuangzhuang Dai"], "title": "Enhanced Sparse Point Cloud Data Processing for Privacy-aware Human Action Recognition", "comment": null, "summary": "Human Action Recognition (HAR) plays a crucial role in healthcare, fitness\ntracking, and ambient assisted living technologies. While traditional vision\nbased HAR systems are effective, they pose privacy concerns. mmWave radar\nsensors offer a privacy preserving alternative but present challenges due to\nthe sparse and noisy nature of their point cloud data. In the literature, three\nprimary data processing methods: Density-Based Spatial Clustering of\nApplications with Noise (DBSCAN), the Hungarian Algorithm, and Kalman Filtering\nhave been widely used to improve the quality and continuity of radar data.\nHowever, a comprehensive evaluation of these methods, both individually and in\ncombination, remains lacking. This paper addresses that gap by conducting a\ndetailed performance analysis of the three methods using the MiliPoint dataset.\nWe evaluate each method individually, all possible pairwise combinations, and\nthe combination of all three, assessing both recognition accuracy and\ncomputational cost. Furthermore, we propose targeted enhancements to the\nindividual methods aimed at improving accuracy. Our results provide crucial\ninsights into the strengths and trade-offs of each method and their\nintegrations, guiding future work on mmWave based HAR systems", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10678", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10678", "abs": "https://arxiv.org/abs/2508.10678", "authors": ["Zhaoyuan Qi", "Weihua Gao", "Wenlong Niu", "Jie Tang", "Yun Li", "Xiaodong Peng"], "title": "HyperTea: A Hypergraph-based Temporal Enhancement and Alignment Network for Moving Infrared Small Target Detection", "comment": null, "summary": "In practical application scenarios, moving infrared small target detection\n(MIRSTD) remains highly challenging due to the target's small size, weak\nintensity, and complex motion pattern. Existing methods typically only model\nlow-order correlations between feature nodes and perform feature extraction and\nenhancement within a single temporal scale. Although hypergraphs have been\nwidely used for high-order correlation learning, they have received limited\nattention in MIRSTD. To explore the potential of hypergraphs and enhance\nmulti-timescale feature representation, we propose HyperTea, which integrates\nglobal and local temporal perspectives to effectively model high-order\nspatiotemporal correlations of features. HyperTea consists of three modules:\nthe global temporal enhancement module (GTEM) realizes global temporal context\nenhancement through semantic aggregation and propagation; the local temporal\nenhancement module (LTEM) is designed to capture local motion patterns between\nadjacent frames and then enhance local temporal context; additionally, we\nfurther develop a temporal alignment module (TAM) to address potential\ncross-scale feature misalignment. To our best knowledge, HyperTea is the first\nwork to integrate convolutional neural networks (CNNs), recurrent neural\nnetworks (RNNs), and hypergraph neural networks (HGNNs) for MIRSTD,\nsignificantly improving detection performance. Experiments on DAUB and IRDST\ndemonstrate its state-of-the-art (SOTA) performance. Our source codes are\navailable at https://github.com/Lurenjia-LRJ/HyperTea.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10108", "categories": ["cs.AI", "cs.CL", "I.2.7; I.2.6; E.0"], "pdf": "https://arxiv.org/pdf/2508.10108", "abs": "https://arxiv.org/abs/2508.10108", "authors": ["Sattvik Sahai", "Prasoon Goyal", "Michael Johnston", "Anna Gottardi", "Yao Lu", "Lucy Hu", "Luke Dai", "Shaohua Liu", "Samyuth Sagi", "Hangjie Shi", "Desheng Zhang", "Lavina Vaz", "Leslie Ball", "Maureen Murray", "Rahul Gupta", "Shankar Ananthakrishna"], "title": "Amazon Nova AI Challenge -- Trusted AI: Advancing secure, AI-assisted software development", "comment": "18 pages, 1st Proceedings of Amazon Nova AI Challenge (Trusted AI\n  2025)", "summary": "AI systems for software development are rapidly gaining prominence, yet\nsignificant challenges remain in ensuring their safety. To address this, Amazon\nlaunched the Trusted AI track of the Amazon Nova AI Challenge, a global\ncompetition among 10 university teams to drive advances in secure AI. In the\nchallenge, five teams focus on developing automated red teaming bots, while the\nother five create safe AI assistants. This challenge provides teams with a\nunique platform to evaluate automated red-teaming and safety alignment methods\nthrough head-to-head adversarial tournaments where red teams have multi-turn\nconversations with the competing AI coding assistants to test their safety\nalignment. Along with this, the challenge provides teams with a feed of high\nquality annotated data to fuel iterative improvement. Throughout the challenge,\nteams developed state-of-the-art techniques, introducing novel approaches in\nreasoning-based safety alignment, robust model guardrails, multi-turn\njail-breaking, and efficient probing of large language models (LLMs). To\nsupport these efforts, the Amazon Nova AI Challenge team made substantial\nscientific and engineering investments, including building a custom baseline\ncoding specialist model for the challenge from scratch, developing a tournament\norchestration service, and creating an evaluation harness. This paper outlines\nthe advancements made by university teams and the Amazon Nova AI Challenge team\nin addressing the safety challenges of AI for software development,\nhighlighting this collaborative effort to raise the bar for AI safety.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10704", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10704", "abs": "https://arxiv.org/abs/2508.10704", "authors": ["Zhanwen Liu", "Yujing Sun", "Yang Wang", "Nan Yang", "Shengbo Eben Li", "Xiangmo Zhao"], "title": "Beyond conventional vision: RGB-event fusion for robust object detection in dynamic traffic scenarios", "comment": null, "summary": "The dynamic range limitation of conventional RGB cameras reduces global\ncontrast and causes loss of high-frequency details such as textures and edges\nin complex traffic environments (e.g., nighttime driving, tunnels), hindering\ndiscriminative feature extraction and degrading frame-based object detection.\nTo address this, we integrate a bio-inspired event camera with an RGB camera to\nprovide high dynamic range information and propose a motion cue fusion network\n(MCFNet), which achieves optimal spatiotemporal alignment and adaptive\ncross-modal feature fusion under challenging lighting. Specifically, an event\ncorrection module (ECM) temporally aligns asynchronous event streams with image\nframes via optical-flow-based warping, jointly optimized with the detection\nnetwork to learn task-aware event representations. The event dynamic upsampling\nmodule (EDUM) enhances spatial resolution of event frames to match image\nstructures, ensuring precise spatiotemporal alignment. The cross-modal mamba\nfusion module (CMM) uses adaptive feature fusion with a novel interlaced\nscanning mechanism, effectively integrating complementary information for\nrobust detection. Experiments conducted on the DSEC-Det and PKU-DAVIS-SOD\ndatasets demonstrate that MCFNet significantly outperforms existing methods in\nvarious poor lighting and fast moving traffic scenarios. Notably, on the\nDSEC-Det dataset, MCFNet achieves a remarkable improvement, surpassing the best\nexisting methods by 7.4% in mAP50 and 1.7% in mAP metrics, respectively. The\ncode is available at https://github.com/Charm11492/MCFNet.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10616", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10616", "abs": "https://arxiv.org/abs/2508.10616", "authors": ["Daejune Choi", "Youchan No", "Jinhyung Lee", "Duksu Kim"], "title": "Fourier-Guided Attention Upsampling for Image Super-Resolution", "comment": "15 pages, 7 figures, under submission to a journal", "summary": "We propose Frequency-Guided Attention (FGA), a lightweight upsampling module\nfor single image super-resolution. Conventional upsamplers, such as Sub-Pixel\nConvolution, are efficient but frequently fail to reconstruct high-frequency\ndetails and introduce aliasing artifacts. FGA addresses these issues by\nintegrating (1) a Fourier feature-based Multi-Layer Perceptron (MLP) for\npositional frequency encoding, (2) a cross-resolution Correlation Attention\nLayer for adaptive spatial alignment, and (3) a frequency-domain L1 loss for\nspectral fidelity supervision. Adding merely 0.3M parameters, FGA consistently\nenhances performance across five diverse super-resolution backbones in both\nlightweight and full-capacity scenarios. Experimental results demonstrate\naverage PSNR gains of 0.12~0.14 dB and improved frequency-domain consistency by\nup to 29%, particularly evident on texture-rich datasets. Visual and spectral\nevaluations confirm FGA's effectiveness in reducing aliasing and preserving\nfine details, establishing it as a practical, scalable alternative to\ntraditional upsampling methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "consistency"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10667", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10667", "abs": "https://arxiv.org/abs/2508.10667", "authors": ["Shixiong Xu", "Chenghao Zhang", "Lubin Fan", "Yuan Zhou", "Bin Fan", "Shiming Xiang", "Gaofeng Meng", "Jieping Ye"], "title": "AddressVLM: Cross-view Alignment Tuning for Image Address Localization using Large Vision-Language Models", "comment": null, "summary": "Large visual language models (LVLMs) have demonstrated impressive performance\nin coarse-grained geo-localization at the country or city level, but they\nstruggle with fine-grained street-level localization within urban areas. In\nthis paper, we explore integrating city-wide address localization capabilities\ninto LVLMs, facilitating flexible address-related question answering using\nstreet-view images. A key challenge is that the street-view visual\nquestion-and-answer (VQA) data provides only microscopic visual cues, leading\nto subpar performance in fine-tuned models. To tackle this issue, we\nincorporate perspective-invariant satellite images as macro cues and propose\ncross-view alignment tuning including a satellite-view and street-view image\ngrafting mechanism, along with an automatic label generation mechanism. Then\nLVLM's global understanding of street distribution is enhanced through\ncross-view matching. Our proposed model, named AddressVLM, consists of\ntwo-stage training protocols: cross-view alignment tuning and address\nlocalization tuning. Furthermore, we have constructed two street-view VQA\ndatasets based on image address localization datasets from Pittsburgh and San\nFrancisco. Qualitative and quantitative evaluations demonstrate that AddressVLM\noutperforms counterpart LVLMs by over 9% and 12% in average address\nlocalization accuracy on these two datasets, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "question answering", "fine-grained"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10729", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10729", "abs": "https://arxiv.org/abs/2508.10729", "authors": ["Yanjun Li", "Yuqian Fu", "Tianwen Qian", "Qi'ao Xu", "Silong Dai", "Danda Pani Paudel", "Luc Van Gool", "Xiaoling Wang"], "title": "EgoCross: Benchmarking Multimodal Large Language Models for Cross-Domain Egocentric Video Question Answering", "comment": null, "summary": "Recent advances in Multimodal Large Language Models (MLLMs) have\nsignificantly pushed the frontier of egocentric video question answering\n(EgocentricQA). However, existing benchmarks and studies are mainly limited to\ncommon daily activities such as cooking and cleaning. In contrast, real-world\ndeployment inevitably encounters domain shifts, where target domains differ\nsubstantially in both visual style and semantic content. To bridge this gap, we\nintroduce \\textbf{EgoCross}, a comprehensive benchmark designed to evaluate the\ncross-domain generalization of MLLMs in EgocentricQA. EgoCross covers four\ndiverse and challenging domains, including surgery, industry, extreme sports,\nand animal perspective, representing realistic and high-impact application\nscenarios. It comprises approximately 1,000 QA pairs across 798 video clips,\nspanning four key QA tasks: prediction, recognition, localization, and\ncounting. Each QA pair provides both OpenQA and CloseQA formats to support\nfine-grained evaluation. Extensive experiments show that most existing MLLMs,\nwhether general-purpose or egocentric-specialized, struggle to generalize to\ndomains beyond daily life, highlighting the limitations of current models.\nFurthermore, we conduct several pilot studies, \\eg, fine-tuning and\nreinforcement learning, to explore potential improvements. We hope EgoCross and\nour accompanying analysis will serve as a foundation for advancing\ndomain-adaptive, robust egocentric video understanding. Data and codes will be\nreleased at:\n\\href{https://github.com/MyUniverse0726/EgoCross}{https://github.com/MyUniverse0726/EgoCross.}", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "question answering", "fine-grained"], "score": 4}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10695", "categories": ["cs.CL", "cs.AI", "cs.IR"], "pdf": "https://arxiv.org/pdf/2508.10695", "abs": "https://arxiv.org/abs/2508.10695", "authors": ["Alireza Salemi", "Hamed Zamani"], "title": "Learning from Natural Language Feedback for Personalized Question Answering", "comment": null, "summary": "Personalization is crucial for enhancing both the effectiveness and user\nsatisfaction of language technologies, particularly in information-seeking\ntasks like question answering. Current approaches for personalizing large\nlanguage models (LLMs) often rely on retrieval-augmented generation (RAG),\nfollowed by reinforcement learning with scalar reward signals to teach models\nhow to use retrieved personal context. We believe that these scalar rewards\nsometimes provide weak, non-instructive feedback, limiting learning efficiency\nand personalization quality. We introduce VAC, a novel framework for\npersonalized response generation that replaces scalar rewards with natural\nlanguage feedback (NLF) that are generated conditioned on the user profiles and\nthe question narratives. NLF serves as a rich and actionable supervision\nsignal, allowing the policy model to iteratively refine its outputs and\ninternalize effective personalization strategies. Training alternates between\noptimizing the feedback model and fine-tuning the policy model on the improved\nresponses, resulting in a policy model that no longer requires feedback at\ninference. Evaluation on the LaMP-QA benchmark that consists of three diverse\ndomains demonstrates consistent and significant improvements over the\nstate-of-the-art results. Human evaluations further confirm the superior\nquality of the generated responses. These results demonstrate that NLF provides\nmore effective signals for optimizing personalized question answering.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "question answering"], "score": 3}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10731", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.10731", "abs": "https://arxiv.org/abs/2508.10731", "authors": ["Luyao Tang", "Kunze Huang", "Chaoqi Chen", "Yuxuan Yuan", "Chenxin Li", "Xiaotong Tu", "Xinghao Ding", "Yue Huang"], "title": "Dissecting Generalized Category Discovery: Multiplex Consensus under Self-Deconstruction", "comment": "Accepted by ICCV 2025 as *** Highlight ***!", "summary": "Human perceptual systems excel at inducing and recognizing objects across\nboth known and novel categories, a capability far beyond current machine\nlearning frameworks. While generalized category discovery (GCD) aims to bridge\nthis gap, existing methods predominantly focus on optimizing objective\nfunctions. We present an orthogonal solution, inspired by the human cognitive\nprocess for novel object understanding: decomposing objects into visual\nprimitives and establishing cross-knowledge comparisons. We propose ConGCD,\nwhich establishes primitive-oriented representations through high-level\nsemantic reconstruction, binding intra-class shared attributes via\ndeconstruction. Mirroring human preference diversity in visual processing,\nwhere distinct individuals leverage dominant or contextual cues, we implement\ndominant and contextual consensus units to capture class-discriminative\npatterns and inherent distributional invariants, respectively. A consensus\nscheduler dynamically optimizes activation pathways, with final predictions\nemerging through multiplex consensus integration. Extensive evaluations across\ncoarse- and fine-grained benchmarks demonstrate ConGCD's effectiveness as a\nconsensus-aware paradigm. Code is available at github.com/lytang63/ConGCD.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference", "fine-grained"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10729", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.10729", "abs": "https://arxiv.org/abs/2508.10729", "authors": ["Yanjun Li", "Yuqian Fu", "Tianwen Qian", "Qi'ao Xu", "Silong Dai", "Danda Pani Paudel", "Luc Van Gool", "Xiaoling Wang"], "title": "EgoCross: Benchmarking Multimodal Large Language Models for Cross-Domain Egocentric Video Question Answering", "comment": null, "summary": "Recent advances in Multimodal Large Language Models (MLLMs) have\nsignificantly pushed the frontier of egocentric video question answering\n(EgocentricQA). However, existing benchmarks and studies are mainly limited to\ncommon daily activities such as cooking and cleaning. In contrast, real-world\ndeployment inevitably encounters domain shifts, where target domains differ\nsubstantially in both visual style and semantic content. To bridge this gap, we\nintroduce \\textbf{EgoCross}, a comprehensive benchmark designed to evaluate the\ncross-domain generalization of MLLMs in EgocentricQA. EgoCross covers four\ndiverse and challenging domains, including surgery, industry, extreme sports,\nand animal perspective, representing realistic and high-impact application\nscenarios. It comprises approximately 1,000 QA pairs across 798 video clips,\nspanning four key QA tasks: prediction, recognition, localization, and\ncounting. Each QA pair provides both OpenQA and CloseQA formats to support\nfine-grained evaluation. Extensive experiments show that most existing MLLMs,\nwhether general-purpose or egocentric-specialized, struggle to generalize to\ndomains beyond daily life, highlighting the limitations of current models.\nFurthermore, we conduct several pilot studies, \\eg, fine-tuning and\nreinforcement learning, to explore potential improvements. We hope EgoCross and\nour accompanying analysis will serve as a foundation for advancing\ndomain-adaptive, robust egocentric video understanding. Data and codes will be\nreleased at:\n\\href{https://github.com/MyUniverse0726/EgoCross}{https://github.com/MyUniverse0726/EgoCross.}", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "question answering", "fine-grained"], "score": 4}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10737", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10737", "abs": "https://arxiv.org/abs/2508.10737", "authors": ["Matej Vitek", "Darian Tomašević", "Abhijit Das", "Sabari Nathan", "Gökhan Özbulak", "Gözde Ayşe Tataroğlu Özbulak", "Jean-Paul Calbimonte", "André Anjos", "Hariohm Hemant Bhatt", "Dhruv Dhirendra Premani", "Jay Chaudhari", "Caiyong Wang", "Jian Jiang", "Chi Zhang", "Qi Zhang", "Iyyakutti Iyappan Ganapathi", "Syed Sadaf Ali", "Divya Velayudan", "Maregu Assefa", "Naoufel Werghi", "Zachary A. Daniels", "Leeon John", "Ritesh Vyas", "Jalil Nourmohammadi Khiarak", "Taher Akbari Saeed", "Mahsa Nasehi", "Ali Kianfar", "Mobina Pashazadeh Panahi", "Geetanjali Sharma", "Pushp Raj Panth", "Raghavendra Ramachandra", "Aditya Nigam", "Umapada Pal", "Peter Peer", "Vitomir Štruc"], "title": "Privacy-enhancing Sclera Segmentation Benchmarking Competition: SSBC 2025", "comment": "IEEE International Joint Conference on Biometrics (IJCB) 2025, 13\n  pages", "summary": "This paper presents a summary of the 2025 Sclera Segmentation Benchmarking\nCompetition (SSBC), which focused on the development of privacy-preserving\nsclera-segmentation models trained using synthetically generated ocular images.\nThe goal of the competition was to evaluate how well models trained on\nsynthetic data perform in comparison to those trained on real-world datasets.\nThe competition featured two tracks: $(i)$ one relying solely on synthetic data\nfor model development, and $(ii)$ one combining/mixing synthetic with (a\nlimited amount of) real-world data. A total of nine research groups submitted\ndiverse segmentation models, employing a variety of architectural designs,\nincluding transformer-based solutions, lightweight models, and segmentation\nnetworks guided by generative frameworks. Experiments were conducted across\nthree evaluation datasets containing both synthetic and real-world images,\ncollected under diverse conditions. Results show that models trained entirely\non synthetic data can achieve competitive performance, particularly when\ndedicated training strategies are employed, as evidenced by the top performing\nmodels that achieved $F_1$ scores of over $0.8$ in the synthetic data track.\nMoreover, performance gains in the mixed track were often driven more by\nmethodological choices rather than by the inclusion of real data, highlighting\nthe promise of synthetic data for privacy-aware biometric development. The code\nand data for the competition is available at:\nhttps://github.com/dariant/SSBC_2025.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10743", "categories": ["cs.CV", "math.OC"], "pdf": "https://arxiv.org/pdf/2508.10743", "abs": "https://arxiv.org/abs/2508.10743", "authors": ["Ziwei Zou", "Bei Zou", "Xiaoyan Kui", "Wenqi Lu", "Haoran Dou", "Arezoo Zakeri", "Timothy Cootes", "Alejandro F Frangi", "Jinming Duan"], "title": "An Efficient Model-Driven Groupwise Approach for Atlas Construction", "comment": null, "summary": "Atlas construction is fundamental to medical image analysis, offering a\nstandardized spatial reference for tasks such as population-level anatomical\nmodeling. While data-driven registration methods have recently shown promise in\npairwise settings, their reliance on large training datasets, limited\ngeneralizability, and lack of true inference phases in groupwise contexts\nhinder their practical use. In contrast, model-driven methods offer\ntraining-free, theoretically grounded, and data-efficient alternatives, though\nthey often face scalability and optimization challenges when applied to large\n3D datasets. In this work, we introduce DARC (Diffeomorphic Atlas Registration\nvia Coordinate descent), a novel model-driven groupwise registration framework\nfor atlas construction. DARC supports a broad range of image dissimilarity\nmetrics and efficiently handles arbitrary numbers of 3D images without\nincurring GPU memory issues. Through a coordinate descent strategy and a\ncentrality-enforcing activation function, DARC produces unbiased, diffeomorphic\natlases with high anatomical fidelity. Beyond atlas construction, we\ndemonstrate two key applications: (1) One-shot segmentation, where labels\nannotated only on the atlas are propagated to subjects via inverse\ndeformations, outperforming state-of-the-art few-shot methods; and (2) shape\nsynthesis, where new anatomical variants are generated by warping the atlas\nmesh using synthesized diffeomorphic deformation fields. Overall, DARC offers a\nflexible, generalizable, and resource-efficient framework for atlas\nconstruction and applications.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10839", "categories": ["cs.CL", "cs.AI", "cs.LG", "I.2.7; I.2.8"], "pdf": "https://arxiv.org/pdf/2508.10839", "abs": "https://arxiv.org/abs/2508.10839", "authors": ["Jim Dilkes", "Vahid Yazdanpanah", "Sebastian Stein"], "title": "Reinforced Language Models for Sequential Decision Making", "comment": null, "summary": "Large Language Models (LLMs) show potential as sequential decision-making\nagents, but their application is often limited due to a reliance on large,\ncomputationally expensive models. This creates a need to improve smaller\nmodels, yet existing post-training methods are designed for single-turn\ninteractions and cannot handle credit assignment in multi-step agentic tasks.\nTo address this, we introduce Multi-Step Group-Relative Policy Optimization\n(MS-GRPO), a new algorithm for post-training LLM agents, grounded in formal\nText-Mediated Stochastic Game (TSMG) and Language-Agent Policy (LAP)\nframeworks. For credit assignment, MS-GRPO attributes the entire cumulative\nepisode reward to each individual episode step. We supplement this algorithm\nwith a novel absolute-advantage-weighted episode sampling strategy that we show\nimproves training performance. We evaluate our approach by post-training a\n3-billion parameter model on Snake and Frozen Lake. Our experiments demonstrate\nthat the method is effective in improving decision-making performance: our\npost-trained 3B parameter model outperforms a 72B parameter baseline by 50% on\nthe Frozen Lake task. This work demonstrates that targeted post-training is a\npractical and efficient alternative to relying on model scale for creating\nsequential decision-making agents using LLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10770", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10770", "abs": "https://arxiv.org/abs/2508.10770", "authors": ["Tiancheng Han", "Yunfei Gao", "Yong Li", "Wuzhou Yu", "Qiaosheng Zhang", "Wenqi Shao"], "title": "From Diagnosis to Improvement: Probing Spatio-Physical Reasoning in Vision Language Models", "comment": "9 pages, 6 figures", "summary": "Spatio-physical reasoning, a foundation capability for understanding the real\nphysics world, is a critical step towards building robust world models. While\nrecent vision language models (VLMs) have shown remarkable progress in\nspecialized domains like multimodal mathematics and pure spatial understanding,\ntheir capability for spatio-physical reasoning remains largely unexplored. This\npaper provides a comprehensive diagnostic analysis of mainstream VLMs,\nrevealing that current models perform inadequately on this crucial task.\nFurther detailed analysis shows that this underperformance is largely\nattributable to biases caused by human-like prior and a lack of deep reasoning.\nTo address these challenges, we apply supervised fine-tuning followed by\nrule-based reinforcement learning to Qwen2.5-VL-7B, resulting in significant\nimprovements in spatio-physical reasoning capabilities and surpassing leading\nproprietary models. Nevertheless, despite this success, the model's\ngeneralization to new physics scenarios remains limited -- underscoring the\npressing need for new approaches in spatio-physical reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10833", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.10833", "abs": "https://arxiv.org/abs/2508.10833", "authors": ["Zhangxuan Gu", "Zhengwen Zeng", "Zhenyu Xu", "Xingran Zhou", "Shuheng Shen", "Yunfei Liu", "Beitong Zhou", "Changhua Meng", "Tianyu Xia", "Weizhi Chen", "Yue Wen", "Jingya Dou", "Fei Tang", "Jinzhen Lin", "Yulin Liu", "Zhenlin Guo", "Yichen Gong", "Heng Jia", "Changlong Gao", "Yuan Guo", "Yong Deng", "Zhenyu Guo", "Liang Chen", "Weiqiang Wang"], "title": "UI-Venus Technical Report: Building High-performance UI Agents with RFT", "comment": null, "summary": "We present UI-Venus, a native UI agent that takes only screenshots as input\nbased on a multimodal large language model. UI-Venus achieves SOTA performance\non both UI grounding and navigation tasks using only several hundred thousand\nhigh-quality training samples through reinforcement finetune (RFT) based on\nQwen2.5-VL. Specifically, the 7B and 72B variants of UI-Venus obtain 94.1% /\n50.8% and 95.3% / 61.9% on the standard grounding benchmarks, i.e.,\nScreenspot-V2 / Pro, surpassing the previous SOTA baselines including\nopen-source GTA1 and closed-source UI-TARS-1.5.To show UI-Venus's summary and\nplaning ability, we also evaluate it on the AndroidWorld, an online UI\nnavigation arena, on which our 7B and 72B variants achieve 49.1% and 65.9%\nsuccess rate, also beating existing models.To achieve this, we introduce\ncarefully designed reward functions for both UI grounding and navigation tasks\nand corresponding efficient data cleaning strategies.To further boost\nnavigation performance, we propose Self-Evolving Trajectory History Alignment\n\\& Sparse Action Enhancement that refine historical reasoning traces and\nbalances the distribution of sparse but critical actions, leading to more\ncoherent planning and better generalization in complex UI tasks. Our\ncontributions include the publish of SOTA open-source UI agents, comprehensive\ndata cleaning protocols and a novel self-evolving framework for improving\nnavigation performance, which encourage further research and development in the\ncommunity. Code is available at https://github.com/antgroup/UI-Venus.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-15.jsonl"}
{"id": "2508.10745", "categories": ["cs.AI", "cs.CV", "cs.LG", "cs.MA", "cs.MM"], "pdf": "https://arxiv.org/pdf/2508.10745", "abs": "https://arxiv.org/abs/2508.10745", "authors": ["Sayan Nag", "K J Joseph", "Koustava Goswami", "Vlad I Morariu", "Balaji Vasan Srinivasan"], "title": "Agentic Design Review System", "comment": null, "summary": "Evaluating graphic designs involves assessing it from multiple facets like\nalignment, composition, aesthetics and color choices. Evaluating designs in a\nholistic way involves aggregating feedback from individual expert reviewers.\nTowards this, we propose an Agentic Design Review System (AgenticDRS), where\nmultiple agents collaboratively analyze a design, orchestrated by a meta-agent.\nA novel in-context exemplar selection approach based on graph matching and a\nunique prompt expansion method plays central role towards making each agent\ndesign aware. Towards evaluating this framework, we propose DRS-BENCH\nbenchmark. Thorough experimental evaluation against state-of-the-art baselines\nadapted to the problem setup, backed-up with critical ablation experiments\nbrings out the efficacy of Agentic-DRS in evaluating graphic designs and\ngenerating actionable feedback. We hope that this work will attract attention\nto this pragmatic, yet under-explored research direction.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-08-15.jsonl"}
