{"id": "2506.10353", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10353", "abs": "https://arxiv.org/abs/2506.10353", "authors": ["Runqi Ouyang", "Haoyun Li", "Zhenyuan Zhang", "Xiaofeng Wang", "Zheng Zhu", "Guan Huang", "Xingang Wang"], "title": "Motion-R1: Chain-of-Thought Reasoning and Reinforcement Learning for Human Motion Generation", "comment": null, "summary": "Recent advances in large language models, especially in natural language\nunderstanding and reasoning, have opened new possibilities for text-to-motion\ngeneration. Although existing approaches have made notable progress in semantic\nalignment and motion synthesis, they often rely on end-to-end mapping\nstrategies that fail to capture deep linguistic structures and logical\nreasoning. Consequently, generated motions tend to lack controllability,\nconsistency, and diversity. To address these limitations, we propose Motion-R1,\na unified motion-language modeling framework that integrates a Chain-of-Thought\nmechanism. By explicitly decomposing complex textual instructions into\nlogically structured action paths, Motion-R1 provides high-level semantic\nguidance for motion generation, significantly enhancing the model's ability to\ninterpret and execute multi-step, long-horizon, and compositionally rich\ncommands. To train our model, we adopt Group Relative Policy Optimization, a\nreinforcement learning algorithm designed for large models, which leverages\nmotion quality feedback to optimize reasoning chains and motion synthesis\njointly. Extensive experiments across multiple benchmark datasets demonstrate\nthat Motion-R1 achieves competitive or superior performance compared to\nstate-of-the-art methods, particularly in scenarios requiring nuanced semantic\nunderstanding and long-term temporal coherence. The code, model and data will\nbe publicly available.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10790", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10790", "abs": "https://arxiv.org/abs/2506.10790", "authors": ["Ignacio Bugueno-Cordova", "Javier Ruiz-del-Solar", "Rodrigo Verschae"], "title": "Human-Robot Navigation using Event-based Cameras and Reinforcement Learning", "comment": "https://ibugueno.github.io/hr-navigation-using-event-cameras-and-rl/", "summary": "This work introduces a robot navigation controller that combines event\ncameras and other sensors with reinforcement learning to enable real-time\nhuman-centered navigation and obstacle avoidance. Unlike conventional\nimage-based controllers, which operate at fixed rates and suffer from motion\nblur and latency, this approach leverages the asynchronous nature of event\ncameras to process visual information over flexible time intervals, enabling\nadaptive inference and control. The framework integrates event-based\nperception, additional range sensing, and policy optimization via Deep\nDeterministic Policy Gradient, with an initial imitation learning phase to\nimprove sample efficiency. Promising results are achieved in simulated\nenvironments, demonstrating robust navigation, pedestrian following, and\nobstacle avoidance. A demo video is available at the project website.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy gradient", "reinforcement learning", "policy optimization"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10139", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10139", "abs": "https://arxiv.org/abs/2506.10139", "authors": ["Jiaxin Wen", "Zachary Ankner", "Arushi Somani", "Peter Hase", "Samuel Marks", "Jacob Goldman-Wetzler", "Linda Petrini", "Henry Sleight", "Collin Burns", "He He", "Shi Feng", "Ethan Perez", "Jan Leike"], "title": "Unsupervised Elicitation of Language Models", "comment": null, "summary": "To steer pretrained language models for downstream tasks, today's\npost-training paradigm relies on humans to specify desired behaviors. However,\nfor models with superhuman capabilities, it is difficult or impossible to get\nhigh-quality human supervision. To address this challenge, we introduce a new\nunsupervised algorithm, Internal Coherence Maximization (ICM), to fine-tune\npretrained language models on their own generated labels, \\emph{without\nexternal supervision}. On GSM8k-verification, TruthfulQA, and Alpaca reward\nmodeling tasks, our method matches the performance of training on golden\nsupervision and outperforms training on crowdsourced human supervision. On\ntasks where LMs' capabilities are strongly superhuman, our method can elicit\nthose capabilities significantly better than training on human labels. Finally,\nwe show that our method can improve the training of frontier LMs: we use our\nmethod to train an unsupervised reward model and use reinforcement learning to\ntrain a Claude 3.5 Haiku-based assistant. Both the reward model and the\nassistant outperform their human-supervised counterparts.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["Alpaca"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10446", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10446", "abs": "https://arxiv.org/abs/2506.10446", "authors": ["Zehui Ling", "Deshu Chen", "Hongwei Zhang", "Yifeng Jiao", "Xin Guo", "Yuan Cheng"], "title": "Fast on the Easy, Deep on the Hard: Efficient Reasoning via Powered Length Penalty", "comment": null, "summary": "Large language models (LLMs) have demonstrated significant advancements in\nreasoning capabilities, performing well on various challenging benchmarks.\nTechniques like Chain-of-Thought prompting have been introduced to further\nimprove reasoning. However, these approaches frequently generate longer\noutputs, which in turn increase computational latency. Although some methods\nuse reinforcement learning to shorten reasoning, they often apply uniform\npenalties without considering the problem's complexity, leading to suboptimal\noutcomes. In this study, we seek to enhance the efficiency of LLM reasoning by\npromoting conciseness for simpler problems while preserving sufficient\nreasoning for more complex ones for accuracy, thus improving the model's\noverall performance. Specifically, we manage the model's reasoning efficiency\nby dividing the reward function and including a novel penalty for output\nlength. Our approach has yielded impressive outcomes in benchmark evaluations\nacross three datasets: GSM8K, MATH500, and AIME2024. For the comparatively\nsimpler datasets GSM8K and MATH500, our method has effectively shortened output\nlengths while preserving or enhancing accuracy. On the more demanding AIME2024\ndataset, our approach has resulted in improved accuracy.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10741", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10741", "abs": "https://arxiv.org/abs/2506.10741", "authors": ["SiXiang Chen", "Jianyu Lai", "Jialin Gao", "Tian Ye", "Haoyu Chen", "Hengyu Shi", "Shitong Shao", "Yunlong Lin", "Song Fei", "Zhaohu Xing", "Yeying Jin", "Junfeng Luo", "Xiaoming Wei", "Lei Zhu"], "title": "PosterCraft: Rethinking High-Quality Aesthetic Poster Generation in a Unified Framework", "comment": null, "summary": "Generating aesthetic posters is more challenging than simple design images:\nit requires not only precise text rendering but also the seamless integration\nof abstract artistic content, striking layouts, and overall stylistic harmony.\nTo address this, we propose PosterCraft, a unified framework that abandons\nprior modular pipelines and rigid, predefined layouts, allowing the model to\nfreely explore coherent, visually compelling compositions. PosterCraft employs\na carefully designed, cascaded workflow to optimize the generation of\nhigh-aesthetic posters: (i) large-scale text-rendering optimization on our\nnewly introduced Text-Render-2M dataset; (ii) region-aware supervised\nfine-tuning on HQ-Poster100K; (iii) aesthetic-text-reinforcement learning via\nbest-of-n preference optimization; and (iv) joint vision-language feedback\nrefinement. Each stage is supported by a fully automated data-construction\npipeline tailored to its specific needs, enabling robust training without\ncomplex architectural modifications. Evaluated on multiple experiments,\nPosterCraft significantly outperforms open-source baselines in rendering\naccuracy, layout coherence, and overall visual appeal-approaching the quality\nof SOTA commercial systems. Our code, models, and datasets can be found in the\nProject page: https://ephemeral182.github.io/PosterCraft", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "preference"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10036", "categories": ["cs.GR", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10036", "abs": "https://arxiv.org/abs/2506.10036", "authors": ["Javad Rajabi", "Soroush Mehraban", "Seyedmorteza Sadat", "Babak Taati"], "title": "Token Perturbation Guidance for Diffusion Models", "comment": "18 pages, 14 figures", "summary": "Classifier-free guidance (CFG) has become an essential component of modern\ndiffusion models to enhance both generation quality and alignment with input\nconditions. However, CFG requires specific training procedures and is limited\nto conditional generation. To address these limitations, we propose Token\nPerturbation Guidance (TPG), a novel method that applies perturbation matrices\ndirectly to intermediate token representations within the diffusion network.\nTPG employs a norm-preserving shuffling operation to provide effective and\nstable guidance signals that improve generation quality without architectural\nchanges. As a result, TPG is training-free and agnostic to input conditions,\nmaking it readily applicable to both conditional and unconditional generation.\nWe further analyze the guidance term provided by TPG and show that its effect\non sampling more closely resembles CFG compared to existing training-free\nguidance techniques. Extensive experiments on SDXL and Stable Diffusion 2.1\nshow that TPG achieves nearly a 2$\\times$ improvement in FID for unconditional\ngeneration over the SDXL baseline, while closely matching CFG in prompt\nalignment. These results establish TPG as a general, condition-agnostic\nguidance method that brings CFG-like benefits to a broader class of diffusion\nmodels. The code is available at\nhttps://github.com/TaatiTeam/Token-Perturbation-Guidance", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10468", "categories": ["cs.GR", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10468", "abs": "https://arxiv.org/abs/2506.10468", "authors": ["Zaiqiang Wu", "Yechen Li", "Jingyuan Liu", "Yuki Shibata", "Takayuki Hori", "I-Chao Shen", "Takeo Igarashi"], "title": "Low-Barrier Dataset Collection with Real Human Body for Interactive Per-Garment Virtual Try-On", "comment": null, "summary": "Existing image-based virtual try-on methods are often limited to the front\nview and lack real-time performance. While per-garment virtual try-on methods\nhave tackled these issues by capturing per-garment datasets and training\nper-garment neural networks, they still encounter practical limitations: (1)\nthe robotic mannequin used to capture per-garment datasets is prohibitively\nexpensive for widespread adoption and fails to accurately replicate natural\nhuman body deformation; (2) the synthesized garments often misalign with the\nhuman body. To address these challenges, we propose a low-barrier approach for\ncollecting per-garment datasets using real human bodies, eliminating the\nnecessity for a customized robotic mannequin. We also introduce a hybrid person\nrepresentation that enhances the existing intermediate representation with a\nsimplified DensePose map. This ensures accurate alignment of synthesized\ngarment images with the human body and enables human-garment interaction\nwithout the need for customized wearable devices. We performed qualitative and\nquantitative evaluations against other state-of-the-art image-based virtual\ntry-on methods and conducted ablation studies to demonstrate the superiority of\nour method regarding image quality and temporal consistency. Finally, our user\nstudy results indicated that most participants found our virtual try-on system\nhelpful for making garment purchasing decisions.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10116", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10116", "abs": "https://arxiv.org/abs/2506.10116", "authors": ["Caijun Jia", "Nan Xu", "Jingxuan Wei", "Qingli Wang", "Lei Wang", "Bihui Yu", "Junnan Zhu"], "title": "ChartReasoner: Code-Driven Modality Bridging for Long-Chain Reasoning in Chart Question Answering", "comment": null, "summary": "Recently, large language models have shown remarkable reasoning capabilities\nthrough long-chain reasoning before responding. However, how to extend this\ncapability to visual reasoning tasks remains an open challenge. Existing\nmultimodal reasoning approaches transfer such visual reasoning task into\ntextual reasoning task via several image-to-text conversions, which often lose\ncritical structural and semantic information embedded in visualizations,\nespecially for tasks like chart question answering that require a large amount\nof visual details. To bridge this gap, we propose ChartReasoner, a code-driven\nnovel two-stage framework designed to enable precise, interpretable reasoning\nover charts. We first train a high-fidelity model to convert diverse chart\nimages into structured ECharts codes, preserving both layout and data semantics\nas lossless as possible. Then, we design a general chart reasoning data\nsynthesis pipeline, which leverages this pretrained transport model to\nautomatically and scalably generate chart reasoning trajectories and utilizes a\ncode validator to filter out low-quality samples. Finally, we train the final\nmultimodal model using a combination of supervised fine-tuning and\nreinforcement learning on our synthesized chart reasoning dataset and\nexperimental results on four public benchmarks clearly demonstrate the\neffectiveness of our proposed ChartReasoner. It can preserve the original\ndetails of the charts as much as possible and perform comparably with\nstate-of-the-art open-source models while using fewer parameters, approaching\nthe performance of proprietary systems like GPT-4o in out-of-domain settings.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "question answering"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10119", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.10119", "abs": "https://arxiv.org/abs/2506.10119", "authors": ["Natanael Lucena", "Fábio S. da Silva", "Ricardo Rios"], "title": "Detecção da Psoríase Utilizando Visão Computacional: Uma Abordagem Comparativa Entre CNNs e Vision Transformers", "comment": "12 pages, in Portuguese language, 2 figures, 2 tables, and 4\n  formulas. To be published in the Proceedings of the LII Brazilian Integrated\n  Software and Hardware Seminar 2025 (SEMISH 2025)", "summary": "This paper presents a comparison of the performance of Convolutional Neural\nNetworks (CNNs) and Vision Transformers (ViTs) in the task of multi-classifying\nimages containing lesions of psoriasis and diseases similar to it. Models\npre-trained on ImageNet were adapted to a specific data set. Both achieved high\npredictive metrics, but the ViTs stood out for their superior performance with\nsmaller models. Dual Attention Vision Transformer-Base (DaViT-B) obtained the\nbest results, with an f1-score of 96.4%, and is recommended as the most\nefficient architecture for automated psoriasis detection. This article\nreinforces the potential of ViTs for medical image classification tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10128", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.10128", "abs": "https://arxiv.org/abs/2506.10128", "authors": ["Xiyao Wang", "Zhengyuan Yang", "Chao Feng", "Yongyuan Liang", "Yuhang Zhou", "Xiaoyu Liu", "Ziyi Zang", "Ming Li", "Chung-Ching Lin", "Kevin Lin", "Linjie Li", "Furong Huang", "Lijuan Wang"], "title": "ViCrit: A Verifiable Reinforcement Learning Proxy Task for Visual Perception in VLMs", "comment": null, "summary": "Reinforcement learning (RL) has shown great effectiveness for fine-tuning\nlarge language models (LLMs) using tasks that are challenging yet easily\nverifiable, such as math reasoning or code generation. However, extending this\nsuccess to visual perception in vision-language models (VLMs) has been impeded\nby the scarcity of vision-centric tasks that are simultaneously challenging and\nunambiguously verifiable. To this end, we introduce ViCrit (Visual Caption\nHallucination Critic), an RL proxy task that trains VLMs to localize a subtle,\nsynthetic visual hallucination injected into paragraphs of human-written image\ncaptions. Starting from a 200-word captions, we inject a single, subtle visual\ndescription error-altering a few words on objects, attributes, counts, or\nspatial relations-and task the model to pinpoint the corrupted span given the\nimage and the modified caption. This formulation preserves the full perceptual\ndifficulty while providing a binary, exact-match reward that is easy to compute\nand unambiguous. Models trained with the ViCrit Task exhibit substantial gains\nacross a variety of VL benchmarks. Crucially, the improvements transfer beyond\nnatural-image training data to abstract image reasoning and visual math,\nshowing promises of learning to perceive rather than barely memorizing seen\nobjects. To facilitate evaluation, we further introduce ViCrit-Bench, a\ncategory-balanced diagnostic benchmark that systematically probes perception\nerrors across diverse image domains and error types. Together, our results\ndemonstrate that fine-grained hallucination criticism is an effective and\ngeneralizable objective for enhancing visual perception in VLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "code generation", "fine-grained"], "score": 4}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10161", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10161", "abs": "https://arxiv.org/abs/2506.10161", "authors": ["Yi Wang", "Max Kreminski"], "title": "Can LLMs Generate Good Stories? Insights and Challenges from a Narrative Planning Perspective", "comment": "In 2025 IEEE Conference on Games (CoG)", "summary": "Story generation has been a prominent application of Large Language Models\n(LLMs). However, understanding LLMs' ability to produce high-quality stories\nremains limited due to challenges in automatic evaluation methods and the high\ncost and subjectivity of manual evaluation. Computational narratology offers\nvaluable insights into what constitutes a good story, which has been applied in\nthe symbolic narrative planning approach to story generation. This work aims to\ndeepen the understanding of LLMs' story generation capabilities by using them\nto solve narrative planning problems. We present a benchmark for evaluating\nLLMs on narrative planning based on literature examples, focusing on causal\nsoundness, character intentionality, and dramatic conflict. Our experiments\nshow that GPT-4 tier LLMs can generate causally sound stories at small scales,\nbut planning with character intentionality and dramatic conflict remains\nchallenging, requiring LLMs trained with reinforcement learning for complex\nreasoning. The results offer insights on the scale of stories that LLMs can\ngenerate while maintaining quality from different aspects. Our findings also\nhighlight interesting problem solving behaviors and shed lights on challenges\nand considerations for applying LLM narrative planning in game environments.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10228", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10228", "abs": "https://arxiv.org/abs/2506.10228", "authors": ["Hamid Kamangir", "Mona Hajiesmaeeli", "Mason Earles"], "title": "California Crop Yield Benchmark: Combining Satellite Image, Climate, Evapotranspiration, and Soil Data Layers for County-Level Yield Forecasting of Over 70 Crops", "comment": null, "summary": "California is a global leader in agricultural production, contributing 12.5%\nof the United States total output and ranking as the fifth-largest food and\ncotton supplier in the world. Despite the availability of extensive historical\nyield data from the USDA National Agricultural Statistics Service, accurate and\ntimely crop yield forecasting remains a challenge due to the complex interplay\nof environmental, climatic, and soil-related factors. In this study, we\nintroduce a comprehensive crop yield benchmark dataset covering over 70 crops\nacross all California counties from 2008 to 2022. The benchmark integrates\ndiverse data sources, including Landsat satellite imagery, daily climate\nrecords, monthly evapotranspiration, and high-resolution soil properties. To\neffectively learn from these heterogeneous inputs, we develop a multi-modal\ndeep learning model tailored for county-level, crop-specific yield forecasting.\nThe model employs stratified feature extraction and a timeseries encoder to\ncapture spatial and temporal dynamics during the growing season. Static inputs\nsuch as soil characteristics and crop identity inform long-term variability.\nOur approach achieves an overall R2 score of 0.76 across all crops of unseen\ntest dataset, highlighting strong predictive performance across California\ndiverse agricultural regions. This benchmark and modeling framework offer a\nvaluable foundation for advancing agricultural forecasting, climate adaptation,\nand precision farming. The full dataset and codebase are publicly available at\nour GitHub repository.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10328", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.10328", "abs": "https://arxiv.org/abs/2506.10328", "authors": ["Sadia Kamal", "Tim Oates", "Joy Wan"], "title": "Towards Scalable SOAP Note Generation: A Weakly Supervised Multimodal Framework", "comment": "Accepted at IEEE/CVF Computer Society Conference on Computer Vision\n  and Pattern Recognition Workshops (CVPRW)", "summary": "Skin carcinoma is the most prevalent form of cancer globally, accounting for\nover $8 billion in annual healthcare expenditures. In clinical settings,\nphysicians document patient visits using detailed SOAP (Subjective, Objective,\nAssessment, and Plan) notes. However, manually generating these notes is\nlabor-intensive and contributes to clinician burnout. In this work, we propose\na weakly supervised multimodal framework to generate clinically structured SOAP\nnotes from limited inputs, including lesion images and sparse clinical text.\nOur approach reduces reliance on manual annotations, enabling scalable,\nclinically grounded documentation while alleviating clinician burden and\nreducing the need for large annotated data. Our method achieves performance\ncomparable to GPT-4o, Claude, and DeepSeek Janus Pro across key clinical\nrelevance metrics. To evaluate clinical quality, we introduce two novel metrics\nMedConceptEval and Clinical Coherence Score (CCS) which assess semantic\nalignment with expert medical concepts and input features, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10406", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.10406", "abs": "https://arxiv.org/abs/2506.10406", "authors": ["Yuhua Jiang", "Yuwen Xiong", "Yufeng Yuan", "Chao Xin", "Wenyuan Xu", "Yu Yue", "Qianchuan Zhao", "Lin Yan"], "title": "PAG: Multi-Turn Reinforced LLM Self-Correction with Policy as Generative Verifier", "comment": null, "summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in\ncomplex reasoning tasks, yet they still struggle to reliably verify the\ncorrectness of their own outputs. Existing solutions to this verification\nchallenge often depend on separate verifier models or require multi-stage\nself-correction training pipelines, which limit scalability. In this paper, we\npropose Policy as Generative Verifier (PAG), a simple and effective framework\nthat empowers LLMs to self-correct by alternating between policy and verifier\nroles within a unified multi-turn reinforcement learning (RL) paradigm.\nDistinct from prior approaches that always generate a second attempt regardless\nof model confidence, PAG introduces a selective revision mechanism: the model\nrevises its answer only when its own generative verification step detects an\nerror. This verify-then-revise workflow not only alleviates model collapse but\nalso jointly enhances both reasoning and verification abilities. Extensive\nexperiments across diverse reasoning benchmarks highlight PAG's dual\nadvancements: as a policy, it enhances direct generation and self-correction\naccuracy; as a verifier, its self-verification outperforms self-consistency.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["self-verification", "self-correction"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10342", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10342", "abs": "https://arxiv.org/abs/2506.10342", "authors": ["Jun Yin", "Jing Zhong", "Peilin Li", "Pengyu Zeng", "Miao Zhang", "Ran Luo", "Shuai Lu"], "title": "UrbanSense:AFramework for Quantitative Analysis of Urban Streetscapes leveraging Vision Large Language Models", "comment": null, "summary": "Urban cultures and architectural styles vary significantly across cities due\nto geographical, chronological, historical, and socio-political factors.\nUnderstanding these differences is essential for anticipating how cities may\nevolve in the future. As representative cases of historical continuity and\nmodern innovation in China, Beijing and Shenzhen offer valuable perspectives\nfor exploring the transformation of urban streetscapes. However, conventional\napproaches to urban cultural studies often rely on expert interpretation and\nhistorical documentation, which are difficult to standardize across different\ncontexts. To address this, we propose a multimodal research framework based on\nvision-language models, enabling automated and scalable analysis of urban\nstreetscape style differences. This approach enhances the objectivity and\ndata-driven nature of urban form research. The contributions of this study are\nas follows: First, we construct UrbanDiffBench, a curated dataset of urban\nstreetscapes containing architectural images from different periods and\nregions. Second, we develop UrbanSense, the first vision-language-model-based\nframework for urban streetscape analysis, enabling the quantitative generation\nand comparison of urban style representations. Third, experimental results show\nthat Over 80% of generated descriptions pass the t-test (p less than 0.05).\nHigh Phi scores (0.912 for cities, 0.833 for periods) from subjective\nevaluations confirm the method's ability to capture subtle stylistic\ndifferences. These results highlight the method's potential to quantify and\ninterpret urban style evolution, offering a scientifically grounded lens for\nfuture design.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10486", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10486", "abs": "https://arxiv.org/abs/2506.10486", "authors": ["Xanh Ho", "Sunisth Kumar", "Yun-Ang Wu", "Florian Boudin", "Atsuhiro Takasu", "Akiko Aizawa"], "title": "Table-Text Alignment: Explaining Claim Verification Against Tables in Scientific Papers", "comment": "8 pages; code and data are available at\n  https://github.com/Alab-NII/SciTabAlign", "summary": "Scientific claim verification against tables typically requires predicting\nwhether a claim is supported or refuted given a table. However, we argue that\npredicting the final label alone is insufficient: it reveals little about the\nmodel's reasoning and offers limited interpretability. To address this, we\nreframe table-text alignment as an explanation task, requiring models to\nidentify the table cells essential for claim verification. We build a new\ndataset by extending the SciTab benchmark with human-annotated cell-level\nrationales. Annotators verify the claim label and highlight the minimal set of\ncells needed to support their decision. After the annotation process, we\nutilize the collected information and propose a taxonomy for handling ambiguous\ncases. Our experiments show that (i) incorporating table alignment information\nimproves claim verification performance, and (ii) most LLMs, while often\npredicting correct labels, fail to recover human-aligned rationales, suggesting\nthat their predictions do not stem from faithful reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10430", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10430", "abs": "https://arxiv.org/abs/2506.10430", "authors": ["Shuo wang", "Jihao Zhang"], "title": "MF2Summ: Multimodal Fusion for Video Summarization with Temporal Alignment", "comment": null, "summary": "The rapid proliferation of online video content necessitates effective video\nsummarization techniques. Traditional methods, often relying on a single\nmodality (typically visual), struggle to capture the full semantic richness of\nvideos. This paper introduces MF2Summ, a novel video summarization model based\non multimodal content understanding, integrating both visual and auditory\ninformation. MF2Summ employs a five-stage process: feature extraction,\ncross-modal attention interaction, feature fusion, segment prediction, and key\nshot selection. Visual features are extracted using a pre-trained GoogLeNet\nmodel, while auditory features are derived using SoundNet. The core of our\nfusion mechanism involves a cross-modal Transformer and an alignment-guided\nself-attention Transformer, designed to effectively model inter-modal\ndependencies and temporal correspondences. Segment importance, location, and\ncenter-ness are predicted, followed by key shot selection using Non-Maximum\nSuppression (NMS) and the Kernel Temporal Segmentation (KTS) algorithm.\nExperimental results on the SumMe and TVSum datasets demonstrate that MF2Summ\nachieves competitive performance, notably improving F1-scores by 1.9\\% and\n0.6\\% respectively over the DSNet model, and performing favorably against other\nstate-of-the-art methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10822", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10822", "abs": "https://arxiv.org/abs/2506.10822", "authors": ["Zhensheng Jin", "Xinze Li", "Yifan Ji", "Chunyi Peng", "Zhenghao Liu", "Qi Shi", "Yukun Yan", "Shuo Wang", "Furong Peng", "Ge Yu"], "title": "ReCUT: Balancing Reasoning Length and Accuracy in LLMs via Stepwise Trails and Preference Optimization", "comment": null, "summary": "Recent advances in Chain-of-Thought (CoT) prompting have substantially\nimproved the reasoning capabilities of Large Language Models (LLMs). However,\nthese methods often suffer from overthinking, leading to unnecessarily lengthy\nor redundant reasoning traces. Existing approaches attempt to mitigate this\nissue through curating multiple reasoning chains for training LLMs, but their\neffectiveness is often constrained by the quality of the generated data and\nprone to overfitting. To address the challenge, we propose Reasoning\nCompression ThroUgh Stepwise Trials (ReCUT), a novel method aimed at balancing\nthe accuracy and length of reasoning trajectory. Specifically, ReCUT employs a\nstepwise exploration mechanism and a long-short switched sampling strategy,\nenabling LLMs to incrementally generate diverse reasoning paths. These paths\nare evaluated and used to construct preference pairs to train two specialized\nmodels (Gemini LLMs)-one optimized for reasoning accuracy, the other for\nshorter reasoning. A final integrated model is obtained by interpolating the\nparameters of these two models. Experimental results across multiple math\nreasoning datasets and backbone models demonstrate that ReCUT significantly\nreduces reasoning lengths by approximately 30-50%, while maintaining or\nimproving reasoning accuracy compared to various baselines. All codes and data\nwill be released via https://github.com/NEUIR/ReCUT.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10528", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10528", "abs": "https://arxiv.org/abs/2506.10528", "authors": ["Teerapong Panboonyuen"], "title": "SLICK: Selective Localization and Instance Calibration for Knowledge-Enhanced Car Damage Segmentation in Automotive Insurance", "comment": "10 pages", "summary": "We present SLICK, a novel framework for precise and robust car damage\nsegmentation that leverages structural priors and domain knowledge to tackle\nreal-world automotive inspection challenges. SLICK introduces five key\ncomponents: (1) Selective Part Segmentation using a high-resolution semantic\nbackbone guided by structural priors to achieve surgical accuracy in segmenting\nvehicle parts even under occlusion, deformation, or paint loss; (2)\nLocalization-Aware Attention blocks that dynamically focus on damaged regions,\nenhancing fine-grained damage detection in cluttered and complex street scenes;\n(3) an Instance-Sensitive Refinement head that leverages panoptic cues and\nshape priors to disentangle overlapping or adjacent parts, enabling precise\nboundary alignment; (4) Cross-Channel Calibration through multi-scale channel\nattention that amplifies subtle damage signals such as scratches and dents\nwhile suppressing noise like reflections and decals; and (5) a Knowledge Fusion\nModule that integrates synthetic crash data, part geometry, and real-world\ninsurance datasets to improve generalization and handle rare cases effectively.\nExperiments on large-scale automotive datasets demonstrate SLICK's superior\nsegmentation performance, robustness, and practical applicability for insurance\nand automotive inspection workflows.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10550", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10550", "abs": "https://arxiv.org/abs/2506.10550", "authors": ["Jing He", "Yiqing Wang", "Lingling Li", "Kexin Zhang", "Puhua Chen"], "title": "ContextRefine-CLIP for EPIC-KITCHENS-100 Multi-Instance Retrieval Challenge 2025", "comment": null, "summary": "This report presents ContextRefine-CLIP (CR-CLIP), an efficient model for\nvisual-textual multi-instance retrieval tasks. The approach is based on the\ndual-encoder AVION, on which we introduce a cross-modal attention flow module\nto achieve bidirectional dynamic interaction and refinement between visual and\ntextual features to generate more context-aware joint representations. For\nsoft-label relevance matrices provided in tasks such as EPIC-KITCHENS-100,\nCR-CLIP can work with Symmetric Multi-Similarity Loss to achieve more accurate\nsemantic alignment and optimization using the refined features. Without using\nensemble learning, the CR-CLIP model achieves 66.78mAP and 82.08nDCG on the\nEPIC-KITCHENS-100 public leaderboard, which significantly outperforms the\nbaseline model and fully validates its effectiveness in cross-modal retrieval.\nThe code will be released open-source on\nhttps://github.com/delCayr/ContextRefine-Clip", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10885", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10885", "abs": "https://arxiv.org/abs/2506.10885", "authors": ["Qingda", "Mai"], "title": "Slimming Down LLMs Without Losing Their Minds", "comment": "10 pages", "summary": "This paper investigates and validates the impact of fine-tuning on large\nlanguage model performance, focusing on parameter-efficient methods (LoRA and\nQLoRA). We evaluate model capabilities across three key domains: (1)\ncommonsense reasoning (HellaSwag), (2) mathematical reasoning (GSM8K), and (3)\nmulti-domain knowledge (MMLU-CS).\n  Our findings demonstrate that: (1) LoRA-based methods effectively improve\ntask-specific performance while maintaining computational efficiency, and (2)\nperformance strongly depends on alignment between fine-tuning dataset and\nbenchmark tasks. The study provides both theoretical insights into\nparameter-efficient mechanisms and practical guidance for developers\nimplementing efficient LLM adaptation with limited resources.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "mathematical reasoning"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10559", "categories": ["cs.CV", "cs.AI", "cs.ET"], "pdf": "https://arxiv.org/pdf/2506.10559", "abs": "https://arxiv.org/abs/2506.10559", "authors": ["Yutong Zhou", "Masahiro Ryo"], "title": "From Images to Insights: Explainable Biodiversity Monitoring with Plain Language Habitat Explanations", "comment": "Code will be released at: https://github.com/Yutong-Zhou-cv/BioX", "summary": "Explaining why the species lives at a particular location is important for\nunderstanding ecological systems and conserving biodiversity. However, existing\necological workflows are fragmented and often inaccessible to non-specialists.\nWe propose an end-to-end visual-to-causal framework that transforms a species\nimage into interpretable causal insights about its habitat preference. The\nsystem integrates species recognition, global occurrence retrieval,\npseudo-absence sampling, and climate data extraction. We then discover causal\nstructures among environmental features and estimate their influence on species\noccurrence using modern causal inference methods. Finally, we generate\nstatistically grounded, human-readable causal explanations from structured\ntemplates and large language models. We demonstrate the framework on a bee and\na flower species and report early results as part of an ongoing project,\nshowing the potential of the multimodal AI assistant backed up by a recommended\necological modeling practice for describing species habitat in\nhuman-understandable language.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10568", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10568", "abs": "https://arxiv.org/abs/2506.10568", "authors": ["Lizhen Wang", "Zhurong Xia", "Tianshu Hu", "Pengrui Wang", "Pengfei Wang", "Zerong Zheng", "Ming Zhou"], "title": "DreamActor-H1: High-Fidelity Human-Product Demonstration Video Generation via Motion-designed Diffusion Transformers", "comment": null, "summary": "In e-commerce and digital marketing, generating high-fidelity human-product\ndemonstration videos is important for effective product presentation. However,\nmost existing frameworks either fail to preserve the identities of both humans\nand products or lack an understanding of human-product spatial relationships,\nleading to unrealistic representations and unnatural interactions. To address\nthese challenges, we propose a Diffusion Transformer (DiT)-based framework. Our\nmethod simultaneously preserves human identities and product-specific details,\nsuch as logos and textures, by injecting paired human-product reference\ninformation and utilizing an additional masked cross-attention mechanism. We\nemploy a 3D body mesh template and product bounding boxes to provide precise\nmotion guidance, enabling intuitive alignment of hand gestures with product\nplacements. Additionally, structured text encoding is used to incorporate\ncategory-level semantics, enhancing 3D consistency during small rotational\nchanges across frames. Trained on a hybrid dataset with extensive data\naugmentation strategies, our approach outperforms state-of-the-art techniques\nin maintaining the identity integrity of both humans and products and\ngenerating realistic demonstration motions. Project page:\nhttps://submit2025-dream.github.io/DreamActor-H1/.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10910", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10910", "abs": "https://arxiv.org/abs/2506.10910", "authors": ["Mistral-AI", ":", "Abhinav Rastogi", "Albert Q. Jiang", "Andy Lo", "Gabrielle Berrada", "Guillaume Lample", "Jason Rute", "Joep Barmentlo", "Karmesh Yadav", "Kartik Khandelwal", "Khyathi Raghavi Chandu", "Léonard Blier", "Lucile Saulnier", "Matthieu Dinot", "Maxime Darrin", "Neha Gupta", "Roman Soletskyi", "Sagar Vaze", "Teven Le Scao", "Yihan Wang", "Adam Yang", "Alexander H. Liu", "Alexandre Sablayrolles", "Amélie Héliou", "Amélie Martin", "Andy Ehrenberg", "Anmol Agarwal", "Antoine Roux", "Arthur Darcet", "Arthur Mensch", "Baptiste Bout", "Baptiste Rozière", "Baudouin De Monicault", "Chris Bamford", "Christian Wallenwein", "Christophe Renaudin", "Clémence Lanfranchi", "Darius Dabert", "Devon Mizelle", "Diego de las Casas", "Elliot Chane-Sane", "Emilien Fugier", "Emma Bou Hanna", "Gauthier Delerce", "Gauthier Guinet", "Georgii Novikov", "Guillaume Martin", "Himanshu Jaju", "Jan Ludziejewski", "Jean-Hadrien Chabran", "Jean-Malo Delignon", "Joachim Studnia", "Jonas Amar", "Josselin Somerville Roberts", "Julien Denize", "Karan Saxena", "Kush Jain", "Lingxiao Zhao", "Louis Martin", "Luyu Gao", "Lélio Renard Lavaud", "Marie Pellat", "Mathilde Guillaumin", "Mathis Felardos", "Maximilian Augustin", "Mickaël Seznec", "Nikhil Raghuraman", "Olivier Duchenne", "Patricia Wang", "Patrick von Platen", "Patryk Saffer", "Paul Jacob", "Paul Wambergue", "Paula Kurylowicz", "Pavankumar Reddy Muddireddy", "Philomène Chagniot", "Pierre Stock", "Pravesh Agrawal", "Romain Sauvestre", "Rémi Delacourt", "Sanchit Gandhi", "Sandeep Subramanian", "Shashwat Dalal", "Siddharth Gandhi", "Soham Ghosh", "Srijan Mishra", "Sumukh Aithal", "Szymon Antoniak", "Thibault Schueller", "Thibaut Lavril", "Thomas Robert", "Thomas Wang", "Timothée Lacroix", "Valeriia Nemychnikova", "Victor Paltz", "Virgile Richard", "Wen-Ding Li", "William Marshall", "Xuanyu Zhang", "Yunhao Tang"], "title": "Magistral", "comment": null, "summary": "We introduce Magistral, Mistral's first reasoning model and our own scalable\nreinforcement learning (RL) pipeline. Instead of relying on existing\nimplementations and RL traces distilled from prior models, we follow a ground\nup approach, relying solely on our own models and infrastructure. Notably, we\ndemonstrate a stack that enabled us to explore the limits of pure RL training\nof LLMs, present a simple method to force the reasoning language of the model,\nand show that RL on text data alone maintains most of the initial checkpoint's\ncapabilities. We find that RL on text maintains or improves multimodal\nunderstanding, instruction following and function calling. We present Magistral\nMedium, trained for reasoning on top of Mistral Medium 3 with RL alone, and we\nopen-source Magistral Small (Apache 2.0) which further includes cold-start data\nfrom Magistral Medium.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["reasoning model"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10573", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10573", "abs": "https://arxiv.org/abs/2506.10573", "authors": ["Jun Wang", "Lixing Zhu", "Xiaohan Yu", "Abhir Bhalerao", "Yulan He"], "title": "Improving Medical Visual Representation Learning with Pathological-level Cross-Modal Alignment and Correlation Exploration", "comment": "12 pages, 10 tables and 6 figures", "summary": "Learning medical visual representations from image-report pairs through joint\nlearning has garnered increasing research attention due to its potential to\nalleviate the data scarcity problem in the medical domain. The primary\nchallenges stem from the lengthy reports that feature complex discourse\nrelations and semantic pathologies. Previous works have predominantly focused\non instance-wise or token-wise cross-modal alignment, often neglecting the\nimportance of pathological-level consistency. This paper presents a novel\nframework PLACE that promotes the Pathological-Level Alignment and enriches the\nfine-grained details via Correlation Exploration without additional human\nannotations. Specifically, we propose a novel pathological-level cross-modal\nalignment (PCMA) approach to maximize the consistency of pathology observations\nfrom both images and reports. To facilitate this, a Visual Pathology\nObservation Extractor is introduced to extract visual pathological observation\nrepresentations from localized tokens. The PCMA module operates independently\nof any external disease annotations, enhancing the generalizability and\nrobustness of our methods. Furthermore, we design a proxy task that enforces\nthe model to identify correlations among image patches, thereby enriching the\nfine-grained details crucial for various downstream tasks. Experimental results\ndemonstrate that our proposed framework achieves new state-of-the-art\nperformance on multiple downstream tasks, including classification,\nimage-to-text retrieval, semantic segmentation, object detection and report\ngeneration.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "consistency", "fine-grained"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10574", "categories": ["cs.CV", "cs.MM", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2506.10574", "abs": "https://arxiv.org/abs/2506.10574", "authors": ["Qing Wang", "Xiaohang Yang", "Yilan Dong", "Naveen Raj Govindaraj", "Gregory Slabaugh", "Shanxin Yuan"], "title": "DanceChat: Large Language Model-Guided Music-to-Dance Generation", "comment": "check demos at https://dancechat.github.io/anon/", "summary": "Music-to-dance generation aims to synthesize human dance motion conditioned\non musical input. Despite recent progress, significant challenges remain due to\nthe semantic gap between music and dance motion, as music offers only abstract\ncues, such as melody, groove, and emotion, without explicitly specifying the\nphysical movements. Moreover, a single piece of music can produce multiple\nplausible dance interpretations. This one-to-many mapping demands additional\nguidance, as music alone provides limited information for generating diverse\ndance movements. The challenge is further amplified by the scarcity of paired\nmusic and dance data, which restricts the model\\^a\\u{A}\\'Zs ability to learn\ndiverse dance patterns. In this paper, we introduce DanceChat, a Large Language\nModel (LLM)-guided music-to-dance generation approach. We use an LLM as a\nchoreographer that provides textual motion instructions, offering explicit,\nhigh-level guidance for dance generation. This approach goes beyond implicit\nlearning from music alone, enabling the model to generate dance that is both\nmore diverse and better aligned with musical styles. Our approach consists of\nthree components: (1) an LLM-based pseudo instruction generation module that\nproduces textual dance guidance based on music style and structure, (2) a\nmulti-modal feature extraction and fusion module that integrates music, rhythm,\nand textual guidance into a shared representation, and (3) a diffusion-based\nmotion synthesis module together with a multi-modal alignment loss, which\nensures that the generated dance is aligned with both musical and textual cues.\nExtensive experiments on AIST++ and human evaluations show that DanceChat\noutperforms state-of-the-art methods both qualitatively and quantitatively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10934", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.10934", "abs": "https://arxiv.org/abs/2506.10934", "authors": ["Timothy Obiso", "Kenneth Lai", "Abhijnan Nath", "Nikhil Krishnaswamy", "James Pustejovsky"], "title": "Dynamic Epistemic Friction in Dialogue", "comment": "11 pages, 2 figures, 2 tables, CoNLL 2025", "summary": "Recent developments in aligning Large Language Models (LLMs) with human\npreferences have significantly enhanced their utility in human-AI collaborative\nscenarios. However, such approaches often neglect the critical role of\n\"epistemic friction,\" or the inherent resistance encountered when updating\nbeliefs in response to new, conflicting, or ambiguous information. In this\npaper, we define dynamic epistemic friction as the resistance to epistemic\nintegration, characterized by the misalignment between an agent's current\nbelief state and new propositions supported by external evidence. We position\nthis within the framework of Dynamic Epistemic Logic (Van Benthem and Pacuit,\n2011), where friction emerges as nontrivial belief-revision during the\ninteraction. We then present analyses from a situated collaborative task that\ndemonstrate how this model of epistemic friction can effectively predict belief\nupdates in dialogues, and we subsequently discuss how the model of belief\nalignment as a measure of epistemic resistance or friction can naturally be\nmade more sophisticated to accommodate the complexities of real-world dialogue\nscenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10609", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10609", "abs": "https://arxiv.org/abs/2506.10609", "authors": ["Liang Yin", "Xudong Xie", "Zhang Li", "Xiang Bai", "Yuliang Liu"], "title": "MSTAR: Box-free Multi-query Scene Text Retrieval with Attention Recycling", "comment": null, "summary": "Scene text retrieval has made significant progress with the assistance of\naccurate text localization. However, existing approaches typically require\ncostly bounding box annotations for training. Besides, they mostly adopt a\ncustomized retrieval strategy but struggle to unify various types of queries to\nmeet diverse retrieval needs. To address these issues, we introduce Muti-query\nScene Text retrieval with Attention Recycling (MSTAR), a box-free approach for\nscene text retrieval. It incorporates progressive vision embedding to\ndynamically capture the multi-grained representation of texts and harmonizes\nfree-style text queries with style-aware instructions. Additionally, a\nmulti-instance matching module is integrated to enhance vision-language\nalignment. Furthermore, we build the Multi-Query Text Retrieval (MQTR) dataset,\nthe first benchmark designed to evaluate the multi-query scene text retrieval\ncapability of models, comprising four query types and 16k images. Extensive\nexperiments demonstrate the superiority of our method across seven public\ndatasets and the MQTR dataset. Notably, MSTAR marginally surpasses the previous\nstate-of-the-art model by 6.4% in MAP on Total-Text while eliminating box\nannotation costs. Moreover, on the MQTR benchmark, MSTAR significantly\noutperforms the previous models by an average of 8.5%. The code and datasets\nare available at https://github.com/yingift/MSTAR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10633", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10633", "abs": "https://arxiv.org/abs/2506.10633", "authors": ["Konstantinos Vilouras", "Ilias Stogiannidis", "Junyu Yan", "Alison Q. O'Neil", "Sotirios A. Tsaftaris"], "title": "Anatomy-Grounded Weakly Supervised Prompt Tuning for Chest X-ray Latent Diffusion Models", "comment": "14 pages, 6 figures", "summary": "Latent Diffusion Models have shown remarkable results in text-guided image\nsynthesis in recent years. In the domain of natural (RGB) images, recent works\nhave shown that such models can be adapted to various vision-language\ndownstream tasks with little to no supervision involved. On the contrary,\ntext-to-image Latent Diffusion Models remain relatively underexplored in the\nfield of medical imaging, primarily due to limited data availability (e.g., due\nto privacy concerns). In this work, focusing on the chest X-ray modality, we\nfirst demonstrate that a standard text-conditioned Latent Diffusion Model has\nnot learned to align clinically relevant information in free-text radiology\nreports with the corresponding areas of the given scan. Then, to alleviate this\nissue, we propose a fine-tuning framework to improve multi-modal alignment in a\npre-trained model such that it can be efficiently repurposed for downstream\ntasks such as phrase grounding. Our method sets a new state-of-the-art on a\nstandard benchmark dataset (MS-CXR), while also exhibiting robust performance\non out-of-distribution data (VinDr-CXR). Our code will be made publicly\navailable.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10813", "categories": ["cs.CV", "eess.IV", "eess.SP"], "pdf": "https://arxiv.org/pdf/2506.10813", "abs": "https://arxiv.org/abs/2506.10813", "authors": ["Hang Zhang", "Xiang Chen", "Renjiu Hu", "Rongguang Wang", "Jinwei Zhang", "Min Liu", "Yaonan Wang", "Gaolei Li", "Xinxing Cheng", "Jinming Duan"], "title": "Unsupervised Deformable Image Registration with Structural Nonparametric Smoothing", "comment": "Accepted for publication at Information Processing in Medical Imaging\n  (IPMI) 2025", "summary": "Learning-based deformable image registration (DIR) accelerates alignment by\namortizing traditional optimization via neural networks. Label supervision\nfurther enhances accuracy, enabling efficient and precise nonlinear alignment\nof unseen scans. However, images with sparse features amid large smooth\nregions, such as retinal vessels, introduce aperture and large-displacement\nchallenges that unsupervised DIR methods struggle to address. This limitation\noccurs because neural networks predict deformation fields in a single forward\npass, leaving fields unconstrained post-training and shifting the\nregularization burden entirely to network weights. To address these issues, we\nintroduce SmoothProper, a plug-and-play neural module enforcing smoothness and\npromoting message passing within the network's forward pass. By integrating a\nduality-based optimization layer with tailored interaction terms, SmoothProper\nefficiently propagates flow signals across spatial locations, enforces\nsmoothness, and preserves structural consistency. It is model-agnostic,\nseamlessly integrates into existing registration frameworks with minimal\nparameter overhead, and eliminates regularizer hyperparameter tuning.\nPreliminary results on a retinal vessel dataset exhibiting aperture and\nlarge-displacement challenges demonstrate our method reduces registration error\nto 1.88 pixels on 2912x2912 images, marking the first unsupervised DIR approach\nto effectively address both challenges. The source code will be available at\nhttps://github.com/tinymilky/SmoothProper.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10895", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.10895", "abs": "https://arxiv.org/abs/2506.10895", "authors": ["Guimeng Liu", "Milad Abdollahzadeh", "Ngai-Man Cheung"], "title": "AIR: Zero-shot Generative Model Adaptation with Iterative Refinement", "comment": null, "summary": "Zero-shot generative model adaptation (ZSGM) aims to adapt a pre-trained\ngenerator to a target domain using only text guidance and without any samples\nfrom the target domain. Central to recent ZSGM approaches are directional loss\nwhich use the text guidance in the form of aligning the image offset with text\noffset in the embedding space of a vision-language model like CLIP. This is\nsimilar to the analogical reasoning in NLP where the offset between one pair of\nwords is used to identify a missing element in another pair by aligning the\noffset between these two pairs. However, a major limitation of existing ZSGM\nmethods is that the learning objective assumes the complete alignment between\nimage offset and text offset in the CLIP embedding space, resulting in quality\ndegrade in generated images. Our work makes two main contributions. Inspired by\nthe offset misalignment studies in NLP, as our first contribution, we perform\nan empirical study to analyze the misalignment between text offset and image\noffset in CLIP embedding space for various large publicly available datasets.\nOur important finding is that offset misalignment in CLIP embedding space is\ncorrelated with concept distance, i.e., close concepts have a less offset\nmisalignment. To address the limitations of the current approaches, as our\nsecond contribution, we propose Adaptation with Iterative Refinement (AIR)\nwhich is the first ZSGM approach to focus on improving target domain image\nquality based on our new insight on offset misalignment.Qualitative,\nquantitative, and user study in 26 experiment setups consistently demonstrate\nthe proposed AIR approach achieves SOTA performance. Additional experiments are\nin Supp.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["iterative refinement"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-13.jsonl"}
{"id": "2506.10468", "categories": ["cs.GR", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.10468", "abs": "https://arxiv.org/abs/2506.10468", "authors": ["Zaiqiang Wu", "Yechen Li", "Jingyuan Liu", "Yuki Shibata", "Takayuki Hori", "I-Chao Shen", "Takeo Igarashi"], "title": "Low-Barrier Dataset Collection with Real Human Body for Interactive Per-Garment Virtual Try-On", "comment": null, "summary": "Existing image-based virtual try-on methods are often limited to the front\nview and lack real-time performance. While per-garment virtual try-on methods\nhave tackled these issues by capturing per-garment datasets and training\nper-garment neural networks, they still encounter practical limitations: (1)\nthe robotic mannequin used to capture per-garment datasets is prohibitively\nexpensive for widespread adoption and fails to accurately replicate natural\nhuman body deformation; (2) the synthesized garments often misalign with the\nhuman body. To address these challenges, we propose a low-barrier approach for\ncollecting per-garment datasets using real human bodies, eliminating the\nnecessity for a customized robotic mannequin. We also introduce a hybrid person\nrepresentation that enhances the existing intermediate representation with a\nsimplified DensePose map. This ensures accurate alignment of synthesized\ngarment images with the human body and enables human-garment interaction\nwithout the need for customized wearable devices. We performed qualitative and\nquantitative evaluations against other state-of-the-art image-based virtual\ntry-on methods and conducted ablation studies to demonstrate the superiority of\nour method regarding image quality and temporal consistency. Finally, our user\nstudy results indicated that most participants found our virtual try-on system\nhelpful for making garment purchasing decisions.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-06-13.jsonl"}
