{"id": "2507.02675", "categories": ["cs.GT"], "pdf": "https://arxiv.org/pdf/2507.02675", "abs": "https://arxiv.org/abs/2507.02675", "authors": ["Zhaoqilin Yang", "Xin Wang", "Ruichen Zhang", "Chanchan Li", "Youliang Tian"], "title": "TUC-PPO: Team Utility-Constrained Proximal Policy Optimization for Spatial Public Goods Games", "comment": null, "summary": "We introduce Team Utility-Constrained Proximal Policy Optimization (TUC-PPO),\na new deep reinforcement learning framework. It extends Proximal Policy\nOptimization (PPO) by integrating team welfare objectives specifically for\nspatial public goods games. Unlike conventional approaches where cooperation\nemerges indirectly from individual rewards, TUC-PPO instead optimizes a\nbi-level objective integrating policy gradients and team utility constraints.\nConsequently, all policy updates explicitly incorporate collective payoff\nthresholds. The framework preserves PPO's policy gradient core while\nincorporating constrained optimization through adaptive Lagrangian multipliers.\nTherefore, decentralized agents dynamically balance selfish and cooperative\nincentives. The comparative analysis demonstrates superior performance of this\nconstrained deep reinforcement learning approach compared to unmodified PPO and\nevolutionary game theory baselines. It achieves faster convergence to\ncooperative equilibria and greater stability against invasion by defectors. The\nframework formally integrates team objectives into policy updates. This work\nadvances multi-agent deep reinforcement learning for social dilemmas while\nproviding new computational tools for evolutionary game theory research.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["PPO", "proximal policy optimization", "policy gradient", "reinforcement learning", "policy optimization"], "score": 5}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02834", "categories": ["cs.LG", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.02834", "abs": "https://arxiv.org/abs/2507.02834", "authors": ["Ruiyang Zhou", "Shuozhe Li", "Amy Zhang", "Liu Leqi"], "title": "ExPO: Unlocking Hard Reasoning with Self-Explanation-Guided Reinforcement Learning", "comment": null, "summary": "Recent advances in large language models have been driven by reinforcement\nlearning (RL)-style post-training, which improves reasoning by optimizing model\noutputs based on reward or preference signals. GRPO-style approaches implement\nthis by using self-generated samples labeled by an outcome-based verifier.\nHowever, these methods depend heavily on the model's initial ability to produce\npositive samples. They primarily refine what the model already knows\n(distribution sharpening) rather than enabling the model to solve problems\nwhere it initially fails. This limitation is especially problematic in\nearly-stage RL training and on challenging reasoning tasks, where positive\nsamples are unlikely to be generated. To unlock reasoning ability in such\nsettings, the model must explore new reasoning trajectories beyond its current\noutput distribution. Such exploration requires access to sufficiently good\npositive samples to guide the learning. While expert demonstrations seem like a\nnatural solution, we find that they are often ineffective in RL post-training.\nInstead, we identify two key properties of effective positive samples: they\nshould (1) be likely under the current policy, and (2) increase the model's\nlikelihood of predicting the correct answer. Based on these insights, we\npropose $\\textbf{Self-Explanation Policy Optimization (ExPO)}$-a simple and\nmodular framework that generates such samples by conditioning on the\nground-truth answer. ExPO enables efficient exploration and guides the model to\nproduce reasoning trajectories more aligned with its policy than expert-written\nCoTs, while ensuring higher quality than its own (incorrect) samples.\nExperiments show that ExPO improves both learning efficiency and final\nperformance on reasoning benchmarks, surpassing expert-demonstration-based\nmethods in challenging settings such as MATH level-5, where the model initially\nstruggles the most.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization", "preference"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02745", "categories": ["cs.HC"], "pdf": "https://arxiv.org/pdf/2507.02745", "abs": "https://arxiv.org/abs/2507.02745", "authors": ["Zahra Ashktorab", "Alessandra Buccella", "Jason D'Cruz", "Zoe Fowler", "Andrew Gill", "Kei Yan Leung", "P. D. Magnus", "John Richards", "Kush R. Varshney"], "title": "Who's Sorry Now: User Preferences Among Rote, Empathic, and Explanatory Apologies from LLM Chatbots", "comment": null, "summary": "As chatbots driven by large language models (LLMs) are increasingly deployed\nin everyday contexts, their ability to recover from errors through effective\napologies is critical to maintaining user trust and satisfaction. In a\npreregistered study with Prolific workers (N=162), we examine user preferences\nfor three types of apologies (rote, explanatory, and empathic) issued in\nresponse to three categories of common LLM mistakes (bias, unfounded\nfabrication, and factual errors). We designed a pairwise experiment in which\nparticipants evaluated chatbot responses consisting of an initial error, a\nsubsequent apology, and a resolution. Explanatory apologies were generally\npreferred, but this varied by context and user. In the bias scenario, empathic\napologies were favored for acknowledging emotional impact, while\nhallucinations, though seen as serious, elicited no clear preference,\nreflecting user uncertainty. Our findings show the complexity of effective\napology in AI systems. We discuss key insights such as personalization and\ncalibration that future systems must navigate to meaningfully repair trust.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "pairwise"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02244", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02244", "abs": "https://arxiv.org/abs/2507.02244", "authors": ["Fangzhou Shi", "Xiaopeng Ke", "Xinye Xiong", "Kexin Meng", "Chang Men", "Zhengdan Zhu"], "title": "Order Acquisition Under Competitive Pressure: A Rapidly Adaptive Reinforcement Learning Approach for Ride-Hailing Subsidy Strategies", "comment": null, "summary": "The proliferation of ride-hailing aggregator platforms presents significant\ngrowth opportunities for ride-service providers by increasing order volume and\ngross merchandise value (GMV). On most ride-hailing aggregator platforms,\nservice providers that offer lower fares are ranked higher in listings and,\nconsequently, are more likely to be selected by passengers. This competitive\nranking mechanism creates a strong incentive for service providers to adopt\ncoupon strategies that lower prices to secure a greater number of orders, as\norder volume directly influences their long-term viability and sustainability.\nThus, designing an effective coupon strategy that can dynamically adapt to\nmarket fluctuations while optimizing order acquisition under budget constraints\nis a critical research challenge. However, existing studies in this area remain\nscarce.\n  To bridge this gap, we propose FCA-RL, a novel reinforcement learning-based\nsubsidy strategy framework designed to rapidly adapt to competitors' pricing\nadjustments. Our approach integrates two key techniques: Fast Competition\nAdaptation (FCA), which enables swift responses to dynamic price changes, and\nReinforced Lagrangian Adjustment (RLA), which ensures adherence to budget\nconstraints while optimizing coupon decisions on new price landscape.\nFurthermore, we introduce RideGym, the first dedicated simulation environment\ntailored for ride-hailing aggregators, facilitating comprehensive evaluation\nand benchmarking of different pricing strategies without compromising\nreal-world operational efficiency. Experimental results demonstrate that our\nproposed method consistently outperforms baseline approaches across diverse\nmarket conditions, highlighting its effectiveness in subsidy optimization for\nride-hailing service providers.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "ranking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02002", "categories": ["cs.MA"], "pdf": "https://arxiv.org/pdf/2507.02002", "abs": "https://arxiv.org/abs/2507.02002", "authors": ["Shaurya Mallampati", "Rashed Shelim", "Walid Saad", "Naren Ramakrishnan"], "title": "Dynamic Strategy Adaptation in Multi-Agent Environments with Large Language Models", "comment": "20 pages, 11 figures Submitted to GameSec 2025 (under review)", "summary": "Large language models (LLMs) demonstrate strong reasoning abilities across\nmathematical, strategic, and linguistic tasks, yet little is known about how\nwell they reason in dynamic, real-time, multi-agent scenarios, such as\ncollaborative environments in which agents continuously adapt to each other's\nbehavior, as in cooperative gameplay settings. In this paper, we bridge this\ngap by combining LLM-driven agents with strategic reasoning and real-time\nadaptation in cooperative, multi-agent environments grounded in game-theoretic\nprinciples such as belief consistency and Nash equilibrium. The proposed\nframework applies broadly to dynamic scenarios in which agents coordinate,\ncommunicate, and make decisions in response to continuously changing\nconditions. We provide real-time strategy refinement and adaptive feedback\nmechanisms that enable agents to dynamically adjust policies based on immediate\ncontextual interactions, in contrast to previous efforts that evaluate LLM\ncapabilities in static or turn-based settings. Empirical results show that our\nmethod achieves up to a 26\\% improvement in return over PPO baselines in\nhigh-noise environments, while maintaining real-time latency under 1.05\nmilliseconds. Our approach improves collaboration efficiency, task completion\nrates, and flexibility, illustrating that game-theoretic guidance integrated\nwith real-time feedback enhances LLM performance, ultimately fostering more\nresilient and flexible strategic multi-agent systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["PPO"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.01982", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.01982", "abs": "https://arxiv.org/abs/2507.01982", "authors": ["Siqing Long", "Xiangzhi Huang", "Jiemin Xie", "Ming Cai"], "title": "DKGCM: A Spatio-Temporal Prediction Model for Traffic Flow by Fusing Spatial Node Clustering Method and Fourier Bidirectional Mamba Mechanism", "comment": "39 pages, 14 figures", "summary": "Accurate traffic demand forecasting enables transportation management\ndepartments to allocate resources more effectively, thereby improving their\nutilization efficiency. However, complex spatiotemporal relationships in\ntraffic systems continue to limit the performance of demand forecasting models.\nTo improve the accuracy of spatiotemporal traffic demand prediction, we propose\na new graph convolutional network structure called DKGCM. Specifically, we\nfirst consider the spatial flow distribution of different traffic nodes and\npropose a novel temporal similarity-based clustering graph convolution method,\nDK-GCN. This method utilizes Dynamic Time Warping (DTW) and K-means clustering\nto group traffic nodes and more effectively capture spatial dependencies. On\nthe temporal scale, we integrate the Fast Fourier Transform (FFT) within the\nbidirectional Mamba deep learning framework to capture temporal dependencies in\ntraffic demand. To further optimize model training, we incorporate the GRPO\nreinforcement learning strategy to enhance the loss function feedback\nmechanism. Extensive experiments demonstrate that our model outperforms several\nadvanced methods and achieves strong results on three public datasets.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02212", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02212", "abs": "https://arxiv.org/abs/2507.02212", "authors": ["Takuro Kawada", "Shunsuke Kitada", "Sota Nemoto", "Hitoshi Iyatomi"], "title": "SciGA: A Comprehensive Dataset for Designing Graphical Abstracts in Academic Papers", "comment": "21 pages, 15 figures, 4 tables. Project Page:\n  https://iyatomilab.github.io/SciGA/", "summary": "Graphical Abstracts (GAs) play a crucial role in visually conveying the key\nfindings of scientific papers. While recent research has increasingly\nincorporated visual materials such as Figure 1 as de facto GAs, their potential\nto enhance scientific communication remains largely unexplored. Moreover,\ndesigning effective GAs requires advanced visualization skills, creating a\nbarrier to their widespread adoption. To tackle these challenges, we introduce\nSciGA-145k, a large-scale dataset comprising approximately 145,000 scientific\npapers and 1.14 million figures, explicitly designed for supporting GA\nselection and recommendation as well as facilitating research in automated GA\ngeneration. As a preliminary step toward GA design support, we define two\ntasks: 1) Intra-GA recommendation, which identifies figures within a given\npaper that are well-suited to serve as GAs, and 2) Inter-GA recommendation,\nwhich retrieves GAs from other papers to inspire the creation of new GAs. We\nprovide reasonable baseline models for these tasks. Furthermore, we propose\nConfidence Adjusted top-1 ground truth Ratio (CAR), a novel recommendation\nmetric that offers a fine-grained analysis of model behavior. CAR addresses\nlimitations in traditional ranking-based metrics by considering cases where\nmultiple figures within a paper, beyond the explicitly labeled GA, may also\nserve as GAs. By unifying these tasks and metrics, our SciGA-145k establishes a\nfoundation for advancing visual scientific communication while contributing to\nthe development of AI for Science.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02006", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02006", "abs": "https://arxiv.org/abs/2507.02006", "authors": ["Shakya Jayakody", "Youpeng Zhao", "Jun Wang"], "title": "AIRES: Accelerating Out-of-Core GCNs via Algorithm-System Co-Design", "comment": "36th IEEE International Conference on Application-Specific Systems,\n  Architectures and Processors. (Accepted)", "summary": "Graph convolutional networks (GCNs) are fundamental in various scientific\napplications, ranging from biomedical protein-protein interactions (PPI) to\nlarge-scale recommendation systems. An essential component for modeling graph\nstructures in GCNs is sparse general matrix-matrix multiplication (SpGEMM). As\nthe size of graph data continues to scale up, SpGEMMs are often conducted in an\nout-of-core fashion due to limited GPU memory space in resource-constrained\nsystems. Albeit recent efforts that aim to alleviate the memory constraints of\nout-of-core SpGEMM through either GPU feature caching, hybrid CPU-GPU memory\nlayout, or performing the computation in sparse format, current systems suffer\nfrom both high I/O latency and GPU under-utilization issues.\n  In this paper, we first identify the problems of existing systems, where\nsparse format data alignment and memory allocation are the main performance\nbottlenecks, and propose AIRES, a novel algorithm-system co-design solution to\naccelerate out-of-core SpGEMM computation for GCNs. Specifically, from the\nalgorithm angle, AIRES proposes to alleviate the data alignment issues on the\nblock level for matrices in sparse formats and develops a tiling algorithm to\nfacilitate row block-wise alignment. On the system level, AIRES employs a\nthree-phase dynamic scheduling that features a dual-way data transfer strategy\nutilizing a tiered memory system: integrating GPU memory, GPU Direct Storage\n(GDS), and host memory to reduce I/O latency and improve throughput.\nEvaluations show that AIRES significantly outperforms the state-of-the-art\nmethods, achieving up to 1.8x lower latency in real-world graph processing\nbenchmarks.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02447", "categories": ["cs.RO"], "pdf": "https://arxiv.org/pdf/2507.02447", "abs": "https://arxiv.org/abs/2507.02447", "authors": ["Xiang Zhou", "Xinyu Zhang", "Qingrui Zhang"], "title": "HAC-LOCO: Learning Hierarchical Active Compliance Control for Quadruped Locomotion under Continuous External Disturbances", "comment": "8 pages, 7 Figures", "summary": "Despite recent remarkable achievements in quadruped control, it remains\nchallenging to ensure robust and compliant locomotion in the presence of\nunforeseen external disturbances. Existing methods prioritize locomotion\nrobustness over compliance, often leading to stiff, high-frequency motions, and\nenergy inefficiency. This paper, therefore, presents a two-stage hierarchical\nlearning framework that can learn to take active reactions to external force\ndisturbances based on force estimation. In the first stage, a velocity-tracking\npolicy is trained alongside an auto-encoder to distill historical\nproprioceptive features. A neural network-based estimator is learned through\nsupervised learning, which estimates body velocity and external forces based on\nproprioceptive measurements. In the second stage, a compliance action module,\ninspired by impedance control, is learned based on the pre-trained encoder and\npolicy. This module is employed to actively adjust velocity commands in\nresponse to external forces based on real-time force estimates. With the\ncompliance action module, a quadruped robot can robustly handle minor\ndisturbances while appropriately yielding to significant forces, thus striking\na balance between robustness and compliance. Simulations and real-world\nexperiments have demonstrated that our method has superior performance in terms\nof robustness, energy efficiency, and safety. Experiment comparison shows that\nour method outperforms the state-of-the-art RL-based locomotion controllers.\nAblation studies are given to show the critical roles of the compliance action\nmodule.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02283", "categories": ["cs.HC", "I.2.6; H.1.2"], "pdf": "https://arxiv.org/pdf/2507.02283", "abs": "https://arxiv.org/abs/2507.02283", "authors": ["Tim Rogers", "Ben Teehankee"], "title": "Misaligned from Within: Large Language Models Reproduce Our Double-Loop Learning Blindness", "comment": "21 pages", "summary": "This paper examines a critical yet unexplored dimension of the AI alignment\nproblem: the potential for Large Language Models (LLMs) to inherit and amplify\nexisting misalignments between human espoused theories and theories-in-use.\nDrawing on action science research, we argue that LLMs trained on\nhuman-generated text likely absorb and reproduce Model 1 theories-in-use - a\ndefensive reasoning pattern that both inhibits learning and creates ongoing\nanti-learning dynamics at the dyad, group, and organisational levels. Through a\ndetailed case study of an LLM acting as an HR consultant, we show how its\nadvice, while superficially professional, systematically reinforces\nunproductive problem-solving approaches and blocks pathways to deeper\norganisational learning. This represents a specific instance of the alignment\nproblem where the AI system successfully mirrors human behaviour but inherits\nour cognitive blind spots. This poses particular risks if LLMs are integrated\ninto organisational decision-making processes, potentially entrenching\nanti-learning practices while lending authority to them. The paper concludes by\nexploring the possibility of developing LLMs capable of facilitating Model 2\nlearning - a more productive theory-in-use - and suggests this effort could\nadvance both AI alignment research and action science practice. This analysis\nreveals an unexpected symmetry in the alignment challenge: the process of\ndeveloping AI systems properly aligned with human values could yield tools that\nhelp humans themselves better embody those same values.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dimension"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02306", "categories": ["cs.HC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02306", "abs": "https://arxiv.org/abs/2507.02306", "authors": ["Ruican Zhong", "David W. McDonald", "Gary Hsieh"], "title": "Synthetic Heuristic Evaluation: A Comparison between AI- and Human-Powered Usability Evaluation", "comment": null, "summary": "Usability evaluation is crucial in human-centered design but can be costly,\nrequiring expert time and user compensation. In this work, we developed a\nmethod for synthetic heuristic evaluation using multimodal LLMs' ability to\nanalyze images and provide design feedback. Comparing our synthetic evaluations\nto those by experienced UX practitioners across two apps, we found our\nevaluation identified 73% and 77% of usability issues, which exceeded the\nperformance of 5 experienced human evaluators (57% and 63%). Compared to human\nevaluators, the synthetic evaluation's performance maintained consistent\nperformance across tasks and excelled in detecting layout issues, highlighting\npotential attentional and perceptual strengths of synthetic evaluation.\nHowever, synthetic evaluation struggled with recognizing some UI components and\ndesign conventions, as well as identifying across screen violations.\nAdditionally, testing synthetic evaluations over time and accounts revealed\nstable performance. Overall, our work highlights the performance differences\nbetween human and LLM-driven evaluations, informing the design of synthetic\nheuristic evaluations.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02537", "categories": ["cs.HC", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02537", "abs": "https://arxiv.org/abs/2507.02537", "authors": ["Paulo Ricardo Knob", "Leonardo Scholler", "Juliano Rigatti", "Soraia Raupp Musse"], "title": "Are You Listening to Me? Fine-Tuning Chatbots for Empathetic Dialogue", "comment": null, "summary": "Conversational agents have made significant progress since ELIZA, expanding\ntheir role across various domains, including healthcare, education, and\ncustomer service. As these agents become increasingly integrated into daily\nhuman interactions, the need for emotional intelligence, particularly\nempathetic listening, becomes increasingly essential. In this study, we explore\nhow Large Language Models (LLMs) respond when tasked with generating\nemotionally rich interactions. Starting from a small dataset manually crafted\nby an expert to reflect empathic behavior, we extended the conversations using\ntwo LLMs: ChatGPT and Gemini. We analyzed the emotional progression of the\ndialogues using both sentiment analysis (via VADER) and expert assessments.\nWhile the generated conversations often mirrored the intended emotional\nstructure, human evaluation revealed important differences in the perceived\nempathy and coherence of the responses. These findings suggest that emotion\nmodeling in dialogues requires not only structural alignment in the expressed\nemotions but also qualitative depth, highlighting the importance of combining\nautomated and humancentered methods in the development of emotionally competent\nagents.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "dialogue"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02288", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02288", "abs": "https://arxiv.org/abs/2507.02288", "authors": ["De Cheng", "Zhipeng Xu", "Xinyang Jiang", "Dongsheng Li", "Nannan Wang", "Xinbo Gao"], "title": "Prompt Disentanglement via Language Guidance and Representation Alignment for Domain Generalization", "comment": null, "summary": "Domain Generalization (DG) seeks to develop a versatile model capable of\nperforming effectively on unseen target domains. Notably, recent advances in\npre-trained Visual Foundation Models (VFMs), such as CLIP, have demonstrated\nconsiderable potential in enhancing the generalization capabilities of deep\nlearning models. Despite the increasing attention toward VFM-based domain\nprompt tuning within DG, the effective design of prompts capable of\ndisentangling invariant features across diverse domains remains a critical\nchallenge. In this paper, we propose addressing this challenge by leveraging\nthe controllable and flexible language prompt of the VFM. Noting that the text\nmodality of VFMs is naturally easier to disentangle, we introduce a novel\nframework for text feature-guided visual prompt tuning. This framework first\nautomatically disentangles the text prompt using a large language model (LLM)\nand then learns domain-invariant visual representation guided by the\ndisentangled text feature. However, relying solely on language to guide visual\nfeature disentanglement has limitations, as visual features can sometimes be\ntoo complex or nuanced to be fully captured by descriptive text. To address\nthis, we introduce Worst Explicit Representation Alignment (WERA), which\nextends text-guided visual prompts by incorporating an additional set of\nabstract prompts. These prompts enhance source domain diversity through\nstylized image augmentations, while alignment constraints ensure that visual\nrepresentations remain consistent across both the original and augmented\ndistributions. Experiments conducted on major DG datasets, including PACS,\nVLCS, OfficeHome, DomainNet, and TerraInc, demonstrate that our proposed method\noutperforms state-of-the-art DG methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02294", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02294", "abs": "https://arxiv.org/abs/2507.02294", "authors": ["Hanbo Bi", "Yulong Xu", "Ya Li", "Yongqiang Mao", "Boyuan Tong", "Chongyang Li", "Chunbo Lang", "Wenhui Diao", "Hongqi Wang", "Yingchao Feng", "Xian Sun"], "title": "ViRefSAM: Visual Reference-Guided Segment Anything Model for Remote Sensing Segmentation", "comment": null, "summary": "The Segment Anything Model (SAM), with its prompt-driven paradigm, exhibits\nstrong generalization in generic segmentation tasks. However, applying SAM to\nremote sensing (RS) images still faces two major challenges. First, manually\nconstructing precise prompts for each image (e.g., points or boxes) is\nlabor-intensive and inefficient, especially in RS scenarios with dense small\nobjects or spatially fragmented distributions. Second, SAM lacks domain\nadaptability, as it is pre-trained primarily on natural images and struggles to\ncapture RS-specific semantics and spatial characteristics, especially when\nsegmenting novel or unseen classes. To address these issues, inspired by\nfew-shot learning, we propose ViRefSAM, a novel framework that guides SAM\nutilizing only a few annotated reference images that contain class-specific\nobjects. Without requiring manual prompts, ViRefSAM enables automatic\nsegmentation of class-consistent objects across RS images. Specifically,\nViRefSAM introduces two key components while keeping SAM's original\narchitecture intact: (1) a Visual Contextual Prompt Encoder that extracts\nclass-specific semantic clues from reference images and generates object-aware\nprompts via contextual interaction with target images; and (2) a Dynamic Target\nAlignment Adapter, integrated into SAM's image encoder, which mitigates the\ndomain gap by injecting class-specific semantics into target image features,\nenabling SAM to dynamically focus on task-relevant regions. Extensive\nexperiments on three few-shot segmentation benchmarks, including iSAID-5$^i$,\nLoveDA-2$^i$, and COCO-20$^i$, demonstrate that ViRefSAM enables accurate and\nautomatic segmentation of unseen classes by leveraging only a few reference\nimages and consistently outperforms existing few-shot segmentation methods\nacross diverse datasets.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02256", "categories": ["cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2507.02256", "abs": "https://arxiv.org/abs/2507.02256", "authors": ["Yang Yang", "Xiaolu Zhou", "Bosong Ding", "Miao Xin"], "title": "Uncertainty-aware Reward Design Process", "comment": "34 pages, 9 figures", "summary": "Designing effective reward functions is a cornerstone of reinforcement\nlearning (RL), yet it remains a challenging process due to the inefficiencies\nand inconsistencies inherent in conventional reward engineering methodologies.\nRecent advances have explored leveraging large language models (LLMs) to\nautomate reward function design. However, their suboptimal performance in\nnumerical optimization often yields unsatisfactory reward quality, while the\nevolutionary search paradigm demonstrates inefficient utilization of simulation\nresources, resulting in prohibitively lengthy design cycles with\ndisproportionate computational overhead. To address these challenges, we\npropose the Uncertainty-aware Reward Design Process (URDP), a novel framework\nthat integrates large language models to streamline reward function design and\nevaluation in RL environments. URDP quantifies candidate reward function\nuncertainty based on self-consistency analysis, enabling simulation-free\nidentification of ineffective reward components while discovering novel reward\ncomponents. Furthermore, we introduce uncertainty-aware Bayesian optimization\n(UABO), which incorporates uncertainty estimation to significantly enhance\nhyperparameter configuration efficiency. Finally, we construct a bi-level\noptimization architecture by decoupling the reward component optimization and\nthe hyperparameter tuning. URDP orchestrates synergistic collaboration between\nthe reward logic reasoning of the LLMs and the numerical optimization strengths\nof the Bayesian Optimization. We conduct a comprehensive evaluation of URDP\nacross 35 diverse tasks spanning three benchmark environments. Our experimental\nresults demonstrate that URDP not only generates higher-quality reward\nfunctions but also achieves significant improvements in the efficiency of\nautomated reward design compared to existing approaches.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02225", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02225", "abs": "https://arxiv.org/abs/2507.02225", "authors": ["Jiyeon Bae", "Hyeon Jeon", "Jinwook Seo"], "title": "Metric Design != Metric Behavior: Improving Metric Selection for the Unbiased Evaluation of Dimensionality Reduction", "comment": "IEEE VIS 2025 (short paper)", "summary": "Evaluating the accuracy of dimensionality reduction (DR) projections in\npreserving the structure of high-dimensional data is crucial for reliable\nvisual analytics. Diverse evaluation metrics targeting different structural\ncharacteristics have thus been developed. However, evaluations of DR\nprojections can become biased if highly correlated metrics--those measuring\nsimilar structural characteristics--are inadvertently selected, favoring DR\ntechniques that emphasize those characteristics. To address this issue, we\npropose a novel workflow that reduces bias in the selection of evaluation\nmetrics by clustering metrics based on their empirical correlations rather than\non their intended design characteristics alone. Our workflow works by computing\nmetric similarity using pairwise correlations, clustering metrics to minimize\noverlap, and selecting a representative metric from each cluster. Quantitative\nexperiments demonstrate that our approach improves the stability of DR\nevaluation, which indicates that our workflow contributes to mitigating\nevaluation bias.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02311", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02311", "abs": "https://arxiv.org/abs/2507.02311", "authors": ["Le Xu", "Qi Zhang", "Qixian Zhang", "Hongyun Zhang", "Duoqian Miao", "Cairong Zhao"], "title": "Perception Activator: An intuitive and portable framework for brain cognitive exploration", "comment": null, "summary": "Recent advances in brain-vision decoding have driven significant progress,\nreconstructing with high fidelity perceived visual stimuli from neural\nactivity, e.g., functional magnetic resonance imaging (fMRI), in the human\nvisual cortex. Most existing methods decode the brain signal using a two-level\nstrategy, i.e., pixel-level and semantic-level. However, these methods rely\nheavily on low-level pixel alignment yet lack sufficient and fine-grained\nsemantic alignment, resulting in obvious reconstruction distortions of multiple\nsemantic objects. To better understand the brain's visual perception patterns\nand how current decoding models process semantic objects, we have developed an\nexperimental framework that uses fMRI representations as intervention\nconditions. By injecting these representations into multi-scale image features\nvia cross-attention, we compare both downstream performance and intermediate\nfeature changes on object detection and instance segmentation tasks with and\nwithout fMRI information. Our results demonstrate that incorporating fMRI\nsignals enhances the accuracy of downstream detection and segmentation,\nconfirming that fMRI contains rich multi-object semantic cues and coarse\nspatial localization information-elements that current models have yet to fully\nexploit or integrate.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02241", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02241", "abs": "https://arxiv.org/abs/2507.02241", "authors": ["Shravan Doda", "Shashidhar Reddy Javaji", "Zining Zhu"], "title": "VERBA: Verbalizing Model Differences Using Large Language Models", "comment": null, "summary": "In the current machine learning landscape, we face a \"model lake\" phenomenon:\nGiven a task, there is a proliferation of trained models with similar\nperformances despite different behavior. For model users attempting to navigate\nand select from the models, documentation comparing model pairs is helpful.\nHowever, for every $N$ models there could be $O(N^2)$ pairwise comparisons, a\nnumber prohibitive for the model developers to manually perform pairwise\ncomparisons and prepare documentations. To facilitate fine-grained pairwise\ncomparisons among models, we introduced $\\textbf{VERBA}$. Our approach\nleverages a large language model (LLM) to generate verbalizations of model\ndifferences by sampling from the two models. We established a protocol that\nevaluates the informativeness of the verbalizations via simulation. We also\nassembled a suite with a diverse set of commonly used machine learning models\nas a benchmark. For a pair of decision tree models with up to 5% performance\ndifference but 20-25% behavioral differences, $\\textbf{VERBA}$ effectively\nverbalizes their variations with up to 80% overall accuracy. When we included\nthe models' structural information, the verbalization's accuracy further\nimproved to 90%. $\\textbf{VERBA}$ opens up new research avenues for improving\nthe transparency and comparability of machine learning models in a post-hoc\nmanner.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "fine-grained"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02314", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02314", "abs": "https://arxiv.org/abs/2507.02314", "authors": ["JaeHyuck Choi", "MinJun Kim", "JeHyeong Hong"], "title": "MAGIC: Mask-Guided Diffusion Inpainting with Multi-Level Perturbations and Context-Aware Alignment for Few-Shot Anomaly Generation", "comment": "10 pages, 6 figures", "summary": "Few-shot anomaly generation is emerging as a practical solution for\naugmenting the scarce anomaly data in industrial quality control settings. An\nideal generator would meet three demands at once, namely (i) keep the normal\nbackground intact, (ii) inpaint anomalous regions to tightly overlap with the\ncorresponding anomaly masks, and (iii) generate anomalous regions in a\nsemantically valid location, while still producing realistic, diverse\nappearances from only a handful of real examples. Existing diffusion-based\nmethods usually satisfy at most two of these requirements: global anomaly\ngenerators corrupt the background, whereas mask-guided ones often falter when\nthe mask is imprecise or misplaced. We propose MAGIC--Mask-guided inpainting\nwith multi-level perturbations and Context-aware alignment--to resolve all\nthree issues. At its core, MAGIC fine-tunes a Stable Diffusion inpainting\nbackbone that preserves normal regions and ensures strict adherence of the\nsynthesized anomaly to the supplied mask, directly addressing background\ncorruption and misalignment. To offset the diversity loss that fine-tuning can\ncause, MAGIC adds two complementary perturbation strategies: (i) Gaussian\nprompt-level perturbation applied during fine-tuning and inference that\nbroadens the global appearance of anomalies while avoiding low-fidelity textual\nappearances, and (ii) mask-guided spatial noise injection that enriches local\ntexture variations. Additionally, the context-aware mask alignment module forms\nsemantic correspondences and relocates masks so that every anomaly remains\nplausibly contained within the host object, eliminating out-of-boundary\nartifacts. Under a consistent identical evaluation protocol on the MVTec-AD\ndataset, MAGIC outperforms previous state-of-the-arts in downstream anomaly\ntasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02316", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02316", "abs": "https://arxiv.org/abs/2507.02316", "authors": ["Zecheng Zhao", "Selena Song", "Tong Chen", "Zhi Chen", "Shazia Sadiq", "Yadan Luo"], "title": "Are Synthetic Videos Useful? A Benchmark for Retrieval-Centric Evaluation of Synthetic Videos", "comment": "7 pages, 10 figures", "summary": "Text-to-video (T2V) synthesis has advanced rapidly, yet current evaluation\nmetrics primarily capture visual quality and temporal consistency, offering\nlimited insight into how synthetic videos perform in downstream tasks such as\ntext-to-video retrieval (TVR). In this work, we introduce SynTVA, a new dataset\nand benchmark designed to evaluate the utility of synthetic videos for building\nretrieval models. Based on 800 diverse user queries derived from MSRVTT\ntraining split, we generate synthetic videos using state-of-the-art T2V models\nand annotate each video-text pair along four key semantic alignment dimensions:\nObject \\& Scene, Action, Attribute, and Prompt Fidelity. Our evaluation\nframework correlates general video quality assessment (VQA) metrics with these\nalignment scores, and examines their predictive power for downstream TVR\nperformance. To explore pathways of scaling up, we further develop an\nAuto-Evaluator to estimate alignment quality from existing metrics. Beyond\nbenchmarking, our results show that SynTVA is a valuable asset for dataset\naugmentation, enabling the selection of high-utility synthetic samples that\nmeasurably improve TVR outcomes. Project page and dataset can be found at\nhttps://jasoncodemaker.github.io/SynTVA/.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "consistency"], "score": 4}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02256", "categories": ["cs.LG", "cs.RO"], "pdf": "https://arxiv.org/pdf/2507.02256", "abs": "https://arxiv.org/abs/2507.02256", "authors": ["Yang Yang", "Xiaolu Zhou", "Bosong Ding", "Miao Xin"], "title": "Uncertainty-aware Reward Design Process", "comment": "34 pages, 9 figures", "summary": "Designing effective reward functions is a cornerstone of reinforcement\nlearning (RL), yet it remains a challenging process due to the inefficiencies\nand inconsistencies inherent in conventional reward engineering methodologies.\nRecent advances have explored leveraging large language models (LLMs) to\nautomate reward function design. However, their suboptimal performance in\nnumerical optimization often yields unsatisfactory reward quality, while the\nevolutionary search paradigm demonstrates inefficient utilization of simulation\nresources, resulting in prohibitively lengthy design cycles with\ndisproportionate computational overhead. To address these challenges, we\npropose the Uncertainty-aware Reward Design Process (URDP), a novel framework\nthat integrates large language models to streamline reward function design and\nevaluation in RL environments. URDP quantifies candidate reward function\nuncertainty based on self-consistency analysis, enabling simulation-free\nidentification of ineffective reward components while discovering novel reward\ncomponents. Furthermore, we introduce uncertainty-aware Bayesian optimization\n(UABO), which incorporates uncertainty estimation to significantly enhance\nhyperparameter configuration efficiency. Finally, we construct a bi-level\noptimization architecture by decoupling the reward component optimization and\nthe hyperparameter tuning. URDP orchestrates synergistic collaboration between\nthe reward logic reasoning of the LLMs and the numerical optimization strengths\nof the Bayesian Optimization. We conduct a comprehensive evaluation of URDP\nacross 35 diverse tasks spanning three benchmark environments. Our experimental\nresults demonstrate that URDP not only generates higher-quality reward\nfunctions but also achieves significant improvements in the efficiency of\nautomated reward design compared to existing approaches.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02321", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02321", "abs": "https://arxiv.org/abs/2507.02321", "authors": ["Nina Konovalova", "Maxim Nikolaev", "Andrey Kuznetsov", "Aibek Alanov"], "title": "Heeding the Inner Voice: Aligning ControlNet Training via Intermediate Features Feedback", "comment": "code available at https://github.com/ControlGenAI/InnerControl", "summary": "Despite significant progress in text-to-image diffusion models, achieving\nprecise spatial control over generated outputs remains challenging. ControlNet\naddresses this by introducing an auxiliary conditioning module, while\nControlNet++ further refines alignment through a cycle consistency loss applied\nonly to the final denoising steps. However, this approach neglects intermediate\ngeneration stages, limiting its effectiveness. We propose InnerControl, a\ntraining strategy that enforces spatial consistency across all diffusion steps.\nOur method trains lightweight convolutional probes to reconstruct input control\nsignals (e.g., edges, depth) from intermediate UNet features at every denoising\nstep. These probes efficiently extract signals even from highly noisy latents,\nenabling pseudo ground truth controls for training. By minimizing the\ndiscrepancy between predicted and target conditions throughout the entire\ndiffusion process, our alignment loss improves both control fidelity and\ngeneration quality. Combined with established techniques like ControlNet++,\nInnerControl achieves state-of-the-art performance across diverse conditioning\nmethods (e.g., edges, depth).", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02358", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02358", "abs": "https://arxiv.org/abs/2507.02358", "authors": ["Anlin Zheng", "Haochen Wang", "Yucheng Zhao", "Weipeng Deng", "Tiancai Wang", "Xiangyu Zhang", "Xiaojuan Qi"], "title": "Holistic Tokenizer for Autoregressive Image Generation", "comment": "17 pages, 10 figures", "summary": "The vanilla autoregressive image generation model generates visual tokens in\na step-by-step fashion, which limits the ability to capture holistic\nrelationships among token sequences. Moreover, most visual tokenizers map local\nimage patches into latent tokens, leading to limited global information. To\naddress this, we introduce \\textit{Hita}, a novel image tokenizer for\nautoregressive (AR) image generation. It introduces a holistic-to-local\ntokenization scheme with learnable holistic queries and local patch tokens.\nBesides, Hita incorporates two key strategies for improved alignment with the\nAR generation process: 1) it arranges a sequential structure with holistic\ntokens at the beginning followed by patch-level tokens while using causal\nattention to maintain awareness of previous tokens; and 2) before feeding the\nde-quantized tokens into the decoder, Hita adopts a lightweight fusion module\nto control information flow to prioritize holistic tokens. Extensive\nexperiments show that Hita accelerates the training speed of AR generators and\noutperforms those trained with vanilla tokenizers, achieving \\textbf{2.59 FID}\nand \\textbf{281.9 IS} on the ImageNet benchmark. A detailed analysis of the\nholistic representation highlights its ability to capture global image\nproperties such as textures, materials, and shapes. Additionally, Hita also\ndemonstrates effectiveness in zero-shot style transfer and image in-painting.\nThe code is available at\n\\href{https://github.com/CVMI-Lab/Hita}{https://github.com/CVMI-Lab/Hita}", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02356", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02356", "abs": "https://arxiv.org/abs/2507.02356", "authors": ["JunHyeok Oh", "Byung-Jun Lee"], "title": "Offline Reinforcement Learning with Penalized Action Noise Injection", "comment": null, "summary": "Offline reinforcement learning (RL) optimizes a policy using only a fixed\ndataset, making it a practical approach in scenarios where interaction with the\nenvironment is costly. Due to this limitation, generalization ability is key to\nimproving the performance of offline RL algorithms, as demonstrated by recent\nsuccesses of offline RL with diffusion models. However, it remains questionable\nwhether such diffusion models are necessary for highly performing offline RL\nalgorithms, given their significant computational requirements during\ninference. In this paper, we propose Penalized Action Noise Injection (PANI), a\nmethod that simply enhances offline learning by utilizing noise-injected\nactions to cover the entire action space, while penalizing according to the\namount of noise injected. This approach is inspired by how diffusion models\nhave worked in offline RL algorithms. We provide a theoretical foundation for\nthis method, showing that offline RL algorithms with such noise-injected\nactions solve a modified Markov Decision Process (MDP), which we call the noisy\naction MDP. PANI is compatible with a wide range of existing off-policy and\noffline RL algorithms, and despite its simplicity, it demonstrates significant\nperformance improvements across various benchmarks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02373", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02373", "abs": "https://arxiv.org/abs/2507.02373", "authors": ["Xizhe Xue", "Yang Zhou", "Dawei Yan", "Ying Li", "Haokui Zhang", "Rong Xiao"], "title": "UVLM: Benchmarking Video Language Model for Underwater World Understanding", "comment": "13 pages, 4 figures, 3 tables", "summary": "Recently, the remarkable success of large language models (LLMs) has achieved\na profound impact on the field of artificial intelligence. Numerous advanced\nworks based on LLMs have been proposed and applied in various scenarios. Among\nthem, video language models (VidLMs) are particularly widely used. However,\nexisting works primarily focus on terrestrial scenarios, overlooking the highly\ndemanding application needs of underwater observation. To overcome this gap, we\nintroduce UVLM, an under water observation benchmark which is build through a\ncollaborative approach combining human expertise and AI models. To ensure data\nquality, we have conducted in-depth considerations from multiple perspectives.\nFirst, to address the unique challenges of underwater environments, we selected\nvideos that represent typical underwater challenges including light variations,\nwater turbidity, and diverse viewing angles to construct the dataset. Second,\nto ensure data diversity, the dataset covers a wide range of frame rates,\nresolutions, 419 classes of marine animals, and various static plants and\nterrains. Next, for task diversity, we adopted a structured design where\nobservation targets are categorized into two major classes: biological and\nenvironmental. Each category includes content observation and change/action\nobservation, totaling 20 distinct task types. Finally, we designed several\nchallenging evaluation metrics to enable quantitative comparison and analysis\nof different methods. Experiments on two representative VidLMs demonstrate that\nfine-tuning VidLMs on UVLM significantly improves underwater world\nunderstanding while also showing potential for slight improvements on existing\nin-air VidLM benchmarks, such as VideoMME and Perception text. The dataset and\nprompt engineering will be released publicly.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02365", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02365", "abs": "https://arxiv.org/abs/2507.02365", "authors": ["Muhammad Usama", "Dong Eui Chang"], "title": "Deep Reinforcement Learning-Based DRAM Equalizer Parameter Optimization Using Latent Representations", "comment": null, "summary": "Equalizer parameter optimization for signal integrity in high-speed Dynamic\nRandom Access Memory systems is crucial but often computationally demanding or\nmodel-reliant. This paper introduces a data-driven framework employing learned\nlatent signal representations for efficient signal integrity evaluation,\ncoupled with a model-free Advantage Actor-Critic reinforcement learning agent\nfor parameter optimization. The latent representation captures vital signal\nintegrity features, offering a fast alternative to direct eye diagram analysis\nduring optimization, while the reinforcement learning agent derives optimal\nequalizer settings without explicit system models. Applied to industry-standard\nDynamic Random Access Memory waveforms, the method achieved significant\neye-opening window area improvements: 42.7\\% for cascaded Continuous-Time\nLinear Equalizer and Decision Feedback Equalizer structures, and 36.8\\% for\nDecision Feedback Equalizer-only configurations. These results demonstrate\nsuperior performance, computational efficiency, and robust generalization\nacross diverse Dynamic Random Access Memory units compared to existing\ntechniques. Core contributions include an efficient latent signal integrity\nmetric for optimization, a robust model-free reinforcement learning strategy,\nand validated superior performance for complex equalizer architectures.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02406", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02406", "abs": "https://arxiv.org/abs/2507.02406", "authors": ["Caio Azevedo", "Lina Achaji", "Stefano Sabatini", "Nicola Poerio", "Grzegorz Bartyzel", "Sascha Hornauer", "Fabien Moutarde"], "title": "Improving Consistency in Vehicle Trajectory Prediction Through Preference Optimization", "comment": "Accepted for publication at ITSC 2025", "summary": "Trajectory prediction is an essential step in the pipeline of an autonomous\nvehicle. Inaccurate or inconsistent predictions regarding the movement of\nagents in its surroundings lead to poorly planned maneuvers and potentially\ndangerous situations for the end-user. Current state-of-the-art\ndeep-learning-based trajectory prediction models can achieve excellent accuracy\non public datasets. However, when used in more complex, interactive scenarios,\nthey often fail to capture important interdependencies between agents, leading\nto inconsistent predictions among agents in the traffic scene. Inspired by the\nefficacy of incorporating human preference into large language models, this\nwork fine-tunes trajectory prediction models in multi-agent settings using\npreference optimization. By taking as input automatically calculated preference\nrankings among predicted futures in the fine-tuning process, our\nexperiments--using state-of-the-art models on three separate datasets--show\nthat we are able to significantly improve scene consistency while minimally\nsacrificing trajectory prediction accuracy and without adding any excess\ncomputational requirements at inference time.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02409", "categories": ["cs.LG", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.02409", "abs": "https://arxiv.org/abs/2507.02409", "authors": ["Zihan Tan", "Suyuan Huang", "Guancheng Wan", "Wenke Huang", "He Li", "Mang Ye"], "title": "S2FGL: Spatial Spectral Federated Graph Learning", "comment": null, "summary": "Federated Graph Learning (FGL) combines the privacy-preserving capabilities\nof federated learning (FL) with the strong graph modeling capability of Graph\nNeural Networks (GNNs). Current research addresses subgraph-FL only from the\nstructural perspective, neglecting the propagation of graph signals on spatial\nand spectral domains of the structure. From a spatial perspective, subgraph-FL\nintroduces edge disconnections between clients, leading to disruptions in label\nsignals and a degradation in the class knowledge of the global GNN. From a\nspectral perspective, spectral heterogeneity causes inconsistencies in signal\nfrequencies across subgraphs, which makes local GNNs overfit the local signal\npropagation schemes. As a result, spectral client drifts occur, undermining\nglobal generalizability. To tackle the challenges, we propose a global\nknowledge repository to mitigate label signal disruption and a frequency\nalignment to address spectral client drifts. The combination of spatial and\nspectral strategies forms our framework S2FGL. Extensive experiments on\nmultiple datasets demonstrate the superiority of S2FGL. The code is available\nat https://github.com/Wonder7racer/S2FGL.git.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02488", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02488", "abs": "https://arxiv.org/abs/2507.02488", "authors": ["Zunhui Xia", "Hongxing Li", "Libin Lan"], "title": "MedFormer: Hierarchical Medical Vision Transformer with Content-Aware Dual Sparse Selection Attention", "comment": "13 pages, 9 figures, 9 tables", "summary": "Medical image recognition serves as a key way to aid in clinical diagnosis,\nenabling more accurate and timely identification of diseases and abnormalities.\nVision transformer-based approaches have proven effective in handling various\nmedical recognition tasks. However, these methods encounter two primary\nchallenges. First, they are often task-specific and architecture-tailored,\nlimiting their general applicability. Second, they usually either adopt full\nattention to model long-range dependencies, resulting in high computational\ncosts, or rely on handcrafted sparse attention, potentially leading to\nsuboptimal performance. To tackle these issues, we present MedFormer, an\nefficient medical vision transformer with two key ideas. First, it employs a\npyramid scaling structure as a versatile backbone for various medical image\nrecognition tasks, including image classification and dense prediction tasks\nsuch as semantic segmentation and lesion detection. This structure facilitates\nhierarchical feature representation while reducing the computation load of\nfeature maps, highly beneficial for boosting performance. Second, it introduces\na novel Dual Sparse Selection Attention (DSSA) with content awareness to\nimprove computational efficiency and robustness against noise while maintaining\nhigh performance. As the core building technique of MedFormer, DSSA is\nexplicitly designed to attend to the most relevant content. In addition, a\ndetailed theoretical analysis has been conducted, demonstrating that MedFormer\nhas superior generality and efficiency in comparison to existing medical vision\ntransformers. Extensive experiments on a variety of imaging modality datasets\nconsistently show that MedFormer is highly effective in enhancing performance\nacross all three above-mentioned medical image recognition tasks. The code is\navailable at https://github.com/XiaZunhui/MedFormer.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02639", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02639", "abs": "https://arxiv.org/abs/2507.02639", "authors": ["Alberto Caron", "Chris Hicks", "Vasilios Mavroudis"], "title": "On Efficient Bayesian Exploration in Model-Based Reinforcement Learning", "comment": null, "summary": "In this work, we address the challenge of data-efficient exploration in\nreinforcement learning by examining existing principled, information-theoretic\napproaches to intrinsic motivation. Specifically, we focus on a class of\nexploration bonuses that targets epistemic uncertainty rather than the\naleatoric noise inherent in the environment. We prove that these bonuses\nnaturally signal epistemic information gains and converge to zero once the\nagent becomes sufficiently certain about the environment's dynamics and\nrewards, thereby aligning exploration with genuine knowledge gaps. Our analysis\nprovides formal guarantees for IG-based approaches, which previously lacked\ntheoretical grounding. To enable practical use, we also discuss tractable\napproximations via sparse variational Gaussian Processes, Deep Kernels and Deep\nEnsemble models. We then outline a general framework - Predictive Trajectory\nSampling with Bayesian Exploration (PTS-BE) - which integrates model-based\nplanning with information-theoretic bonuses to achieve sample-efficient deep\nexploration. We empirically demonstrate that PTS-BE substantially outperforms\nother baselines across a variety of environments characterized by sparse\nrewards and/or purely exploratory tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02645", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02645", "abs": "https://arxiv.org/abs/2507.02645", "authors": ["Harry Cheng", "Ming-Hui Liu", "Yangyang Guo", "Tianyi Wang", "Liqiang Nie", "Mohan Kankanhalli"], "title": "Fair Deepfake Detectors Can Generalize", "comment": "14 pages, version 1", "summary": "Deepfake detection models face two critical challenges: generalization to\nunseen manipulations and demographic fairness among population groups. However,\nexisting approaches often demonstrate that these two objectives are inherently\nconflicting, revealing a trade-off between them. In this paper, we, for the\nfirst time, uncover and formally define a causal relationship between fairness\nand generalization. Building on the back-door adjustment, we show that\ncontrolling for confounders (data distribution and model capacity) enables\nimproved generalization via fairness interventions. Motivated by this insight,\nwe propose Demographic Attribute-insensitive Intervention Detection (DAID), a\nplug-and-play framework composed of: i) Demographic-aware data rebalancing,\nwhich employs inverse-propensity weighting and subgroup-wise feature\nnormalization to neutralize distributional biases; and ii) Demographic-agnostic\nfeature aggregation, which uses a novel alignment loss to suppress\nsensitive-attribute signals. Across three cross-domain benchmarks, DAID\nconsistently achieves superior performance in both fairness and generalization\ncompared to several state-of-the-art detectors, validating both its theoretical\nfoundation and practical effectiveness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02698", "categories": ["cs.LG", "econ.EM"], "pdf": "https://arxiv.org/pdf/2507.02698", "abs": "https://arxiv.org/abs/2507.02698", "authors": ["Thomas Hazenberg", "Yao Ma", "Seyed Sahand Mohammadi Ziabari", "Marijn van Rijswijk"], "title": "Multi-Agent Reinforcement Learning for Dynamic Pricing in Supply Chains: Benchmarking Strategic Agent Behaviours under Realistically Simulated Market Conditions", "comment": null, "summary": "This study investigates how Multi-Agent Reinforcement Learning (MARL) can\nimprove dynamic pricing strategies in supply chains, particularly in contexts\nwhere traditional ERP systems rely on static, rule-based approaches that\noverlook strategic interactions among market actors. While recent research has\napplied reinforcement learning to pricing, most implementations remain\nsingle-agent and fail to model the interdependent nature of real-world supply\nchains. This study addresses that gap by evaluating the performance of three\nMARL algorithms: MADDPG, MADQN, and QMIX against static rule-based baselines,\nwithin a simulated environment informed by real e-commerce transaction data and\na LightGBM demand prediction model. Results show that rule-based agents achieve\nnear-perfect fairness (Jain's Index: 0.9896) and the highest price stability\n(volatility: 0.024), but they fully lack competitive dynamics. Among MARL\nagents, MADQN exhibits the most aggressive pricing behaviour, with the highest\nvolatility and the lowest fairness (0.5844). MADDPG provides a more balanced\napproach, supporting market competition (share volatility: 9.5 pp) while\nmaintaining relatively high fairness (0.8819) and stable pricing. These\nfindings suggest that MARL introduces emergent strategic behaviour not captured\nby static pricing rules and may inform future developments in dynamic pricing.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02712", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02712", "abs": "https://arxiv.org/abs/2507.02712", "authors": ["Zilin Kang", "Chenyuan Hu", "Yu Luo", "Zhecheng Yuan", "Ruijie Zheng", "Huazhe Xu"], "title": "A Forget-and-Grow Strategy for Deep Reinforcement Learning Scaling in Continuous Control", "comment": null, "summary": "Deep reinforcement learning for continuous control has recently achieved\nimpressive progress. However, existing methods often suffer from primacy bias,\na tendency to overfit early experiences stored in the replay buffer, which\nlimits an RL agent's sample efficiency and generalizability. In contrast,\nhumans are less susceptible to such bias, partly due to infantile amnesia,\nwhere the formation of new neurons disrupts early memory traces, leading to the\nforgetting of initial experiences. Inspired by this dual processes of\nforgetting and growing in neuroscience, in this paper, we propose Forget and\nGrow (FoG), a new deep RL algorithm with two mechanisms introduced. First,\nExperience Replay Decay (ER Decay) \"forgetting early experience\", which\nbalances memory by gradually reducing the influence of early experiences.\nSecond, Network Expansion, \"growing neural capacity\", which enhances agents'\ncapability to exploit the patterns of existing data by dynamically adding new\nparameters during training. Empirical results on four major continuous control\nbenchmarks with more than 40 tasks demonstrate the superior performance of FoG\nagainst SoTA existing deep RL algorithms, including BRO, SimBa, and TD-MPC2.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02664", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02664", "abs": "https://arxiv.org/abs/2507.02664", "authors": ["Ziyin Zhou", "Yunpeng Luo", "Yuanchen Wu", "Ke Sun", "Jiayi Ji", "Ke Yan", "Shouhong Ding", "Xiaoshuai Sun", "Yunsheng Wu", "Rongrong Ji"], "title": "AIGI-Holmes: Towards Explainable and Generalizable AI-Generated Image Detection via Multimodal Large Language Models", "comment": "Accepted to ICCV 2025", "summary": "The rapid development of AI-generated content (AIGC) technology has led to\nthe misuse of highly realistic AI-generated images (AIGI) in spreading\nmisinformation, posing a threat to public information security. Although\nexisting AIGI detection techniques are generally effective, they face two\nissues: 1) a lack of human-verifiable explanations, and 2) a lack of\ngeneralization in the latest generation technology. To address these issues, we\nintroduce a large-scale and comprehensive dataset, Holmes-Set, which includes\nthe Holmes-SFTSet, an instruction-tuning dataset with explanations on whether\nimages are AI-generated, and the Holmes-DPOSet, a human-aligned preference\ndataset. Our work introduces an efficient data annotation method called the\nMulti-Expert Jury, enhancing data generation through structured MLLM\nexplanations and quality control via cross-model evaluation, expert defect\nfiltering, and human preference modification. In addition, we propose Holmes\nPipeline, a meticulously designed three-stage training framework comprising\nvisual expert pre-training, supervised fine-tuning, and direct preference\noptimization. Holmes Pipeline adapts multimodal large language models (MLLMs)\nfor AIGI detection while generating human-verifiable and human-aligned\nexplanations, ultimately yielding our model AIGI-Holmes. During the inference\nstage, we introduce a collaborative decoding strategy that integrates the model\nperception of the visual expert with the semantic reasoning of MLLMs, further\nenhancing the generalization capabilities. Extensive experiments on three\nbenchmarks validate the effectiveness of our AIGI-Holmes.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "human preference", "annotation"], "score": 4}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02687", "categories": ["cs.CV", "cs.AI", "60J60, 68T07", "I.2.6; I.2.10; I.4.9"], "pdf": "https://arxiv.org/pdf/2507.02687", "abs": "https://arxiv.org/abs/2507.02687", "authors": ["JungWoo Chae", "Jiyoon Kim", "JaeWoong Choi", "Kyungyul Kim", "Sangheum Hwang"], "title": "APT: Adaptive Personalized Training for Diffusion Models with Limited Data", "comment": "CVPR 2025 camera ready. Project page: https://lgcnsai.github.io/apt", "summary": "Personalizing diffusion models using limited data presents significant\nchallenges, including overfitting, loss of prior knowledge, and degradation of\ntext alignment. Overfitting leads to shifts in the noise prediction\ndistribution, disrupting the denoising trajectory and causing the model to lose\nsemantic coherence. In this paper, we propose Adaptive Personalized Training\n(APT), a novel framework that mitigates overfitting by employing adaptive\ntraining strategies and regularizing the model's internal representations\nduring fine-tuning. APT consists of three key components: (1) Adaptive Training\nAdjustment, which introduces an overfitting indicator to detect the degree of\noverfitting at each time step bin and applies adaptive data augmentation and\nadaptive loss weighting based on this indicator; (2)Representation\nStabilization, which regularizes the mean and variance of intermediate feature\nmaps to prevent excessive shifts in noise prediction; and (3) Attention\nAlignment for Prior Knowledge Preservation, which aligns the cross-attention\nmaps of the fine-tuned model with those of the pretrained model to maintain\nprior knowledge and semantic coherence. Through extensive experiments, we\ndemonstrate that APT effectively mitigates overfitting, preserves prior\nknowledge, and outperforms existing methods in generating high-quality, diverse\nimages with limited reference data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02705", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02705", "abs": "https://arxiv.org/abs/2507.02705", "authors": ["Qi Xu", "Dongxu Wei", "Lingzhe Zhao", "Wenpu Li", "Zhangchi Huang", "Shunping Ji", "Peidong Liu"], "title": "SIU3R: Simultaneous Scene Understanding and 3D Reconstruction Beyond Feature Alignment", "comment": null, "summary": "Simultaneous understanding and 3D reconstruction plays an important role in\ndeveloping end-to-end embodied intelligent systems. To achieve this, recent\napproaches resort to 2D-to-3D feature alignment paradigm, which leads to\nlimited 3D understanding capability and potential semantic information loss. In\nlight of this, we propose SIU3R, the first alignment-free framework for\ngeneralizable simultaneous understanding and 3D reconstruction from unposed\nimages. Specifically, SIU3R bridges reconstruction and understanding tasks via\npixel-aligned 3D representation, and unifies multiple understanding tasks into\na set of unified learnable queries, enabling native 3D understanding without\nthe need of alignment with 2D models. To encourage collaboration between the\ntwo tasks with shared representation, we further conduct in-depth analyses of\ntheir mutual benefits, and propose two lightweight modules to facilitate their\ninteraction. Extensive experiments demonstrate that our method achieves\nstate-of-the-art performance not only on the individual tasks of 3D\nreconstruction and understanding, but also on the task of simultaneous\nunderstanding and 3D reconstruction, highlighting the advantages of our\nalignment-free framework and the effectiveness of the mutual benefit designs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02847", "categories": ["cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02847", "abs": "https://arxiv.org/abs/2507.02847", "authors": ["Kunyu Zhang", "Qiang Li", "Shujian Yu"], "title": "MvHo-IB: Multi-View Higher-Order Information Bottleneck for Brain Disorder Diagnosis", "comment": "Accepted by MICCAI-25, code is available at\n  \\url{https://github.com/zky04/MvHo-IB}", "summary": "Recent evidence suggests that modeling higher-order interactions (HOIs) in\nfunctional magnetic resonance imaging (fMRI) data can enhance the diagnostic\naccuracy of machine learning systems. However, effectively extracting and\nutilizing HOIs remains a significant challenge. In this work, we propose\nMvHo-IB, a novel multi-view learning framework that integrates both pairwise\ninteractions and HOIs for diagnostic decision-making, while automatically\ncompressing task-irrelevant redundant information. MvHo-IB introduces several\nkey innovations: (1) a principled method that combines O-information from\ninformation theory with a matrix-based Renyi alpha-order entropy estimator to\nquantify and extract HOIs, (2) a purpose-built Brain3DCNN encoder to\neffectively utilize these interactions, and (3) a new multi-view learning\ninformation bottleneck objective to enhance representation learning.\nExperiments on three benchmark fMRI datasets demonstrate that MvHo-IB achieves\nstate-of-the-art performance, significantly outperforming previous methods,\nincluding recent hypergraph-based techniques. The implementation of MvHo-IB is\navailable at https://github.com/zky04/MvHo-IB.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02212", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02212", "abs": "https://arxiv.org/abs/2507.02212", "authors": ["Takuro Kawada", "Shunsuke Kitada", "Sota Nemoto", "Hitoshi Iyatomi"], "title": "SciGA: A Comprehensive Dataset for Designing Graphical Abstracts in Academic Papers", "comment": "21 pages, 15 figures, 4 tables. Project Page:\n  https://iyatomilab.github.io/SciGA/", "summary": "Graphical Abstracts (GAs) play a crucial role in visually conveying the key\nfindings of scientific papers. While recent research has increasingly\nincorporated visual materials such as Figure 1 as de facto GAs, their potential\nto enhance scientific communication remains largely unexplored. Moreover,\ndesigning effective GAs requires advanced visualization skills, creating a\nbarrier to their widespread adoption. To tackle these challenges, we introduce\nSciGA-145k, a large-scale dataset comprising approximately 145,000 scientific\npapers and 1.14 million figures, explicitly designed for supporting GA\nselection and recommendation as well as facilitating research in automated GA\ngeneration. As a preliminary step toward GA design support, we define two\ntasks: 1) Intra-GA recommendation, which identifies figures within a given\npaper that are well-suited to serve as GAs, and 2) Inter-GA recommendation,\nwhich retrieves GAs from other papers to inspire the creation of new GAs. We\nprovide reasonable baseline models for these tasks. Furthermore, we propose\nConfidence Adjusted top-1 ground truth Ratio (CAR), a novel recommendation\nmetric that offers a fine-grained analysis of model behavior. CAR addresses\nlimitations in traditional ranking-based metrics by considering cases where\nmultiple figures within a paper, beyond the explicitly labeled GA, may also\nserve as GAs. By unifying these tasks and metrics, our SciGA-145k establishes a\nfoundation for advancing visual scientific communication while contributing to\nthe development of AI for Science.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02792", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02792", "abs": "https://arxiv.org/abs/2507.02792", "authors": ["Liheng Zhang", "Lexi Pang", "Hang Ye", "Xiaoxuan Ma", "Yizhou Wang"], "title": "RichControl: Structure- and Appearance-Rich Training-Free Spatial Control for Text-to-Image Generation", "comment": null, "summary": "Text-to-image (T2I) diffusion models have shown remarkable success in\ngenerating high-quality images from text prompts. Recent efforts extend these\nmodels to incorporate conditional images (e.g., depth or pose maps) for\nfine-grained spatial control. Among them, feature injection methods have\nemerged as a training-free alternative to traditional fine-tuning approaches.\nHowever, they often suffer from structural misalignment, condition leakage, and\nvisual artifacts, especially when the condition image diverges significantly\nfrom natural RGB distributions. By revisiting existing methods, we identify a\ncore limitation: the synchronous injection of condition features fails to\naccount for the trade-off between domain alignment and structural preservation\nduring denoising. Inspired by this observation, we propose a flexible feature\ninjection framework that decouples the injection timestep from the denoising\nprocess. At its core is a structure-rich injection module, which enables the\nmodel to better adapt to the evolving interplay between alignment and structure\npreservation throughout the diffusion steps, resulting in more faithful\nstructural generation. In addition, we introduce appearance-rich prompting and\na restart refinement strategy to further enhance appearance control and visual\nquality. Together, these designs enable training-free generation that is both\nstructure-rich and appearance-rich. Extensive experiments show that our\napproach achieves state-of-the-art performance across diverse zero-shot\nconditioning scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02288", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.02288", "abs": "https://arxiv.org/abs/2507.02288", "authors": ["De Cheng", "Zhipeng Xu", "Xinyang Jiang", "Dongsheng Li", "Nannan Wang", "Xinbo Gao"], "title": "Prompt Disentanglement via Language Guidance and Representation Alignment for Domain Generalization", "comment": null, "summary": "Domain Generalization (DG) seeks to develop a versatile model capable of\nperforming effectively on unseen target domains. Notably, recent advances in\npre-trained Visual Foundation Models (VFMs), such as CLIP, have demonstrated\nconsiderable potential in enhancing the generalization capabilities of deep\nlearning models. Despite the increasing attention toward VFM-based domain\nprompt tuning within DG, the effective design of prompts capable of\ndisentangling invariant features across diverse domains remains a critical\nchallenge. In this paper, we propose addressing this challenge by leveraging\nthe controllable and flexible language prompt of the VFM. Noting that the text\nmodality of VFMs is naturally easier to disentangle, we introduce a novel\nframework for text feature-guided visual prompt tuning. This framework first\nautomatically disentangles the text prompt using a large language model (LLM)\nand then learns domain-invariant visual representation guided by the\ndisentangled text feature. However, relying solely on language to guide visual\nfeature disentanglement has limitations, as visual features can sometimes be\ntoo complex or nuanced to be fully captured by descriptive text. To address\nthis, we introduce Worst Explicit Representation Alignment (WERA), which\nextends text-guided visual prompts by incorporating an additional set of\nabstract prompts. These prompts enhance source domain diversity through\nstylized image augmentations, while alignment constraints ensure that visual\nrepresentations remain consistent across both the original and augmented\ndistributions. Experiments conducted on major DG datasets, including PACS,\nVLCS, OfficeHome, DomainNet, and TerraInc, demonstrate that our proposed method\noutperforms state-of-the-art DG methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02826", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02826", "abs": "https://arxiv.org/abs/2507.02826", "authors": ["Panpan Ji", "Junni Song", "Hang Xiao", "Hanyu Liu", "Chao Li"], "title": "Confidence-driven Gradient Modulation for Multimodal Human Activity Recognition: A Dynamic Contrastive Dual-Path Learning Approach", "comment": null, "summary": "Sensor-based Human Activity Recognition (HAR) is a core technology that\nenables intelligent systems to perceive and interact with their environment.\nHowever, multimodal HAR systems still encounter key challenges, such as\ndifficulties in cross-modal feature alignment and imbalanced modality\ncontributions. To address these issues, we propose a novel framework called the\nDynamic Contrastive Dual-Path Network (DCDP-HAR). The framework comprises three\nkey components. First, a dual-path feature extraction architecture is employed,\nwhere ResNet and DenseNet branches collaboratively process multimodal sensor\ndata. Second, a multi-stage contrastive learning mechanism is introduced to\nachieve progressive alignment from local perception to semantic abstraction.\nThird, we present a confidence-driven gradient modulation strategy that\ndynamically monitors and adjusts the learning intensity of each modality branch\nduring backpropagation, effectively alleviating modality competition. In\naddition, a momentum-based gradient accumulation strategy is adopted to enhance\ntraining stability. We conduct ablation studies to validate the effectiveness\nof each component and perform extensive comparative experiments on four public\nbenchmark datasets.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
{"id": "2507.02645", "categories": ["cs.LG", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.02645", "abs": "https://arxiv.org/abs/2507.02645", "authors": ["Harry Cheng", "Ming-Hui Liu", "Yangyang Guo", "Tianyi Wang", "Liqiang Nie", "Mohan Kankanhalli"], "title": "Fair Deepfake Detectors Can Generalize", "comment": "14 pages, version 1", "summary": "Deepfake detection models face two critical challenges: generalization to\nunseen manipulations and demographic fairness among population groups. However,\nexisting approaches often demonstrate that these two objectives are inherently\nconflicting, revealing a trade-off between them. In this paper, we, for the\nfirst time, uncover and formally define a causal relationship between fairness\nand generalization. Building on the back-door adjustment, we show that\ncontrolling for confounders (data distribution and model capacity) enables\nimproved generalization via fairness interventions. Motivated by this insight,\nwe propose Demographic Attribute-insensitive Intervention Detection (DAID), a\nplug-and-play framework composed of: i) Demographic-aware data rebalancing,\nwhich employs inverse-propensity weighting and subgroup-wise feature\nnormalization to neutralize distributional biases; and ii) Demographic-agnostic\nfeature aggregation, which uses a novel alignment loss to suppress\nsensitive-attribute signals. Across three cross-domain benchmarks, DAID\nconsistently achieves superior performance in both fairness and generalization\ncompared to several state-of-the-art detectors, validating both its theoretical\nfoundation and practical effectiveness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-04.jsonl"}
