{"id": "2506.17834", "categories": ["cs.AI", "cs.HC", "I.2.6; H.5.2; I.2.7"], "pdf": "https://arxiv.org/pdf/2506.17834", "abs": "https://arxiv.org/abs/2506.17834", "authors": ["Carter Blair", "Kate Larson", "Edith Law"], "title": "Reflective Verbal Reward Design for Pluralistic Alignment", "comment": "9 pages, 3 figures, accepted to the IJCAI 2025 Human-Centred AI\n  track. Project repository at: https://osf.io/8yxf2/", "summary": "AI agents are commonly aligned with \"human values\" through reinforcement\nlearning from human feedback (RLHF), where a single reward model is learned\nfrom aggregated human feedback and used to align an agent's behavior. However,\nhuman values are not homogeneous--different people hold distinct and sometimes\nconflicting values. Aggregating feedback into a single reward model risks\ndisproportionately suppressing minority preferences. To address this, we\npresent a novel reward modeling approach for learning individualized reward\nmodels. Our approach uses a language model to guide users through reflective\ndialogues where they critique agent behavior and construct their preferences.\nThis personalized dialogue history, containing the user's reflections and\ncritiqued examples, is then used as context for another language model that\nserves as an individualized reward function (what we call a \"verbal reward\nmodel\") for evaluating new trajectories. In studies with 30 participants, our\nmethod achieved a 9-12% improvement in accuracy over non-reflective verbal\nreward models while being more sample efficient than traditional supervised\nlearning methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "reward function", "RLHF", "human feedback", "alignment"], "score": 6}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "dialogue"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18787", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18787", "abs": "https://arxiv.org/abs/2506.18787", "authors": ["Dylan Ebert"], "title": "3D Arena: An Open Platform for Generative 3D Evaluation", "comment": "9 pages, 2 figures", "summary": "Evaluating Generative 3D models remains challenging due to misalignment\nbetween automated metrics and human perception of quality. Current benchmarks\nrely on image-based metrics that ignore 3D structure or geometric measures that\nfail to capture perceptual appeal and real-world utility. To address this gap,\nwe present 3D Arena, an open platform for evaluating image-to-3D generation\nmodels through large-scale human preference collection using pairwise\ncomparisons.\n  Since launching in June 2024, the platform has collected 123,243 votes from\n8,096 users across 19 state-of-the-art models, establishing the largest human\npreference evaluation for Generative 3D. We contribute the iso3d dataset of 100\nevaluation prompts and demonstrate quality control achieving 99.75% user\nauthenticity through statistical fraud detection. Our ELO-based ranking system\nprovides reliable model assessment, with the platform becoming an established\nevaluation resource.\n  Through analysis of this preference data, we present insights into human\npreference patterns. Our findings reveal preferences for visual presentation\nfeatures, with Gaussian splat outputs achieving a 16.6 ELO advantage over\nmeshes and textured models receiving a 144.1 ELO advantage over untextured\nmodels. We provide recommendations for improving evaluation methods, including\nmulti-criteria assessment, task-oriented evaluation, and format-aware\ncomparison. The platform's community engagement establishes 3D Arena as a\nbenchmark for the field while advancing understanding of human-centered\nevaluation in Generative 3D.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "comparison", "ranking", "pairwise"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "human preference", "criteria"], "score": 5}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18102", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.18102", "abs": "https://arxiv.org/abs/2506.18102", "authors": ["Fuyu Wang", "Jiangtong Li", "Kun Zhu", "Changjun Jiang"], "title": "InspireDebate: Multi-Dimensional Subjective-Objective Evaluation-Guided Reasoning and Optimization for Debating", "comment": "20 pages; Accepted to ACL 2025 Main", "summary": "With the rapid advancements in large language models (LLMs), debating tasks,\nsuch as argument quality assessment and debate process simulation, have made\nsignificant progress. However, existing LLM-based debating systems focus on\nresponding to specific arguments while neglecting objective assessments such as\nauthenticity and logical validity. Furthermore, these systems lack a structured\napproach to optimize across various dimensions$-$including evaluation metrics,\nchain-of-thought (CoT) reasoning, and multi-turn debate refinement$-$thereby\nlimiting their effectiveness. To address these interconnected challenges, we\npropose a dual-component framework: (1) $\\textbf{InspireScore}$, a novel\nevaluation system that establishes a multi-dimensional assessment architecture\nincorporating four subjective criteria (emotional appeal, argument clarity,\nargument arrangement, and topic relevance) alongside two objective metrics\n(fact authenticity and logical validity); and (2) $\\textbf{InspireDebate}$, an\noptimized debating framework employing a phased optimization approach through\nCoT reasoning enhancement, multi-dimensional Direct Preference Optimization\n(DPO), and real-time knowledge grounding via web-based Retrieval Augmented\nGeneration (Web-RAG). Empirical evaluations demonstrate that\n$\\textbf{InspireScore}$ achieves 44$\\%$ higher correlation with expert\njudgments compared to existing methods, while $\\textbf{InspireDebate}$ shows\nsignificant improvements, outperforming baseline models by 57$\\%$. Source code\nis available at https://github.com/fywang12/InspireDebate.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "correlation", "multi-dimensional", "criteria"], "score": 4}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18564", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18564", "abs": "https://arxiv.org/abs/2506.18564", "authors": ["Xuanyu Zhang", "Weiqi Li", "Shijie Zhao", "Junlin Li", "Li Zhang", "Jian Zhang"], "title": "VQ-Insight: Teaching VLMs for AI-Generated Video Quality Understanding via Progressive Visual Reinforcement Learning", "comment": "Technical Report", "summary": "Recent advances in AI-generated content (AIGC) have led to the emergence of\npowerful text-to-video generation models. Despite these successes, evaluating\nthe quality of AIGC-generated videos remains challenging due to limited\ngeneralization, lack of temporal awareness, heavy reliance on large-scale\nannotated datasets, and the lack of effective interaction with generation\nmodels. Most current approaches rely on supervised finetuning of\nvision-language models (VLMs), which often require large-scale annotated\ndatasets and tend to decouple understanding and generation. To address these\nshortcomings, we propose VQ-Insight, a novel reasoning-style VLM framework for\nAIGC video quality assessment. Our approach features: (1) a progressive video\nquality learning scheme that combines image quality warm-up, general\ntask-specific temporal learning, and joint optimization with the video\ngeneration model; (2) the design of multi-dimension scoring rewards, preference\ncomparison rewards, and temporal modeling rewards to enhance both\ngeneralization and specialization in video quality evaluation. Extensive\nexperiments demonstrate that VQ-Insight consistently outperforms\nstate-of-the-art baselines in preference comparison, multi-dimension scoring,\nand natural video scoring, bringing significant improvements for video\ngeneration tasks.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "preference", "comparison"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dimension"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18126", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18126", "abs": "https://arxiv.org/abs/2506.18126", "authors": ["Xiang Yuming", "Li Sizhao", "Li Rongpeng", "Zhao Zhifeng", "Zhang Honggang"], "title": "Decentralized Consensus Inference-based Hierarchical Reinforcement Learning for Multi-Constrained UAV Pursuit-Evasion Game", "comment": null, "summary": "Multiple quadrotor unmanned aerial vehicle (UAV) systems have garnered\nwidespread research interest and fostered tremendous interesting applications,\nespecially in multi-constrained pursuit-evasion games (MC-PEG). The Cooperative\nEvasion and Formation Coverage (CEFC) task, where the UAV swarm aims to\nmaximize formation coverage across multiple target zones while collaboratively\nevading predators, belongs to one of the most challenging issues in MC-PEG,\nespecially under communication-limited constraints. This multifaceted problem,\nwhich intertwines responses to obstacles, adversaries, target zones, and\nformation dynamics, brings up significant high-dimensional complications in\nlocating a solution. In this paper, we propose a novel two-level framework\n(i.e., Consensus Inference-based Hierarchical Reinforcement Learning (CI-HRL)),\nwhich delegates target localization to a high-level policy, while adopting a\nlow-level policy to manage obstacle avoidance, navigation, and formation.\nSpecifically, in the high-level policy, we develop a novel multi-agent\nreinforcement learning module, Consensus-oriented Multi-Agent Communication\n(ConsMAC), to enable agents to perceive global information and establish\nconsensus from local states by effectively aggregating neighbor messages.\nMeanwhile, we leverage an Alternative Training-based Multi-agent proximal\npolicy optimization (AT-M) and policy distillation to accomplish the low-level\ncontrol. The experimental results, including the high-fidelity\nsoftware-in-the-loop (SITL) simulations, validate that CI-HRL provides a\nsuperior solution with enhanced swarm's collaborative evasion and task\ncompletion capabilities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17863", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.17863", "abs": "https://arxiv.org/abs/2506.17863", "authors": ["Haoran Liu", "Amir Tahmasbi", "Ehtesham Sam Haque", "Purak Jain"], "title": "LLMs for Customized Marketing Content Generation and Evaluation at Scale", "comment": "KDD LLM4ECommerce Workshop 2025", "summary": "Offsite marketing is essential in e-commerce, enabling businesses to reach\ncustomers through external platforms and drive traffic to retail websites.\nHowever, most current offsite marketing content is overly generic,\ntemplate-based, and poorly aligned with landing pages, limiting its\neffectiveness. To address these limitations, we propose MarketingFM, a\nretrieval-augmented system that integrates multiple data sources to generate\nkeyword-specific ad copy with minimal human intervention. We validate\nMarketingFM via offline human and automated evaluations and large-scale online\nA/B tests. In one experiment, keyword-focused ad copy outperformed templates,\nachieving up to 9% higher CTR, 12% more impressions, and 0.38% lower CPC,\ndemonstrating gains in ad ranking and cost efficiency. Despite these gains,\nhuman review of generated ads remains costly. To address this, we propose\nAutoEval-Main, an automated evaluation system that combines rule-based metrics\nwith LLM-as-a-Judge techniques to ensure alignment with marketing principles.\nIn experiments with large-scale human annotations, AutoEval-Main achieved\n89.57% agreement with human reviewers. Building on this, we propose\nAutoEval-Update, a cost-efficient LLM-human collaborative framework to\ndynamically refine evaluation prompts and adapt to shifting criteria with\nminimal human input. By selectively sampling representative ads for human\nreview and using a critic LLM to generate alignment reports, AutoEval-Update\nimproves evaluation consistency while reducing manual effort. Experiments show\nthe critic LLM suggests meaningful refinements, improving LLM-human agreement.\nNonetheless, human oversight remains essential for setting thresholds and\nvalidating refinements before deployment.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement", "consistency", "criteria"], "score": 4}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17951", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.17951", "abs": "https://arxiv.org/abs/2506.17951", "authors": ["Quanwei Tang", "Sophia Yat Mei Lee", "Junshuang Wu", "Dong Zhang", "Shoushan Li", "Erik Cambria", "Guodong Zhou"], "title": "A Comprehensive Graph Framework for Question Answering with Mode-Seeking Preference Alignment", "comment": "acl 2025 findings", "summary": "Recent advancements in retrieval-augmented generation (RAG) have enhanced\nlarge language models in question answering by integrating external knowledge.\nHowever, challenges persist in achieving global understanding and aligning\nresponses with human ethical and quality preferences. To address these issues,\nwe propose GraphMPA, a comprehensive graph-based framework with mode-seeking\npreference alignment. Our approach constructs a hierarchical document graph\nusing a general similarity measurement, mimicking human cognitive processes for\ninformation understanding and synthesis. Additionally, we introduce\nmode-seeking preference optimization to better align model outputs with human\npreferences through probability-matching constraints. Extensive experiments on\nsix datasets demonstrate the effectiveness of our\n\\href{https://github.com/tangquanwei/GraphMPA}{GraphMPA}.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17939", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17939", "abs": "https://arxiv.org/abs/2506.17939", "authors": ["Bo Liu", "Xiangyu Zhao", "Along He", "Yidi Chen", "Huazhu Fu", "Xiao-Ming Wu"], "title": "GEMeX-ThinkVG: Towards Thinking with Visual Grounding in Medical VQA via Reinforcement Learning", "comment": "Work in Progress", "summary": "Medical visual question answering aims to support clinical decision-making by\nenabling models to answer natural language questions based on medical images.\nWhile recent advances in multi-modal learning have significantly improved\nperformance, current methods still suffer from limited answer reliability and\npoor interpretability, impairing the ability of clinicians and patients to\nunderstand and trust model-generated answers. To address this, this work first\nproposes a Thinking with Visual Grounding (ThinkVG) dataset wherein the answer\ngeneration is decomposed into intermediate reasoning steps that explicitly\nground relevant visual regions of the medical image, thereby providing\nfine-grained explainability. Furthermore, we introduce a novel verifiable\nreward mechanism for reinforcement learning to guide post-training, improving\nthe alignment between the model's reasoning process and its final answer.\nRemarkably, our method achieves comparable performance using only one-eighth of\nthe training data, demonstrating the efficiency and effectiveness of the\nproposal. The dataset is available at\nhttps://huggingface.co/datasets/BoKelvin/GEMeX-ThinkVG.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability", "question answering", "fine-grained"], "score": 4}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18485", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18485", "abs": "https://arxiv.org/abs/2506.18485", "authors": ["Junjie Zhang", "Guozheng Ma", "Shunyu Liu", "Haoyu Wang", "Jiaxing Huang", "Ting-En Lin", "Fei Huang", "Yongbin Li", "Dacheng Tao"], "title": "MeRF: Motivation-enhanced Reinforcement Finetuning for Large Reasoning Models", "comment": null, "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a\npowerful learn-to-reason paradigm for Large Language Models (LLMs) to tackle\ncomplex reasoning tasks. However, existing RLVR methods overlook one of the\nmost distinctive capabilities of LLMs, their in-context learning ability, as\nprominently demonstrated by the success of Chain-of-Thought (CoT) prompting.\nThis motivates us to explore how reinforcement learning can be effectively\ncombined with in-context learning to better improve the reasoning capabilities\nof LLMs. In this paper, we introduce Motivation-enhanced Reinforcement\nFinetuning} (MeRF), an intuitive yet effective method enhancing reinforcement\nlearning of LLMs by involving ``telling LLMs the rules of the game''.\nSpecifically, MeRF directly injects the reward specification into the prompt,\nwhich serves as an in-context motivation for model to improve its responses\nwith awareness of the optimization objective. This simple modification\nleverages the in-context learning ability of LLMs aligning generation with\noptimization, thereby incentivizing the model to generate desired outputs from\nboth inner motivation and external reward. Empirical evaluations on the Knights\nand Knaves~(K&K) logic puzzle reasoning benchmark demonstrate that\n\\texttt{MeRF} achieves substantial performance gains over baselines. Moreover,\nablation studies show that performance improves with greater consistency\nbetween the in-context motivation and the external reward function, while the\nmodel also demonstrates an ability to adapt to misleading motivations through\nreinforcement learning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18896", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.18896", "abs": "https://arxiv.org/abs/2506.18896", "authors": ["Jiaru Zou", "Ling Yang", "Jingwen Gu", "Jiahao Qiu", "Ke Shen", "Jingrui He", "Mengdi Wang"], "title": "ReasonFlux-PRM: Trajectory-Aware PRMs for Long Chain-of-Thought Reasoning in LLMs", "comment": "Codes and Models: https://github.com/Gen-Verse/ReasonFlux", "summary": "Process Reward Models (PRMs) have recently emerged as a powerful framework\nfor supervising intermediate reasoning steps in large language models (LLMs).\nPrevious PRMs are primarily trained on model final output responses and\nstruggle to evaluate intermediate thinking trajectories robustly, especially in\nthe emerging setting of trajectory-response outputs generated by frontier\nreasoning models like Deepseek-R1. In this work, we introduce ReasonFlux-PRM, a\nnovel trajectory-aware PRM explicitly designed to evaluate the\ntrajectory-response type of reasoning traces. ReasonFlux-PRM incorporates both\nstep-level and trajectory-level supervision, enabling fine-grained reward\nassignment aligned with structured chain-of-thought data. We adapt\nReasonFlux-PRM to support reward supervision under both offline and online\nsettings, including (i) selecting high-quality model distillation data for\ndownstream supervised fine-tuning of smaller models, (ii) providing dense\nprocess-level rewards for policy optimization during reinforcement learning,\nand (iii) enabling reward-guided Best-of-N test-time scaling. Empirical results\non challenging downstream benchmarks such as AIME, MATH500, and GPQA-Diamond\ndemonstrate that ReasonFlux-PRM-7B selects higher quality data than strong PRMs\n(e.g., Qwen2.5-Math-PRM-72B) and human-curated baselines. Furthermore, our\nderived ReasonFlux-PRM-7B yields consistent performance improvements, achieving\naverage gains of 12.1% in supervised fine-tuning, 4.5% in reinforcement\nlearning, and 6.3% in test-time scaling. We also release our efficient\nReasonFlux-PRM-1.5B for resource-constrained applications and edge deployment.\nProjects: https://github.com/Gen-Verse/ReasonFlux", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17939", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17939", "abs": "https://arxiv.org/abs/2506.17939", "authors": ["Bo Liu", "Xiangyu Zhao", "Along He", "Yidi Chen", "Huazhu Fu", "Xiao-Ming Wu"], "title": "GEMeX-ThinkVG: Towards Thinking with Visual Grounding in Medical VQA via Reinforcement Learning", "comment": "Work in Progress", "summary": "Medical visual question answering aims to support clinical decision-making by\nenabling models to answer natural language questions based on medical images.\nWhile recent advances in multi-modal learning have significantly improved\nperformance, current methods still suffer from limited answer reliability and\npoor interpretability, impairing the ability of clinicians and patients to\nunderstand and trust model-generated answers. To address this, this work first\nproposes a Thinking with Visual Grounding (ThinkVG) dataset wherein the answer\ngeneration is decomposed into intermediate reasoning steps that explicitly\nground relevant visual regions of the medical image, thereby providing\nfine-grained explainability. Furthermore, we introduce a novel verifiable\nreward mechanism for reinforcement learning to guide post-training, improving\nthe alignment between the model's reasoning process and its final answer.\nRemarkably, our method achieves comparable performance using only one-eighth of\nthe training data, demonstrating the efficiency and effectiveness of the\nproposal. The dataset is available at\nhttps://huggingface.co/datasets/BoKelvin/GEMeX-ThinkVG.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability", "question answering", "fine-grained"], "score": 4}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18331", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18331", "abs": "https://arxiv.org/abs/2506.18331", "authors": ["AmirHossein Zamani", "Tianhao Xie", "Amir G. Aghdam", "Tiberiu Popa", "Eugene Belilovsky"], "title": "Geometry-Aware Preference Learning for 3D Texture Generation", "comment": null, "summary": "Recent advances in 3D generative models have achieved impressive results but\n3D contents generated by these models may not align with subjective human\npreferences or task-specific criteria. Moreover, a core challenge in the 3D\ntexture generation domain remains: most existing approaches rely on repeated\ncalls to 2D text-to-image generative models, which lack an inherent\nunderstanding of the 3D structure of the input 3D mesh object. To address this,\nwe propose an end-to-end differentiable preference learning framework that\nback-propagates human preferences, represented by differentiable reward\nfunctions, through the entire 3D generative pipeline, making the process\ninherently geometry-aware. We demonstrate the effectiveness of our framework\nusing four proposed novel geometry-aware reward functions, offering a more\ncontrollable and interpretable pathway for high-quality 3D content creation\nfrom natural language.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference learning", "preference"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["criteria"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18485", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18485", "abs": "https://arxiv.org/abs/2506.18485", "authors": ["Junjie Zhang", "Guozheng Ma", "Shunyu Liu", "Haoyu Wang", "Jiaxing Huang", "Ting-En Lin", "Fei Huang", "Yongbin Li", "Dacheng Tao"], "title": "MeRF: Motivation-enhanced Reinforcement Finetuning for Large Reasoning Models", "comment": null, "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a\npowerful learn-to-reason paradigm for Large Language Models (LLMs) to tackle\ncomplex reasoning tasks. However, existing RLVR methods overlook one of the\nmost distinctive capabilities of LLMs, their in-context learning ability, as\nprominently demonstrated by the success of Chain-of-Thought (CoT) prompting.\nThis motivates us to explore how reinforcement learning can be effectively\ncombined with in-context learning to better improve the reasoning capabilities\nof LLMs. In this paper, we introduce Motivation-enhanced Reinforcement\nFinetuning} (MeRF), an intuitive yet effective method enhancing reinforcement\nlearning of LLMs by involving ``telling LLMs the rules of the game''.\nSpecifically, MeRF directly injects the reward specification into the prompt,\nwhich serves as an in-context motivation for model to improve its responses\nwith awareness of the optimization objective. This simple modification\nleverages the in-context learning ability of LLMs aligning generation with\noptimization, thereby incentivizing the model to generate desired outputs from\nboth inner motivation and external reward. Empirical evaluations on the Knights\nand Knaves~(K&K) logic puzzle reasoning benchmark demonstrate that\n\\texttt{MeRF} achieves substantial performance gains over baselines. Moreover,\nablation studies show that performance improves with greater consistency\nbetween the in-context motivation and the external reward function, while the\nmodel also demonstrates an ability to adapt to misleading motivations through\nreinforcement learning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18484", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18484", "abs": "https://arxiv.org/abs/2506.18484", "authors": ["Pascal Klöckner", "José Teixeira", "Diana Montezuma", "Jaime S. Cardoso", "Hugo M. Horlings", "Sara P. Oliveira"], "title": "GANs vs. Diffusion Models for virtual staining with the HER2match dataset", "comment": null, "summary": "Virtual staining is a promising technique that uses deep generative models to\nrecreate histological stains, providing a faster and more cost-effective\nalternative to traditional tissue chemical staining. Specifically for H&E-HER2\nstaining transfer, despite a rising trend in publications, the lack of\nsufficient public datasets has hindered progress in the topic. Additionally, it\nis currently unclear which model frameworks perform best for this particular\ntask. In this paper, we introduce the HER2match dataset, the first publicly\navailable dataset with the same breast cancer tissue sections stained with both\nH&E and HER2. Furthermore, we compare the performance of several Generative\nAdversarial Networks (GANs) and Diffusion Models (DMs), and implement a novel\nBrownian Bridge Diffusion Model for H&E-HER2 translation. Our findings indicate\nthat, overall, GANs perform better than DMs, with only the BBDM achieving\ncomparable results. Furthermore, we emphasize the importance of data alignment,\nas all models trained on HER2match produced vastly improved visuals compared to\nthe widely used consecutive-slide BCI dataset. This research provides a new\nhigh-quality dataset ([available upon publication acceptance]), improving both\nmodel training and evaluation. In addition, our comparison of frameworks offers\nvaluable guidance for researchers working on the topic.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18512", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18512", "abs": "https://arxiv.org/abs/2506.18512", "authors": ["Yuting Zhang", "Kaishen Yuan", "Hao Lu", "Yutao Yue", "Jintai Chen", "Kaishun Wu"], "title": "MedTVT-R1: A Multimodal LLM Empowering Medical Reasoning and Diagnosis", "comment": null, "summary": "Accurate and interpretable multi-disease diagnosis remains a critical\nchallenge in medical research, particularly when leveraging heterogeneous\nmultimodal medical data. Current approaches often rely on single-modal data,\nlimiting their ability to comprehensively understand complex diseases. To\naddress this, we propose MedTVT-R1, a novel Multimodal Large Language Model\n(MLLM) framework designed to integrate clinical multimodal data for reasoning\nand diagnosing multiple diseases. We construct MedTVT-QA, a curated instruction\ndataset that provides question-answer pairs for physiological-level\ninterpretations and disease-level diagnoses with a Chain of Evidence approach.\nMedTVT-R1 incorporates a modality perception layer to capture inter-modal\ndependencies and adaptively weight modality contributions. Additionally, we\nemploy Group Relative Policy Optimization (GRPO)-based Reinforcement\nFine-Tuning with a Jaccard Reward function to enhance diagnostic reasoning.\nExperimental results demonstrate MedTVT-R1's superiority in multimodal feature\nutilization and multi-disease diagnosis, offering significant potential for\nclinical applications such as diagnostic report generation and comorbidity\nreasoning. The dataset and code are available at\nhttps://github.com/keke-nice/MedTVT-R1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17290", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17290", "abs": "https://arxiv.org/abs/2506.17290", "authors": ["Yuqi Li", "Junhao Dong", "Zeyu Dong", "Chuanguang Yang", "Zhulin An", "Yongjun Xu"], "title": "SRKD: Towards Efficient 3D Point Cloud Segmentation via Structure- and Relation-aware Knowledge Distillation", "comment": "13 pages", "summary": "3D point cloud segmentation faces practical challenges due to the\ncomputational complexity and deployment limitations of large-scale\ntransformer-based models. To address this, we propose a novel Structure- and\nRelation-aware Knowledge Distillation framework, named SRKD, that transfers\nrich geometric and semantic knowledge from a large frozen teacher model (>100M)\nto a lightweight student model (<15M). Specifically, we propose an affinity\nmatrix-based relation alignment module, which distills structural dependencies\nfrom the teacher to the student through point-wise similarity matching,\nenhancing the student's capability to learn contextual interactions. Meanwhile,\nwe introduce a cross-sample mini-batch construction strategy that enables the\nstudent to perceive stable and generalized geometric structure. This aligns\nacross diverse point cloud instances of the teacher, rather than within a\nsingle sample. Additionally, KL divergence is applied to align semantic\ndistributions, and ground-truth supervision further reinforces accurate\nsegmentation. Our method achieves state of the art performance with\nsignificantly reduced model complexity, demonstrating its effectiveness and\nefficiency in real-world deployment scenarios. Our Code is available at\nhttps://github.com/itsnotacie/SRKD.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17302", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.17302", "abs": "https://arxiv.org/abs/2506.17302", "authors": ["Yijun Lin", "Theresa Chen", "Colby Brungard", "Grunwald Sabine", "Sue Ives", "Matt Macander", "Timm Nawrocki", "Yao-Yi Chiang", "Nic Jelinski"], "title": "Fine-Scale Soil Mapping in Alaska with Multimodal Machine Learning", "comment": "12 pages, Submitted to SIGSPATIAL 2025", "summary": "Fine-scale soil mapping in Alaska, traditionally relying on fieldwork and\nlocalized simulations, remains a critical yet underdeveloped task, despite the\nregion's ecological importance and extensive permafrost coverage. As permafrost\nthaw accelerates due to climate change, it threatens infrastructure stability\nand key ecosystem services, such as soil carbon storage. High-resolution soil\nmaps are essential for characterizing permafrost distribution, identifying\nvulnerable areas, and informing adaptation strategies. We present MISO, a\nvision-based machine learning (ML) model to produce statewide fine-scale soil\nmaps for near-surface permafrost and soil taxonomy. The model integrates a\ngeospatial foundation model for visual feature extraction, implicit neural\nrepresentations for continuous spatial prediction, and contrastive learning for\nmultimodal alignment and geo-location awareness. We compare MISO with Random\nForest (RF), a traditional ML model that has been widely used in soil mapping\napplications. Spatial cross-validation and regional analysis across Permafrost\nZones and Major Land Resource Areas (MLRAs) show that MISO generalizes better\nto remote, unseen locations and achieves higher recall than RF, which is\ncritical for monitoring permafrost thaw and related environmental processes.\nThese findings demonstrate the potential of advanced ML approaches for\nfine-scale soil mapping and provide practical guidance for future soil sampling\nand infrastructure planning in permafrost-affected landscapes. The project will\nbe released at https://github.com/knowledge-computing/Peatland-permafrost.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17434", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17434", "abs": "https://arxiv.org/abs/2506.17434", "authors": ["Sydney Levine", "Matija Franklin", "Tan Zhi-Xuan", "Secil Yanik Guyot", "Lionel Wong", "Daniel Kilov", "Yejin Choi", "Joshua B. Tenenbaum", "Noah Goodman", "Seth Lazar", "Iason Gabriel"], "title": "Resource Rational Contractualism Should Guide AI Alignment", "comment": "24 pages, 10 figures", "summary": "AI systems will soon have to navigate human environments and make decisions\nthat affect people and other AI agents whose goals and values diverge.\nContractualist alignment proposes grounding those decisions in agreements that\ndiverse stakeholders would endorse under the right conditions, yet securing\nsuch agreement at scale remains costly and slow -- even for advanced AI. We\ntherefore propose Resource-Rational Contractualism (RRC): a framework where AI\nsystems approximate the agreements rational parties would form by drawing on a\ntoolbox of normatively-grounded, cognitively-inspired heuristics that trade\neffort for accuracy. An RRC-aligned agent would not only operate efficiently,\nbut also be equipped to dynamically adapt to and interpret the ever-changing\nhuman social world.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["agreement", "accuracy"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17296", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17296", "abs": "https://arxiv.org/abs/2506.17296", "authors": ["Darius Foodeei", "Simin Fan", "Martin Jaggi"], "title": "Semantic uncertainty in advanced decoding methods for LLM generation", "comment": null, "summary": "This study investigates semantic uncertainty in large language model (LLM)\noutputs across different decoding methods, focusing on emerging techniques like\nspeculative sampling and chain-of-thought (CoT) decoding. Through experiments\non question answering, summarization, and code generation tasks, we analyze how\ndifferent decoding strategies affect both the diversity and reliability of\nmodel outputs. Our findings reveal that while CoT decoding demonstrates higher\nsemantic diversity, it maintains lower predictive entropy, suggesting that\nstructured exploration can lead to more confident and accurate outputs. This is\nevidenced by a 48.8% improvement in code generation Pass@2 rates, despite lower\nalignment with reference solutions. For summarization tasks, speculative\nsampling proved particularly effective, achieving superior ROUGE scores while\nmaintaining moderate semantic diversity. Our results challenge conventional\nassumptions about trade-offs between diversity and accuracy in language model\noutputs, demonstrating that properly structured decoding methods can increase\nsemantic exploration while maintaining or improving output quality. These\nfindings have significant implications for deploying language models in\npractical applications where both reliability and diverse solution generation\nare crucial.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "accuracy", "summarization", "question answering", "code generation"], "score": 5}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17403", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17403", "abs": "https://arxiv.org/abs/2506.17403", "authors": ["Zhiyi Shi", "Junsik Kim", "Helen Y. Yang", "Yonghyun Song", "Hyun-Jic Oh", "Dalit Ben-Yosef", "Daniel Needleman", "Hanspeter Pfister"], "title": "Spatial-Temporal Pre-Training for Embryo Viability Prediction Using Time-Lapse Videos", "comment": "Preprint submitted to Medical Image Analysis", "summary": "Automating embryo viability prediction for in vitro fertilization (IVF) is\nimportant but challenging due to the limited availability of labeled pregnancy\noutcome data, as only a small fraction of embryos are labeled after transfer.\nSelf-supervised learning (SSL) can leverage both labeled and unlabeled data to\nimprove prediction. However, existing SSL methods for videos are not directly\napplicable to embryo development videos due to two challenges: (1) embryo\ntime-lapse videos contain hundreds of frames, requiring significant GPU memory\nfor conventional SSL; (2) the dataset contains videos with varying lengths and\nmany outlier frames, causing traditional video alignment methods to struggle\nwith semantic misalignment. We propose Spatial-Temporal Pre-Training (STPT) to\naddress these challenges. STPT includes two stages: spatial and temporal. In\neach stage, only one encoder is trained while the other is frozen, reducing\nmemory demands. To handle temporal misalignment, STPT avoids frame-by-frame\nalignment across videos. The spatial stage learns from alignments within each\nvideo and its temporally consistent augmentations. The temporal stage then\nmodels relationships between video embeddings. Our method efficiently handles\nlong videos and temporal variability. On 23,027 time-lapse videos (3,286\nlabeled), STPT achieves the highest AUC of 0.635 (95% CI: 0.632-0.638) compared\nto baselines, with limited computational resources.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17367", "categories": ["cs.CL", "cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2506.17367", "abs": "https://arxiv.org/abs/2506.17367", "authors": ["Mateusz Cedro", "Timour Ichmoukhamedov", "Sofie Goethals", "Yifan He", "James Hinns", "David Martens"], "title": "Cash or Comfort? How LLMs Value Your Inconvenience", "comment": "12 pages, 4 figures, 3 tables", "summary": "Large Language Models (LLMs) are increasingly proposed as near-autonomous\nartificial intelligence (AI) agents capable of making everyday decisions on\nbehalf of humans. Although LLMs perform well on many technical tasks, their\nbehaviour in personal decision-making remains less understood. Previous studies\nhave assessed their rationality and moral alignment with human decisions.\nHowever, the behaviour of AI assistants in scenarios where financial rewards\nare at odds with user comfort has not yet been thoroughly explored. In this\npaper, we tackle this problem by quantifying the prices assigned by multiple\nLLMs to a series of user discomforts: additional walking, waiting, hunger and\npain. We uncover several key concerns that strongly question the prospect of\nusing current LLMs as decision-making assistants: (1) a large variance in\nresponses between LLMs, (2) within a single LLM, responses show fragility to\nminor variations in prompt phrasing (e.g., reformulating the question in the\nfirst person can considerably alter the decision), (3) LLMs can accept\nunreasonably low rewards for major inconveniences (e.g., 1 Euro to wait 10\nhours), and (4) LLMs can reject monetary gains where no discomfort is imposed\n(e.g., 1,000 Euro to wait 0 minutes). These findings emphasize the need for\nscrutiny of how LLMs value human inconvenience, particularly as we move toward\napplications where such cash-versus-comfort trade-offs are made on users'\nbehalf.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18680", "categories": ["cs.GR", "cs.CV", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2506.18680", "abs": "https://arxiv.org/abs/2506.18680", "authors": ["Anindita Ghosh", "Bing Zhou", "Rishabh Dabral", "Jian Wang", "Vladislav Golyanik", "Christian Theobalt", "Philipp Slusallek", "Chuan Guo"], "title": "DuetGen: Music Driven Two-Person Dance Generation via Hierarchical Masked Modeling", "comment": "11 pages, 7 figures, 2 tables, accepted in ACM Siggraph 2025\n  conference track", "summary": "We present DuetGen, a novel framework for generating interactive two-person\ndances from music. The key challenge of this task lies in the inherent\ncomplexities of two-person dance interactions, where the partners need to\nsynchronize both with each other and with the music. Inspired by the recent\nadvances in motion synthesis, we propose a two-stage solution: encoding\ntwo-person motions into discrete tokens and then generating these tokens from\nmusic. To effectively capture intricate interactions, we represent both\ndancers' motions as a unified whole to learn the necessary motion tokens, and\nadopt a coarse-to-fine learning strategy in both the stages. Our first stage\nutilizes a VQ-VAE that hierarchically separates high-level semantic features at\na coarse temporal resolution from low-level details at a finer resolution,\nproducing two discrete token sequences at different abstraction levels.\nSubsequently, in the second stage, two generative masked transformers learn to\nmap music signals to these dance tokens: the first producing high-level\nsemantic tokens, and the second, conditioned on music and these semantic\ntokens, producing the low-level tokens. We train both transformers to learn to\npredict randomly masked tokens within the sequence, enabling them to\niteratively generate motion tokens by filling an empty token sequence during\ninference. Through the hierarchical masked modeling and dedicated interaction\nrepresentation, DuetGen achieves the generation of synchronized and interactive\ntwo-person dances across various genres. Extensive experiments and user studies\non a benchmark duet dance dataset demonstrate state-of-the-art performance of\nDuetGen in motion realism, music-dance alignment, and partner coordination.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17533", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.17533", "abs": "https://arxiv.org/abs/2506.17533", "authors": ["Yuanhao Wu", "Juntong Song", "Hanning Zhang", "Tong Zhang", "Cheng Niu"], "title": "DuaShepherd: Integrating Stepwise Correctness and Potential Rewards for Mathematical Reasoning", "comment": null, "summary": "In this paper, we propose DuaShepherd, a novel reward modeling framework that\nintegrates two complementary reward signals, correctness and potential, to\nenhance the mathematical reasoning capabilities of Large Language Models\n(LLMs). While correctness-based signals emphasize identification of stepwise\nerrors, potential-based signals focus on the likelihood of reaching the correct\nfinal answer. We developed an automated pipeline for constructing large-scale\nreward modeling dataset with both signals. A unified, multi-head architecture\nwas explored to train the two reward models in a multi-task setup,\ndemonstrating benefits from learning both correctness and potential in\nparallel. By combining these two signals into a compound probability, our model\nachieves consistent performance improvements across multiple benchmarks.\nEmpirical evaluations on MATH500 and ProcessBench confirm that this combined\nreward significantly outperforms models trained on either reward type alone,\nachieving state-of-the-art performance under comparable resource constraints.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward modeling"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "mathematical reasoning"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17846", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17846", "abs": "https://arxiv.org/abs/2506.17846", "authors": ["Elija Perrier"], "title": "Out of Control -- Why Alignment Needs Formal Control Theory (and an Alignment Control Stack)", "comment": "Under review for Neurips 2025", "summary": "This position paper argues that formal optimal control theory should be\ncentral to AI alignment research, offering a distinct perspective from\nprevailing AI safety and security approaches. While recent work in AI safety\nand mechanistic interpretability has advanced formal methods for alignment,\nthey often fall short of the generalisation required of control frameworks for\nother technologies. There is also a lack of research into how to render\ndifferent alignment/control protocols interoperable. We argue that by recasting\nalignment through principles of formal optimal control and framing alignment in\nterms of hierarchical stack from physical to socio-technical layers according\nto which controls may be applied we can develop a better understanding of the\npotential and limitations for controlling frontier models and agentic AI\nsystems. To this end, we introduce an Alignment Control Stack which sets out a\nhierarchical layered alignment stack, identifying measurement and control\ncharacteristics at each layer and how different layers are formally\ninteroperable. We argue that such analysis is also key to the assurances that\nwill be needed by governments and regulators in order to see AI technologies\nsustainably benefit the community. Our position is that doing so will bridge\nthe well-established and empirically validated methods of optimal control with\npractical deployment considerations to create a more comprehensive alignment\nframework, enhancing how we approach safety and reliability for advanced AI\nsystems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "reliability"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17900", "categories": ["cs.AI", "cs.DC"], "pdf": "https://arxiv.org/pdf/2506.17900", "abs": "https://arxiv.org/abs/2506.17900", "authors": ["Cheng Ji", "Huaiying Luo"], "title": "Leveraging Large Language Model for Intelligent Log Processing and Autonomous Debugging in Cloud AI Platforms", "comment": "Accepted by 2025 8th International Conference on Advanced Electronic\n  Materials, Computers and Software Engineering (AEMCSE 2025)", "summary": "With the increasing complexity and rapid expansion of the scale of AI systems\nin cloud platforms, the log data generated during system operation is massive,\nunstructured, and semantically ambiguous, which brings great challenges to\nfault location and system self-repair. In order to solve this problem, this\npaper proposes an intelligent log processing and automatic debugging framework\nbased on Large Language Model (LLM), named Intelligent Debugger (LLM-ID). This\nmethod is extended on the basis of the existing pre-trained Transformer model,\nand integrates a multi-stage semantic inference mechanism to realize the\ncontext understanding of system logs and the automatic reconstruction of fault\nchains. Firstly, the system log is dynamically structured, and the unsupervised\nclustering and embedding mechanism is used to extract the event template and\nsemantic schema. Subsequently, the fine-tuned LLM combined with the multi-round\nattention mechanism to perform contextual reasoning on the log sequence to\ngenerate potential fault assumptions and root cause paths. Furthermore, this\npaper introduces a reinforcement learning-based policy-guided recovery planner,\nwhich is driven by the remediation strategy generated by LLM to support dynamic\ndecision-making and adaptive debugging in the cloud environment. Compared with\nthe existing rule engine or traditional log analysis system, the proposed model\nhas stronger semantic understanding ability, continuous learning ability and\nheterogeneous environment adaptability. Experiments on the cloud platform log\ndataset show that LLM-ID improves the fault location accuracy by 16.2%, which\nis significantly better than the current mainstream methods", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17930", "categories": ["cs.AI", "cs.CL", "cs.LG", "cs.NE", "cs.RO"], "pdf": "https://arxiv.org/pdf/2506.17930", "abs": "https://arxiv.org/abs/2506.17930", "authors": ["Jianyu Wang", "Zhiqiang Hu", "Lidong Bing"], "title": "Evolving Prompts In-Context: An Open-ended, Self-replicating Perspective", "comment": "ICML 2025, and Code will be released at:\n  https://github.com/jianyu-cs/PromptQuine/", "summary": "We propose a novel prompt design paradigm that challenges conventional wisdom\nin large language model (LLM) prompting. While conventional wisdom prioritizes\nwell-crafted instructions and demonstrations for in-context learning (ICL), we\nshow that pruning random demonstrations into seemingly incoherent \"gibberish\"\ncan remarkably improve performance across diverse tasks. Notably, the\n\"gibberish\" always matches or surpasses state-of-the-art automatic prompt\noptimization techniques, achieving substantial gains regardless of LLM\nalignment. Nevertheless, discovering an effective pruning strategy is\nnon-trivial, as existing attribution methods and prompt compression algorithms\nfail to deliver robust results, let alone human intuition. In terms of this, we\npropose a self-discover prompt optimization framework, PromptQuine, an\nevolutionary search framework that automatically searches for the pruning\nstrategy by itself using only low-data regimes. Much like the emergent\ncomplexity in nature--such as symbiosis and self-organization--arising in\nresponse to resource constraints, our framework evolves and refines\nunconventional yet highly effective prompts by leveraging only the tokens\npresent within the context. We demonstrate its effectiveness across\nclassification, multi-choice question answering, generation and math reasoning\ntasks across LLMs, while achieving decent runtime efficiency. We hope our\nfindings can guide mechanistic studies on in-context learning, and provide a\ncall to action, to pave the way for more open-ended search algorithms for more\neffective LLM prompting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17959", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17959", "abs": "https://arxiv.org/abs/2506.17959", "authors": ["Lizzy Farrugia", "Lilian M. Azzopardi", "Jeremy Debattista", "Charlie Abela"], "title": "medicX-KG: A Knowledge Graph for Pharmacists' Drug Information Needs", "comment": null, "summary": "The role of pharmacists is evolving from medicine dispensing to delivering\ncomprehensive pharmaceutical services within multidisciplinary healthcare\nteams. Central to this shift is access to accurate, up-to-date medicinal\nproduct information supported by robust data integration. Leveraging artificial\nintelligence and semantic technologies, Knowledge Graphs (KGs) uncover hidden\nrelationships and enable data-driven decision-making. This paper presents\nmedicX-KG, a pharmacist-oriented knowledge graph supporting clinical and\nregulatory decisions. It forms the semantic layer of the broader medicX\nplatform, powering predictive and explainable pharmacy services. medicX-KG\nintegrates data from three sources, including, the British National Formulary\n(BNF), DrugBank, and the Malta Medicines Authority (MMA) that addresses Malta's\nregulatory landscape and combines European Medicines Agency alignment with\npartial UK supply dependence. The KG tackles the absence of a unified national\ndrug repository, reducing pharmacists' reliance on fragmented sources. Its\ndesign was informed by interviews with practicing pharmacists to ensure\nreal-world applicability. We detail the KG's construction, including data\nextraction, ontology design, and semantic mapping. Evaluation demonstrates that\nmedicX-KG effectively supports queries about drug availability, interactions,\nadverse reactions, and therapeutic classes. Limitations, including missing\ndetailed dosage encoding and real-time updates, are discussed alongside\ndirections for future enhancements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18019", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18019", "abs": "https://arxiv.org/abs/2506.18019", "authors": ["Yuanchen Bei", "Weizhi Zhang", "Siwen Wang", "Weizhi Chen", "Sheng Zhou", "Hao Chen", "Yong Li", "Jiajun Bu", "Shirui Pan", "Yizhou Yu", "Irwin King", "Fakhri Karray", "Philip S. Yu"], "title": "Graphs Meet AI Agents: Taxonomy, Progress, and Future Opportunities", "comment": "20 pages, 7 figures", "summary": "AI agents have experienced a paradigm shift, from early dominance by\nreinforcement learning (RL) to the rise of agents powered by large language\nmodels (LLMs), and now further advancing towards a synergistic fusion of RL and\nLLM capabilities. This progression has endowed AI agents with increasingly\nstrong abilities. Despite these advances, to accomplish complex real-world\ntasks, agents are required to plan and execute effectively, maintain reliable\nmemory, and coordinate smoothly with other agents. Achieving these capabilities\ninvolves contending with ever-present intricate information, operations, and\ninteractions. In light of this challenge, data structurization can play a\npromising role by transforming intricate and disorganized data into\nwell-structured forms that agents can more effectively understand and process.\nIn this context, graphs, with their natural advantage in organizing, managing,\nand harnessing intricate data relationships, present a powerful data paradigm\nfor structurization to support the capabilities demanded by advanced AI agents.\nTo this end, this survey presents a first systematic review of how graphs can\nempower AI agents. Specifically, we explore the integration of graph techniques\nwith core agent functionalities, highlight notable applications, and identify\nprospective avenues for future research. By comprehensively surveying this\nburgeoning intersection, we hope to inspire the development of next-generation\nAI agents equipped to tackle increasingly sophisticated challenges with graphs.\nRelated resources are collected and continuously updated for the community in\nthe Github link.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18044", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18044", "abs": "https://arxiv.org/abs/2506.18044", "authors": ["Joseph Babb", "Joohyung Lee"], "title": "Action Language BC+", "comment": "Journal of Logic and Computation, 2015", "summary": "Action languages are formal models of parts of natural language that are\ndesigned to describe effects of actions. Many of these languages can be viewed\nas high level notations of answer set programs structured to represent\ntransition systems. However, the form of answer set programs considered in the\nearlier work is quite limited in comparison with the modern Answer Set\nProgramming (ASP) language, which allows several useful constructs for\nknowledge representation, such as choice rules, aggregates, and abstract\nconstraint atoms. We propose a new action language called BC+, which closes the\ngap between action languages and the modern ASP language. The main idea is to\ndefine the semantics of BC+ in terms of general stable model semantics for\npropositional formulas, under which many modern ASP language constructs can be\nidentified with shorthands for propositional formulas. Language BC+ turns out\nto be sufficiently expressive to encompass the best features of other action\nlanguages, such as languages B, C, C+, and BC. Computational methods available\nin ASP solvers are readily applicable to compute BC+, which led to an\nimplementation of the language by extending system cplus2asp.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17612", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17612", "abs": "https://arxiv.org/abs/2506.17612", "authors": ["Yunlong Lin", "Zixu Lin", "Kunjie Lin", "Jinbin Bai", "Panwang Pan", "Chenxin Li", "Haoyu Chen", "Zhongdao Wang", "Xinghao Ding", "Wenbo Li", "Shuicheng Yan"], "title": "JarvisArt: Liberating Human Artistic Creativity via an Intelligent Photo Retouching Agent", "comment": "40 pages, 26 figures", "summary": "Photo retouching has become integral to contemporary visual storytelling,\nenabling users to capture aesthetics and express creativity. While professional\ntools such as Adobe Lightroom offer powerful capabilities, they demand\nsubstantial expertise and manual effort. In contrast, existing AI-based\nsolutions provide automation but often suffer from limited adjustability and\npoor generalization, failing to meet diverse and personalized editing needs. To\nbridge this gap, we introduce JarvisArt, a multi-modal large language model\n(MLLM)-driven agent that understands user intent, mimics the reasoning process\nof professional artists, and intelligently coordinates over 200 retouching\ntools within Lightroom. JarvisArt undergoes a two-stage training process: an\ninitial Chain-of-Thought supervised fine-tuning to establish basic reasoning\nand tool-use skills, followed by Group Relative Policy Optimization for\nRetouching (GRPO-R) to further enhance its decision-making and tool\nproficiency. We also propose the Agent-to-Lightroom Protocol to facilitate\nseamless integration with Lightroom. To evaluate performance, we develop\nMMArt-Bench, a novel benchmark constructed from real-world user edits.\nJarvisArt demonstrates user-friendly interaction, superior generalization, and\nfine-grained control over both global and local adjustments, paving a new\navenue for intelligent photo retouching. Notably, it outperforms GPT-4o with a\n60% improvement in average pixel-level metrics on MMArt-Bench for content\nfidelity, while maintaining comparable instruction-following capabilities.\nProject Page: https://jarvisart.vercel.app/.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "fine-grained"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18156", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18156", "abs": "https://arxiv.org/abs/2506.18156", "authors": ["Akash Kundu", "Rishika Goswami"], "title": "AI Through the Human Lens: Investigating Cognitive Theories in Machine Psychology", "comment": null, "summary": "We investigate whether Large Language Models (LLMs) exhibit human-like\ncognitive patterns under four established frameworks from psychology: Thematic\nApperception Test (TAT), Framing Bias, Moral Foundations Theory (MFT), and\nCognitive Dissonance. We evaluated several proprietary and open-source models\nusing structured prompts and automated scoring. Our findings reveal that these\nmodels often produce coherent narratives, show susceptibility to positive\nframing, exhibit moral judgments aligned with Liberty/Oppression concerns, and\ndemonstrate self-contradictions tempered by extensive rationalization. Such\nbehaviors mirror human cognitive tendencies yet are shaped by their training\ndata and alignment methods. We discuss the implications for AI transparency,\nethical deployment, and future work that bridges cognitive psychology and AI\nsafety", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17664", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17664", "abs": "https://arxiv.org/abs/2506.17664", "authors": ["Shuaiye Lu", "Linjiang Zhou", "Xiaochuan Shi"], "title": "MDSAM:Memory-Driven Sparse Attention Matrix for LVLMs Hallucination Mitigation", "comment": null, "summary": "Hallucinations in large vision-language models (LVLMs) often stem from the\nmodel's sensitivity to image tokens during decoding, as evidenced by attention\npeaks observed when generating both real and hallucinated entities. To address\nthis, we propose Memory-Driven Sparse Attention Matrix (MDSAM) , a novel\ntraining-free approach that dynamically captures and refines the attention\nallocated to image tokens at each layer. MDSAM memorizes attention patterns and\nactivates updates through alignment during decoding, enhancing focus on\nrelevant image tokens while effectively reducing hallucinations. We evaluate\nMDSAM on multiple benchmarks for tasks such as image captioning and visual\nquestion answering, demonstrating its ability to consistently reduce\nhallucinations and improve reliability. Compatible with various LVLM\narchitectures, MDSAM highlights its adaptability and effectiveness in\nmitigating hallucinations without requiring additional training or external\ntools.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "question answering"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17728", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17728", "abs": "https://arxiv.org/abs/2506.17728", "authors": ["Dalong Zhang", "Jun Xu", "Jun Zhou", "Lei Liang", "Lin Yuan", "Ling Zhong", "Mengshu Sun", "Peilong Zhao", "QiWei Wang", "Xiaorui Wang", "Xinkai Du", "YangYang Hou", "Yu Ao", "ZhaoYang Wang", "Zhengke Gui", "ZhiYing Yi", "Zhongpu Bo"], "title": "KAG-Thinker: Teaching Large Language Models to Think with Human-like Reasoning Process", "comment": null, "summary": "In this paper, we introduce KAG-Thinker, a novel human-like reasoning\nframework built upon a parameter-light large language model (LLM). Our approach\nenhances the logical coherence and contextual consistency of the thinking\nprocess in question-answering (Q\\&A) tasks on domain-specific knowledge bases\n(KBs) within LLMs. This framework simulates human cognitive mechanisms for\nhandling complex problems by establishing a structured thinking process.\nContinuing the \\textbf{Logical Form} guided retrieval and reasoning technology\nroute of KAG v0.7, firstly, it decomposes complex questions into independently\nsolvable sub-problems(also referred to as logical forms) through\n\\textbf{breadth decomposition}, each represented in two equivalent\nforms-natural language and logical function-and further classified as either\nKnowledge Retrieval or Reasoning Analysis tasks, with dependencies and\nvariables passing explicitly modeled via logical function interfaces. In the\nsolving process, the Retrieval function is used to perform knowledge retrieval\ntasks, while the Math and Deduce functions are used to perform reasoning\nanalysis tasks. Secondly, it is worth noting that, in the Knowledge Retrieval\nsub-problem tasks, LLMs and external knowledge sources are regarded as\nequivalent KBs. We use the \\textbf{knowledge boundary} model to determine the\noptimal source using self-regulatory mechanisms such as confidence calibration\nand reflective reasoning, and use the \\textbf{depth solving} model to enhance\nthe comprehensiveness of knowledge acquisition. Finally, instead of utilizing\nreinforcement learning, we employ supervised fine-tuning with multi-turn\ndialogues to align the model with our structured inference paradigm, thereby\navoiding excessive reflection. This is supported by a data evaluation framework\nand iterative corpus synthesis, which facilitate the generation of detailed\nreasoning trajectories...", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18183", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.18183", "abs": "https://arxiv.org/abs/2506.18183", "authors": ["Zhiting Mei", "Christina Zhang", "Tenny Yin", "Justin Lidard", "Ola Shorinwa", "Anirudha Majumdar"], "title": "Reasoning about Uncertainty: Do Reasoning Models Know When They Don't Know?", "comment": null, "summary": "Reasoning language models have set state-of-the-art (SOTA) records on many\nchallenging benchmarks, enabled by multi-step reasoning induced using\nreinforcement learning. However, like previous language models, reasoning\nmodels are prone to generating confident, plausible responses that are\nincorrect (hallucinations). Knowing when and how much to trust these models is\ncritical to the safe deployment of reasoning models in real-world applications.\nTo this end, we explore uncertainty quantification of reasoning models in this\nwork. Specifically, we ask three fundamental questions: First, are reasoning\nmodels well-calibrated? Second, does deeper reasoning improve model\ncalibration? Finally, inspired by humans' innate ability to double-check their\nthought processes to verify the validity of their answers and their confidence,\nwe ask: can reasoning models improve their calibration by explicitly reasoning\nabout their chain-of-thought traces? We introduce introspective uncertainty\nquantification (UQ) to explore this direction. In extensive evaluations on SOTA\nreasoning models across a broad range of benchmarks, we find that reasoning\nmodels: (i) are typically overconfident, with self-verbalized confidence\nestimates often greater than 85% particularly for incorrect responses, (ii)\nbecome even more overconfident with deeper reasoning, and (iii) can become\nbetter calibrated through introspection (e.g., o3-Mini and DeepSeek R1) but not\nuniformly (e.g., Claude 3.7 Sonnet becomes more poorly calibrated). Lastly, we\nconclude with important research directions to design necessary UQ benchmarks\nand improve the calibration of reasoning models.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["multi-step reasoning"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17871", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.17871", "abs": "https://arxiv.org/abs/2506.17871", "authors": ["Chenghao Yang", "Ari Holtzman"], "title": "How Alignment Shrinks the Generative Horizon", "comment": "Codebase: https://github.com/yangalan123/LLMBranchingFactor, Website:\n  https://yangalan123.github.io/branching_factor/", "summary": "Despite their impressive capabilities, aligned large language models (LLMs)\noften generate outputs that lack diversity. What drives this stability in the\ngeneration? We investigate this phenomenon through the lens of probability\nconcentration in the model's output distribution. To quantify this\nconcentration, we introduce the Branching Factor (BF) -- a token-invariant\nmeasure of the effective number of plausible next steps during generation. Our\nempirical analysis reveals two key findings: (1) BF often decreases as\ngeneration progresses, suggesting that LLMs become more predictable as they\ngenerate. (2) alignment tuning substantially sharpens the model's output\ndistribution from the outset, reducing BF by nearly an order of magnitude\n(e.g., from 12 to 1.2) relative to base models. This stark reduction helps\nexplain why aligned models often appear less sensitive to decoding strategies.\nBuilding on this insight, we find this stability has surprising implications\nfor complex reasoning. Aligned Chain-of-Thought (CoT) models (e.g.,\nDeepSeek-distilled models), for instance, leverage this effect; by generating\nlonger reasoning chains, they push generation into later, more deterministic\n(lower BF) stages, resulting in more stable outputs. We hypothesize that\nalignment tuning does not fundamentally change a model's behavior, but instead\nsteers it toward stylistic tokens (e.g., \"Sure\") that unlock low-entropy\ntrajectories already present in the base model. This view is supported by\nnudging experiments, which show that prompting base models with such tokens can\nsimilarly reduce BF. Together, our findings establish BF as a powerful\ndiagnostic for understanding and controlling LLM outputs - clarifying how\nalignment reduces variability, how CoT promotes stable generations, and how\nbase models can be steered away from diversity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17733", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17733", "abs": "https://arxiv.org/abs/2506.17733", "authors": ["Mengqi Lei", "Siqi Li", "Yihong Wu", "Han Hu", "You Zhou", "Xinhu Zheng", "Guiguang Ding", "Shaoyi Du", "Zongze Wu", "Yue Gao"], "title": "YOLOv13: Real-Time Object Detection with Hypergraph-Enhanced Adaptive Visual Perception", "comment": null, "summary": "The YOLO series models reign supreme in real-time object detection due to\ntheir superior accuracy and computational efficiency. However, both the\nconvolutional architectures of YOLO11 and earlier versions and the area-based\nself-attention mechanism introduced in YOLOv12 are limited to local information\naggregation and pairwise correlation modeling, lacking the capability to\ncapture global multi-to-multi high-order correlations, which limits detection\nperformance in complex scenarios. In this paper, we propose YOLOv13, an\naccurate and lightweight object detector. To address the above-mentioned\nchallenges, we propose a Hypergraph-based Adaptive Correlation Enhancement\n(HyperACE) mechanism that adaptively exploits latent high-order correlations\nand overcomes the limitation of previous methods that are restricted to\npairwise correlation modeling based on hypergraph computation, achieving\nefficient global cross-location and cross-scale feature fusion and enhancement.\nSubsequently, we propose a Full-Pipeline Aggregation-and-Distribution (FullPAD)\nparadigm based on HyperACE, which effectively achieves fine-grained information\nflow and representation synergy within the entire network by distributing\ncorrelation-enhanced features to the full pipeline. Finally, we propose to\nleverage depthwise separable convolutions to replace vanilla large-kernel\nconvolutions, and design a series of blocks that significantly reduce\nparameters and computational complexity without sacrificing performance. We\nconduct extensive experiments on the widely used MS COCO benchmark, and the\nexperimental results demonstrate that our method achieves state-of-the-art\nperformance with fewer parameters and FLOPs. Specifically, our YOLOv13-N\nimproves mAP by 3.0\\% over YOLO11-N and by 1.5\\% over YOLOv12-N. The code and\nmodels of our YOLOv13 model are available at:\nhttps://github.com/iMoonLab/yolov13.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "correlation", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18428", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18428", "abs": "https://arxiv.org/abs/2506.18428", "authors": ["Feng He", "Zhenyang Liu", "Marco Valentino", "Zhixue Zhao"], "title": "How Robust is Model Editing after Fine-Tuning? An Empirical Study on Text-to-Image Diffusion Models", "comment": null, "summary": "Model editing offers a low-cost technique to inject or correct a particular\nbehavior in a pre-trained model without extensive retraining, supporting\napplications such as factual correction and bias mitigation. Despite this\ncommon practice, it remains unknown whether edits persist after fine-tuning or\nwhether they are inadvertently reversed. This question has fundamental\npractical implications. For example, if fine-tuning removes prior edits, it\ncould serve as a defence mechanism against hidden malicious edits. Vice versa,\nthe unintended removal of edits related to bias mitigation could pose serious\nsafety concerns. We systematically investigate the interaction between model\nediting and fine-tuning in the context of T2I diffusion models, which are known\nto exhibit biases and generate inappropriate content. Our study spans two T2I\nmodel families (Stable Diffusion and FLUX), two sota editing techniques, and\nthree fine-tuning methods (DreamBooth, LoRA, and DoRA). Through an extensive\nempirical analysis across diverse editing tasks and evaluation metrics, our\nfindings reveal a trend: edits generally fail to persist through fine-tuning,\neven when fine-tuning is tangential or unrelated to the edits. Notably, we\nobserve that DoRA exhibits the strongest edit reversal effect. At the same\ntime, among editing methods, UCE demonstrates greater robustness, retaining\nsignificantly higher efficacy post-fine-tuning compared to ReFACT. These\nfindings highlight a crucial limitation in current editing methodologies,\nemphasizing the need for more robust techniques to ensure reliable long-term\ncontrol and alignment of deployed AI systems. These findings have dual\nimplications for AI safety: they suggest that fine-tuning could serve as a\nremediation mechanism for malicious edits while simultaneously highlighting the\nneed for re-editing after fine-tuning to maintain beneficial safety and\nalignment properties.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18538", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18538", "abs": "https://arxiv.org/abs/2506.18538", "authors": ["Rifat Ara Shams", "Didar Zowghi", "Muneera Bano"], "title": "A Question Bank to Assess AI Inclusivity: Mapping out the Journey from Diversity Errors to Inclusion Excellence", "comment": null, "summary": "Ensuring diversity and inclusion (D&I) in artificial intelligence (AI) is\ncrucial for mitigating biases and promoting equitable decision-making. However,\nexisting AI risk assessment frameworks often overlook inclusivity, lacking\nstandardized tools to measure an AI system's alignment with D&I principles.\nThis paper introduces a structured AI inclusivity question bank, a\ncomprehensive set of 253 questions designed to evaluate AI inclusivity across\nfive pillars: Humans, Data, Process, System, and Governance. The development of\nthe question bank involved an iterative, multi-source approach, incorporating\ninsights from literature reviews, D&I guidelines, Responsible AI frameworks,\nand a simulated user study. The simulated evaluation, conducted with 70\nAI-generated personas related to different AI jobs, assessed the question\nbank's relevance and effectiveness for AI inclusivity across diverse roles and\napplication domains. The findings highlight the importance of integrating D&I\nprinciples into AI development workflows and governance structures. The\nquestion bank provides an actionable tool for researchers, practitioners, and\npolicymakers to systematically assess and enhance the inclusivity of AI\nsystems, paving the way for more equitable and responsible AI technologies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17858", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17858", "abs": "https://arxiv.org/abs/2506.17858", "authors": ["Yingcheng Liu", "Peiqi Wang", "Sebastian Diaz", "Esra Abaci Turk", "Benjamin Billot", "Patricia Ellen Grant", "Polina Golland"], "title": "Fetuses Made Simple: Modeling and Tracking of Fetal Shape and Pose", "comment": null, "summary": "Analyzing fetal body motion and shape is paramount in prenatal diagnostics\nand monitoring. Existing methods for fetal MRI analysis mainly rely on\nanatomical keypoints or volumetric body segmentations. Keypoints simplify body\nstructure to facilitate motion analysis, but may ignore important details of\nfull-body shape. Body segmentations capture complete shape information but\ncomplicate temporal analysis due to large non-local fetal movements. To address\nthese limitations, we construct a 3D articulated statistical fetal body model\nbased on the Skinned Multi-Person Linear Model (SMPL). Our algorithm\niteratively estimates body pose in the image space and body shape in the\ncanonical pose space. This approach improves robustness to MRI motion artifacts\nand intensity distortions, and reduces the impact of incomplete surface\nobservations due to challenging fetal poses. We train our model on\nsegmentations and keypoints derived from $19,816$ MRI volumes across $53$\nsubjects. Our model captures body shape and motion across time series and\nprovides intuitive visualization. Furthermore, it enables automated\nanthropometric measurements traditionally difficult to obtain from\nsegmentations and keypoints. When tested on unseen fetal body shapes, our\nmethod yields a surface alignment error of $3.2$ mm for $3$ mm MRI voxel size.\nTo our knowledge, this represents the first 3D articulated statistical fetal\nbody model, paving the way for enhanced fetal motion and shape analysis in\nprenatal diagnostics. The code is available at\nhttps://github.com/MedicalVisionGroup/fetal-smpl .", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18651", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18651", "abs": "https://arxiv.org/abs/2506.18651", "authors": ["Shuocun Yang", "Huawen Hu", "Enze Shi", "Shu Zhang"], "title": "Dual-level Behavioral Consistency for Inter-group and Intra-group Coordination in Multi-Agent Systems", "comment": null, "summary": "Behavioral diversity in Multi-agent reinforcement learning(MARL) represents\nan emerging and promising research area. Prior work has largely centered on\nintra-group behavioral consistency in multi-agent systems, with limited\nattention given to behavioral consistency in multi-agent grouping scenarios. In\nthis paper, we introduce Dual-Level Behavioral Consistency (DLBC), a novel MARL\ncontrol method designed to explicitly regulate agent behaviors at both\nintra-group and inter-group levels. DLBC partitions agents into distinct groups\nand dynamically modulates behavioral diversity both within and between these\ngroups. By dynamically modulating behavioral diversity within and between these\ngroups, DLBC achieves enhanced division of labor through inter-group\nconsistency, which constrains behavioral strategies across different groups.\nSimultaneously, intra-group consistency, achieved by aligning behavioral\nstrategies within each group, fosters stronger intra-group cooperation.\nCrucially, DLBC's direct constraint of agent policy functions ensures its broad\napplicability across various algorithmic frameworks. Experimental results in\nvarious grouping cooperation scenarios demonstrate that DLBC significantly\nenhances both intra-group cooperative performance and inter-group task\nspecialization, yielding substantial performance improvements. DLBC provides\nnew ideas for behavioral consistency control of multi-intelligent body systems,\nand its potential for application in more complex tasks and dynamic\nenvironments can be further explored in the future.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18777", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18777", "abs": "https://arxiv.org/abs/2506.18777", "authors": ["Jonathan Cook", "Silvia Sapora", "Arash Ahmadian", "Akbir Khan", "Tim Rocktaschel", "Jakob Foerster", "Laura Ruis"], "title": "Programming by Backprop: LLMs Acquire Reusable Algorithmic Abstractions During Code Training", "comment": null, "summary": "Training large language models (LLMs) on source code significantly enhances\ntheir general-purpose reasoning abilities, but the mechanisms underlying this\ngeneralisation are poorly understood. In this paper, we propose Programming by\nBackprop (PBB) as a potential driver of this effect - teaching a model to\nevaluate a program for inputs by training on its source code alone, without\never seeing I/O examples. To explore this idea, we finetune LLMs on two sets of\nprograms representing simple maths problems and algorithms: one with source\ncode and I/O examples (w/ IO), the other with source code only (w/o IO). We\nfind evidence that LLMs have some ability to evaluate w/o IO programs for\ninputs in a range of experimental settings, and make several observations.\nFirstly, PBB works significantly better when programs are provided as code\nrather than semantically equivalent language descriptions. Secondly, LLMs can\nproduce outputs for w/o IO programs directly, by implicitly evaluating the\nprogram within the forward pass, and more reliably when stepping through the\nprogram in-context via chain-of-thought. We further show that PBB leads to more\nrobust evaluation of programs across inputs than training on I/O pairs drawn\nfrom a distribution that mirrors naturally occurring data. Our findings suggest\na mechanism for enhanced reasoning through code training: it allows LLMs to\ninternalise reusable algorithmic abstractions. Significant scope remains for\nfuture work to enable LLMs to more effectively learn from symbolic procedures,\nand progress in this direction opens other avenues like model alignment by\ntraining on formal constitutional principles.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18129", "categories": ["cs.CL", "cs.AI", "68T50, 68T45, 03B70", "I.2.6; I.2.7; I.2.3; F.4.1"], "pdf": "https://arxiv.org/pdf/2506.18129", "abs": "https://arxiv.org/abs/2506.18129", "authors": ["Bugra Kilictas", "Faruk Alpay"], "title": "$φ^{\\infty}$: Clause Purification, Embedding Realignment, and the Total Suppression of the Em Dash in Autoregressive Language Models", "comment": "16 pages, 3 figures", "summary": "We identify a critical vulnerability in autoregressive transformer language\nmodels where the em dash token induces recursive semantic drift, leading to\nclause boundary hallucination and embedding space entanglement. Through formal\nanalysis of token-level perturbations in semantic lattices, we demonstrate that\nem dash insertion fundamentally alters the model's latent representations,\ncausing compounding errors in long-form generation. We propose a novel solution\ncombining symbolic clause purification via the phi-infinity operator with\ntargeted embedding matrix realignment. Our approach enables total suppression\nof problematic tokens without requiring model retraining, while preserving\nsemantic coherence through fixed-point convergence guarantees. Experimental\nvalidation shows significant improvements in generation consistency and topic\nmaintenance. This work establishes a general framework for identifying and\nmitigating token-level vulnerabilities in foundation models, with immediate\nimplications for AI safety, model alignment, and robust deployment of large\nlanguage models in production environments. The methodology extends beyond\npunctuation to address broader classes of recursive instabilities in neural\ntext generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17901", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.17901", "abs": "https://arxiv.org/abs/2506.17901", "authors": ["Yixuan Wu", "Yang Zhang", "Jian Wu", "Philip Torr", "Jindong Gu"], "title": "PostAlign: Multimodal Grounding as a Corrective Lens for MLLMs", "comment": null, "summary": "Multimodal Large Language Models (MLLMs) excel in vision-language tasks, such\nas image captioning and visual question answering. However, they often suffer\nfrom over-reliance on spurious correlations, primarily due to linguistic priors\nthat distract the model from leveraging actual visual information. To address\nthese issues, we introduce MMGrounded-PostAlign, a post-multimodal alignment\nframework designed to enhance the visual understanding capabilities and\nmitigate the hallucinations of MLLMs. Our framework incorporates a multimodal\ngrounding module for both visual grounding, which identifies the referred\nobject in the image, and textual grounding, which generates the rationale for\nthe final answer, ensuring that outputs are anchored in both visual and textual\nevidence. To mitigate the hallucinations, we introduce a negative rejection\nmechanism in the visual grounding module to distinguish grounded entities from\nnon-existent objects influenced by linguistic biases. On the textual grounding\nside, we propose a selective reasoning mechanism that adjusts the model's\nreasoning strategy based on query complexity. Extensive evaluations are\nconducted on benchmarks such as POPE, HaloQuest, VQAv2, MME, and MMBench\nshowing significant improvements in fine-grained visual understanding and\nhallucination suppression.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering", "fine-grained"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17296", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17296", "abs": "https://arxiv.org/abs/2506.17296", "authors": ["Darius Foodeei", "Simin Fan", "Martin Jaggi"], "title": "Semantic uncertainty in advanced decoding methods for LLM generation", "comment": null, "summary": "This study investigates semantic uncertainty in large language model (LLM)\noutputs across different decoding methods, focusing on emerging techniques like\nspeculative sampling and chain-of-thought (CoT) decoding. Through experiments\non question answering, summarization, and code generation tasks, we analyze how\ndifferent decoding strategies affect both the diversity and reliability of\nmodel outputs. Our findings reveal that while CoT decoding demonstrates higher\nsemantic diversity, it maintains lower predictive entropy, suggesting that\nstructured exploration can lead to more confident and accurate outputs. This is\nevidenced by a 48.8% improvement in code generation Pass@2 rates, despite lower\nalignment with reference solutions. For summarization tasks, speculative\nsampling proved particularly effective, achieving superior ROUGE scores while\nmaintaining moderate semantic diversity. Our results challenge conventional\nassumptions about trade-offs between diversity and accuracy in language model\noutputs, demonstrating that properly structured decoding methods can increase\nsemantic exploration while maintaining or improving output quality. These\nfindings have significant implications for deploying language models in\npractical applications where both reliability and diverse solution generation\nare crucial.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "accuracy", "summarization", "question answering", "code generation"], "score": 5}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17912", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2506.17912", "abs": "https://arxiv.org/abs/2506.17912", "authors": ["Chuhao Jin", "Haosen Li", "Bingzi Zhang", "Che Liu", "Xiting Wang", "Ruihua Song", "Wenbing Huang", "Ying Qin", "Fuzheng Zhang", "Di Zhang"], "title": "PlanMoGPT: Flow-Enhanced Progressive Planning for Text to Motion Synthesis", "comment": "14 pages, 7 figures", "summary": "Recent advances in large language models (LLMs) have enabled breakthroughs in\nmany multimodal generation tasks, but a significant performance gap still\nexists in text-to-motion generation, where LLM-based methods lag far behind\nnon-LLM methods. We identify the granularity of motion tokenization as a\ncritical bottleneck: fine-grained tokenization induces local dependency issues,\nwhere LLMs overemphasize short-term coherence at the expense of global semantic\nalignment, while coarse-grained tokenization sacrifices motion details. To\nresolve this issue, we propose PlanMoGPT, an LLM-based framework integrating\nprogressive planning and flow-enhanced fine-grained motion tokenization. First,\nour progressive planning mechanism leverages LLMs' autoregressive capabilities\nto hierarchically generate motion tokens by starting from sparse global plans\nand iteratively refining them into full sequences. Second, our flow-enhanced\ntokenizer doubles the downsampling resolution and expands the codebook size by\neight times, minimizing detail loss during discretization, while a\nflow-enhanced decoder recovers motion nuances. Extensive experiments on\ntext-to-motion benchmarks demonstrate that it achieves state-of-the-art\nperformance, improving FID scores by 63.8% (from 0.380 to 0.141) on\nlong-sequence generation while enhancing motion diversity by 49.9% compared to\nexisting methods. The proposed framework successfully resolves the\ndiversity-quality trade-off that plagues current non-LLM approaches,\nestablishing new standards for text-to-motion generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17931", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.17931", "abs": "https://arxiv.org/abs/2506.17931", "authors": ["Ravi Kant Gupta", "Shounak Das", "Amit Sethi"], "title": "IDAL: Improved Domain Adaptive Learning for Natural Images Dataset", "comment": "Accepted in ICPR'24 (International Conference on Pattern Recognition)", "summary": "We present a novel approach for unsupervised domain adaptation (UDA) for\nnatural images. A commonly-used objective for UDA schemes is to enhance domain\nalignment in representation space even if there is a domain shift in the input\nspace. Existing adversarial domain adaptation methods may not effectively align\ndifferent domains of multimodal distributions associated with classification\nproblems. Our approach has two main features. Firstly, its neural architecture\nuses the deep structure of ResNet and the effective separation of scales of\nfeature pyramidal network (FPN) to work with both content and style features.\nSecondly, it uses a combination of a novel loss function and judiciously\nselected existing loss functions to train the network architecture. This\ntailored combination is designed to address challenges inherent to natural\nimages, such as scale, noise, and style shifts, that occur on top of a\nmulti-modal (multi-class) distribution. The combined loss function not only\nenhances model accuracy and robustness on the target domain but also speeds up\ntraining convergence. Our proposed UDA scheme generalizes better than\nstate-of-the-art for CNN-based methods on Office-Home, Office-31, and\nVisDA-2017 datasets and comaparable for DomainNet dataset.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17367", "categories": ["cs.CL", "cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2506.17367", "abs": "https://arxiv.org/abs/2506.17367", "authors": ["Mateusz Cedro", "Timour Ichmoukhamedov", "Sofie Goethals", "Yifan He", "James Hinns", "David Martens"], "title": "Cash or Comfort? How LLMs Value Your Inconvenience", "comment": "12 pages, 4 figures, 3 tables", "summary": "Large Language Models (LLMs) are increasingly proposed as near-autonomous\nartificial intelligence (AI) agents capable of making everyday decisions on\nbehalf of humans. Although LLMs perform well on many technical tasks, their\nbehaviour in personal decision-making remains less understood. Previous studies\nhave assessed their rationality and moral alignment with human decisions.\nHowever, the behaviour of AI assistants in scenarios where financial rewards\nare at odds with user comfort has not yet been thoroughly explored. In this\npaper, we tackle this problem by quantifying the prices assigned by multiple\nLLMs to a series of user discomforts: additional walking, waiting, hunger and\npain. We uncover several key concerns that strongly question the prospect of\nusing current LLMs as decision-making assistants: (1) a large variance in\nresponses between LLMs, (2) within a single LLM, responses show fragility to\nminor variations in prompt phrasing (e.g., reformulating the question in the\nfirst person can considerably alter the decision), (3) LLMs can accept\nunreasonably low rewards for major inconveniences (e.g., 1 Euro to wait 10\nhours), and (4) LLMs can reject monetary gains where no discomfort is imposed\n(e.g., 1,000 Euro to wait 0 minutes). These findings emphasize the need for\nscrutiny of how LLMs value human inconvenience, particularly as we move toward\napplications where such cash-versus-comfort trade-offs are made on users'\nbehalf.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18532", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18532", "abs": "https://arxiv.org/abs/2506.18532", "authors": ["Mengjie Qian", "Rao Ma", "Stefano Bannò", "Mark J. F. Gales", "Kate M. Knill"], "title": "End-to-End Spoken Grammatical Error Correction", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "Grammatical Error Correction (GEC) and feedback play a vital role in\nsupporting second language (L2) learners, educators, and examiners. While\nwritten GEC is well-established, spoken GEC (SGEC), aiming to provide feedback\nbased on learners' speech, poses additional challenges due to disfluencies,\ntranscription errors, and the lack of structured input. SGEC systems typically\nfollow a cascaded pipeline consisting of Automatic Speech Recognition (ASR),\ndisfluency detection, and GEC, making them vulnerable to error propagation\nacross modules. This work examines an End-to-End (E2E) framework for SGEC and\nfeedback generation, highlighting challenges and possible solutions when\ndeveloping these systems. Cascaded, partial-cascaded and E2E architectures are\ncompared, all built on the Whisper foundation model. A challenge for E2E\nsystems is the scarcity of GEC labeled spoken data. To address this, an\nautomatic pseudo-labeling framework is examined, increasing the training data\nfrom 77 to over 2500 hours. To improve the accuracy of the SGEC system,\nadditional contextual information, exploiting the ASR output, is investigated.\nCandidate feedback of their mistakes is an essential step to improving\nperformance. In E2E systems the SGEC output must be compared with an estimate\nof the fluent transcription to obtain the feedback. To improve the precision of\nthis feedback, a novel reference alignment process is proposed that aims to\nremove hypothesised edits that results from fluent transcription errors.\nFinally, these approaches are combined with an edit confidence estimation\napproach, to exclude low-confidence edits. Experiments on the in-house\nLinguaskill (LNG) corpora and the publicly available Speak & Improve (S&I)\ncorpus show that the proposed approaches significantly boost E2E SGEC\nperformance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18535", "categories": ["cs.CL", "cs.IR"], "pdf": "https://arxiv.org/pdf/2506.18535", "abs": "https://arxiv.org/abs/2506.18535", "authors": ["Manu Pande", "Shahil Kumar", "Anay Yatin Damle"], "title": "When Fine-Tuning Fails: Lessons from MS MARCO Passage Ranking", "comment": null, "summary": "This paper investigates the counterintuitive phenomenon where fine-tuning\npre-trained transformer models degrades performance on the MS MARCO passage\nranking task. Through comprehensive experiments involving five model\nvariants-including full parameter fine-tuning and parameter efficient LoRA\nadaptations-we demonstrate that all fine-tuning approaches underperform the\nbase sentence-transformers/all- MiniLM-L6-v2 model (MRR@10: 0.3026). Our\nanalysis reveals that fine-tuning disrupts the optimal embedding space\nstructure learned during the base model's extensive pre-training on 1 billion\nsentence pairs, including 9.1 million MS MARCO samples. UMAP visualizations\nshow progressive embedding space flattening, while training dynamics analysis\nand computational efficiency metrics further support our findings. These\nresults challenge conventional wisdom about transfer learning effectiveness on\nsaturated benchmarks and suggest architectural innovations may be necessary for\nmeaningful improvements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18042", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18042", "abs": "https://arxiv.org/abs/2506.18042", "authors": ["Dongdong Meng", "Sheng Li", "Hao Wu", "Suqing Tian", "Wenjun Ma", "Guoping Wang", "Xueqing Yan"], "title": "CmFNet: Cross-modal Fusion Network for Weakly-supervised Segmentation of Medical Images", "comment": "10 pages, 6 figures", "summary": "Accurate automatic medical image segmentation relies on high-quality, dense\nannotations, which are costly and time-consuming. Weakly supervised learning\nprovides a more efficient alternative by leveraging sparse and coarse\nannotations instead of dense, precise ones. However, segmentation performance\ndegradation and overfitting caused by sparse annotations remain key challenges.\nTo address these issues, we propose CmFNet, a novel 3D weakly supervised\ncross-modal medical image segmentation approach. CmFNet consists of three main\ncomponents: a modality-specific feature learning network, a cross-modal feature\nlearning network, and a hybrid-supervised learning strategy. Specifically, the\nmodality-specific feature learning network and the cross-modal feature learning\nnetwork effectively integrate complementary information from multi-modal\nimages, enhancing shared features across modalities to improve segmentation\nperformance. Additionally, the hybrid-supervised learning strategy guides\nsegmentation through scribble supervision, intra-modal regularization, and\ninter-modal consistency, modeling spatial and contextual relationships while\npromoting feature alignment. Our approach effectively mitigates overfitting,\ndelivering robust segmentation results. It excels in segmenting both\nchallenging small tumor regions and common anatomical structures. Extensive\nexperiments on a clinical cross-modal nasopharyngeal carcinoma (NPC) dataset\n(including CT and MR imaging) and the publicly available CT Whole Abdominal\nOrgan dataset (WORD) show that our approach outperforms state-of-the-art weakly\nsupervised methods. In addition, our approach also outperforms fully supervised\nmethods when full annotation is used. Our approach can facilitate clinical\ntherapy and benefit various specialists, including physicists, radiologists,\npathologists, and oncologists.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation", "consistency"], "score": 3}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18048", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18048", "abs": "https://arxiv.org/abs/2506.18048", "authors": ["Fanyi Wang", "Binzhi Dong", "Haotian Hu", "Jinjin Xu", "Zhiwang Zhang"], "title": "CLGRPO: Reasoning Ability Enhancement for Small VLMs", "comment": "11 pages, 5 figures", "summary": "Small Vision Language Models (SVLMs) generally refer to models with parameter\nsizes less than or equal to 2B. Their low cost and power consumption\ncharacteristics confer high commercial value. However, their reasoning\nabilities are limited by the number of parameters. To address this issue, this\npaper proposes a post-training optimization paradigm called the Incremental\nTraining Strategy to enhance the reasoning ability of SVLMs. Firstly, we\nconstructed a Self-Supervised Chain-of-Thought (COT) Data Construction System,\nwhich leverages multiple LVLMs with 7B parameters or more to transform original\ndata into COT data in a self-supervised manner. Our proposed Incremental\nTraining Strategy consists of four stages. Stage 1 injects domain knowledge by\nperforming Supervised Fine-Tuning (SFT) to the pretrained model on the COT\ndata. Stage 2 aligns the COT data format by conducting a small amount of Group\nRelative Policy Optimization (GRPO) training constrained only by format rewards\non the COT data. Stage 3 enhances reasoning ability by applying GRPO training\non the COT data with constraints on both format and accuracy rewards. The\nresulting model shows significant improvement compared to the baseline. Stage 4\naddresses the limited capacity of the SVLMs and the weak ability to capture\ncomplex patterns by proposing ClipLow GRPO (CLGRPO) to constrain the capture\nspace of the training process. We conducted extensive comparative and ablation\nexperiments on the abstract semantic recognition dataset EMOSet-118K.\nExperimental results demonstrate that our method significantly improves the\nreasoning ability of 1B SVLM. Compared to the baseline model fine-tuned on the\noriginal data, accuracy increased by 2.77 and recall by 0.69, achieving\nperformance comparable to that of 8B models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18639", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.18639", "abs": "https://arxiv.org/abs/2506.18639", "authors": ["Zébulon Goriely", "Suchir Salhan", "Pietro Lesci", "Julius Cheng", "Paula Buttery"], "title": "ByteSpan: Information-Driven Subword Tokenisation", "comment": "Accepted to TokShop 2025 (Non-archival)", "summary": "Recent dynamic tokenisation methods operate directly on bytes and pool their\nlatent representations into patches. This bears similarities to computational\nmodels of word segmentation that determine lexical boundaries using spikes in\nan autoregressive model's prediction error. Inspired by this connection, we\nexplore whether grouping predictable bytes - rather than pooling their\nrepresentations - can yield a useful fixed subword vocabulary. We propose a new\ninformation-driven subword tokeniser, ByteSpan, that uses an external\nbyte-level LM during training to identify contiguous predictable byte sequences\nand group them into subwords. Experiments show that ByteSpan yields efficient\nvocabularies with higher morphological alignment scores than BPE for English.\nMultilingual experiments show similar compression and R\\'enyi efficiency for 25\nlanguages.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17728", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.17728", "abs": "https://arxiv.org/abs/2506.17728", "authors": ["Dalong Zhang", "Jun Xu", "Jun Zhou", "Lei Liang", "Lin Yuan", "Ling Zhong", "Mengshu Sun", "Peilong Zhao", "QiWei Wang", "Xiaorui Wang", "Xinkai Du", "YangYang Hou", "Yu Ao", "ZhaoYang Wang", "Zhengke Gui", "ZhiYing Yi", "Zhongpu Bo"], "title": "KAG-Thinker: Teaching Large Language Models to Think with Human-like Reasoning Process", "comment": null, "summary": "In this paper, we introduce KAG-Thinker, a novel human-like reasoning\nframework built upon a parameter-light large language model (LLM). Our approach\nenhances the logical coherence and contextual consistency of the thinking\nprocess in question-answering (Q\\&A) tasks on domain-specific knowledge bases\n(KBs) within LLMs. This framework simulates human cognitive mechanisms for\nhandling complex problems by establishing a structured thinking process.\nContinuing the \\textbf{Logical Form} guided retrieval and reasoning technology\nroute of KAG v0.7, firstly, it decomposes complex questions into independently\nsolvable sub-problems(also referred to as logical forms) through\n\\textbf{breadth decomposition}, each represented in two equivalent\nforms-natural language and logical function-and further classified as either\nKnowledge Retrieval or Reasoning Analysis tasks, with dependencies and\nvariables passing explicitly modeled via logical function interfaces. In the\nsolving process, the Retrieval function is used to perform knowledge retrieval\ntasks, while the Math and Deduce functions are used to perform reasoning\nanalysis tasks. Secondly, it is worth noting that, in the Knowledge Retrieval\nsub-problem tasks, LLMs and external knowledge sources are regarded as\nequivalent KBs. We use the \\textbf{knowledge boundary} model to determine the\noptimal source using self-regulatory mechanisms such as confidence calibration\nand reflective reasoning, and use the \\textbf{depth solving} model to enhance\nthe comprehensiveness of knowledge acquisition. Finally, instead of utilizing\nreinforcement learning, we employ supervised fine-tuning with multi-turn\ndialogues to align the model with our structured inference paradigm, thereby\navoiding excessive reflection. This is supported by a data evaluation framework\nand iterative corpus synthesis, which facilitate the generation of detailed\nreasoning trajectories...", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17871", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.17871", "abs": "https://arxiv.org/abs/2506.17871", "authors": ["Chenghao Yang", "Ari Holtzman"], "title": "How Alignment Shrinks the Generative Horizon", "comment": "Codebase: https://github.com/yangalan123/LLMBranchingFactor, Website:\n  https://yangalan123.github.io/branching_factor/", "summary": "Despite their impressive capabilities, aligned large language models (LLMs)\noften generate outputs that lack diversity. What drives this stability in the\ngeneration? We investigate this phenomenon through the lens of probability\nconcentration in the model's output distribution. To quantify this\nconcentration, we introduce the Branching Factor (BF) -- a token-invariant\nmeasure of the effective number of plausible next steps during generation. Our\nempirical analysis reveals two key findings: (1) BF often decreases as\ngeneration progresses, suggesting that LLMs become more predictable as they\ngenerate. (2) alignment tuning substantially sharpens the model's output\ndistribution from the outset, reducing BF by nearly an order of magnitude\n(e.g., from 12 to 1.2) relative to base models. This stark reduction helps\nexplain why aligned models often appear less sensitive to decoding strategies.\nBuilding on this insight, we find this stability has surprising implications\nfor complex reasoning. Aligned Chain-of-Thought (CoT) models (e.g.,\nDeepSeek-distilled models), for instance, leverage this effect; by generating\nlonger reasoning chains, they push generation into later, more deterministic\n(lower BF) stages, resulting in more stable outputs. We hypothesize that\nalignment tuning does not fundamentally change a model's behavior, but instead\nsteers it toward stylistic tokens (e.g., \"Sure\") that unlock low-entropy\ntrajectories already present in the base model. This view is supported by\nnudging experiments, which show that prompting base models with such tokens can\nsimilarly reduce BF. Together, our findings establish BF as a powerful\ndiagnostic for understanding and controlling LLM outputs - clarifying how\nalignment reduces variability, how CoT promotes stable generations, and how\nbase models can be steered away from diversity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18841", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18841", "abs": "https://arxiv.org/abs/2506.18841", "authors": ["Yuhao Wu", "Yushi Bai", "Zhiqiang Hu", "Roy Ka-Wei Lee", "Juanzi Li"], "title": "LongWriter-Zero: Mastering Ultra-Long Text Generation via Reinforcement Learning", "comment": null, "summary": "Ultra-long generation by large language models (LLMs) is a widely demanded\nscenario, yet it remains a significant challenge due to their maximum\ngeneration length limit and overall quality degradation as sequence length\nincreases. Previous approaches, exemplified by LongWriter, typically rely on\n''teaching'', which involves supervised fine-tuning (SFT) on synthetic\nlong-form outputs. However, this strategy heavily depends on synthetic SFT\ndata, which is difficult and costly to construct, often lacks coherence and\nconsistency, and tends to be overly artificial and structurally monotonous. In\nthis work, we propose an incentivization-based approach that, starting entirely\nfrom scratch and without relying on any annotated or synthetic data, leverages\nreinforcement learning (RL) to foster the emergence of ultra-long, high-quality\ntext generation capabilities in LLMs. We perform RL training starting from a\nbase model, similar to R1-Zero, guiding it to engage in reasoning that\nfacilitates planning and refinement during the writing process. To support\nthis, we employ specialized reward models that steer the LLM towards improved\nlength control, writing quality, and structural formatting. Experimental\nevaluations show that our LongWriter-Zero model, trained from Qwen2.5-32B,\nconsistently outperforms traditional SFT methods on long-form writing tasks,\nachieving state-of-the-art results across all metrics on WritingBench and\nArena-Write, and even surpassing 100B+ models such as DeepSeek R1 and\nQwen3-235B. We open-source our data and model checkpoints under\nhttps://huggingface.co/THU-KEG/LongWriter-Zero-32B", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17931", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.17931", "abs": "https://arxiv.org/abs/2506.17931", "authors": ["Ravi Kant Gupta", "Shounak Das", "Amit Sethi"], "title": "IDAL: Improved Domain Adaptive Learning for Natural Images Dataset", "comment": "Accepted in ICPR'24 (International Conference on Pattern Recognition)", "summary": "We present a novel approach for unsupervised domain adaptation (UDA) for\nnatural images. A commonly-used objective for UDA schemes is to enhance domain\nalignment in representation space even if there is a domain shift in the input\nspace. Existing adversarial domain adaptation methods may not effectively align\ndifferent domains of multimodal distributions associated with classification\nproblems. Our approach has two main features. Firstly, its neural architecture\nuses the deep structure of ResNet and the effective separation of scales of\nfeature pyramidal network (FPN) to work with both content and style features.\nSecondly, it uses a combination of a novel loss function and judiciously\nselected existing loss functions to train the network architecture. This\ntailored combination is designed to address challenges inherent to natural\nimages, such as scale, noise, and style shifts, that occur on top of a\nmulti-modal (multi-class) distribution. The combined loss function not only\nenhances model accuracy and robustness on the target domain but also speeds up\ntraining convergence. Our proposed UDA scheme generalizes better than\nstate-of-the-art for CNN-based methods on Office-Home, Office-31, and\nVisDA-2017 datasets and comaparable for DomainNet dataset.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18209", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18209", "abs": "https://arxiv.org/abs/2506.18209", "authors": ["Zhisen Hu", "Dominic Cullen", "Peter Thompson", "David Johnson", "Chang Bian", "Aleksei Tiulpin", "Timothy Cootes", "Claudia Lindner"], "title": "Deep Learning-based Alignment Measurement in Knee Radiographs", "comment": "Accepted to MICCAI 2025", "summary": "Radiographic knee alignment (KA) measurement is important for predicting\njoint health and surgical outcomes after total knee replacement. Traditional\nmethods for KA measurements are manual, time-consuming and require long-leg\nradiographs. This study proposes a deep learning-based method to measure KA in\nanteroposterior knee radiographs via automatically localized knee anatomical\nlandmarks. Our method builds on hourglass networks and incorporates an\nattention gate structure to enhance robustness and focus on key anatomical\nfeatures. To our knowledge, this is the first deep learning-based method to\nlocalize over 100 knee anatomical landmarks to fully outline the knee shape\nwhile integrating KA measurements on both pre-operative and post-operative\nimages. It provides highly accurate and reliable anatomical varus/valgus KA\nmeasurements using the anatomical tibiofemoral angle, achieving mean absolute\ndifferences ~1{\\deg} when compared to clinical ground truth measurements.\nAgreement between automated and clinical measurements was excellent\npre-operatively (intra-class correlation coefficient (ICC) = 0.97) and good\npost-operatively (ICC = 0.86). Our findings demonstrate that KA assessment can\nbe automated with high accuracy, creating opportunities for digitally enhanced\nclinical workflows.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "agreement", "accuracy"], "score": 3}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18234", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2506.18234", "abs": "https://arxiv.org/abs/2506.18234", "authors": ["Yue Li", "Meng Tian", "Dechang Zhu", "Jiangtong Zhu", "Zhenyu Lin", "Zhiwei Xiong", "Xinhai Zhao"], "title": "Drive-R1: Bridging Reasoning and Planning in VLMs for Autonomous Driving with Reinforcement Learning", "comment": null, "summary": "Large vision-language models (VLMs) for autonomous driving (AD) are evolving\nbeyond perception and cognition tasks toward motion planning. However, we\nidentify two critical challenges in this direction: (1) VLMs tend to learn\nshortcuts by relying heavily on history input information, achieving seemingly\nstrong planning results without genuinely understanding the visual inputs; and\n(2) the chain-ofthought (COT) reasoning processes are always misaligned with\nthe motion planning outcomes, and how to effectively leverage the complex\nreasoning capability to enhance planning remains largely underexplored. In this\npaper, we start from a small-scale domain-specific VLM and propose Drive-R1\ndesigned to bridges the scenario reasoning and motion planning for AD. Drive-R1\nfirst undergoes the supervised finetuning on a elaborate dataset containing\nboth long and short COT data. Drive-R1 is encouraged to reason step-by-step\nfrom visual input to final planning decisions. Subsequently, Drive-R1 is\ntrained within a reinforcement learning framework that incentivizes the\ndiscovery of reasoning paths that are more informative for planning, guided by\nrewards based on predicted trajectories and meta actions. Experimental\nevaluations on the nuScenes and DriveLM-nuScenes benchmarks demonstrate that\nDrive-R1 achieves superior performance compared to existing state-of-the-art\nVLMs. We believe that Drive-R1 presents a promising direction for bridging\nreasoning and planning in AD, offering methodological insights for future\nresearch and applications.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.17930", "categories": ["cs.AI", "cs.CL", "cs.LG", "cs.NE", "cs.RO"], "pdf": "https://arxiv.org/pdf/2506.17930", "abs": "https://arxiv.org/abs/2506.17930", "authors": ["Jianyu Wang", "Zhiqiang Hu", "Lidong Bing"], "title": "Evolving Prompts In-Context: An Open-ended, Self-replicating Perspective", "comment": "ICML 2025, and Code will be released at:\n  https://github.com/jianyu-cs/PromptQuine/", "summary": "We propose a novel prompt design paradigm that challenges conventional wisdom\nin large language model (LLM) prompting. While conventional wisdom prioritizes\nwell-crafted instructions and demonstrations for in-context learning (ICL), we\nshow that pruning random demonstrations into seemingly incoherent \"gibberish\"\ncan remarkably improve performance across diverse tasks. Notably, the\n\"gibberish\" always matches or surpasses state-of-the-art automatic prompt\noptimization techniques, achieving substantial gains regardless of LLM\nalignment. Nevertheless, discovering an effective pruning strategy is\nnon-trivial, as existing attribution methods and prompt compression algorithms\nfail to deliver robust results, let alone human intuition. In terms of this, we\npropose a self-discover prompt optimization framework, PromptQuine, an\nevolutionary search framework that automatically searches for the pruning\nstrategy by itself using only low-data regimes. Much like the emergent\ncomplexity in nature--such as symbiosis and self-organization--arising in\nresponse to resource constraints, our framework evolves and refines\nunconventional yet highly effective prompts by leveraging only the tokens\npresent within the context. We demonstrate its effectiveness across\nclassification, multi-choice question answering, generation and math reasoning\ntasks across LLMs, while achieving decent runtime efficiency. We hope our\nfindings can guide mechanistic studies on in-context learning, and provide a\ncall to action, to pave the way for more open-ended search algorithms for more\neffective LLM prompting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18246", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18246", "abs": "https://arxiv.org/abs/2506.18246", "authors": ["Xiangzhao Hao", "Kuan Zhu", "Hongyu Guo", "Haiyun Guo", "Ming Tang", "JinQiao Wang"], "title": "Referring Expression Instance Retrieval and A Strong End-to-End Baseline", "comment": null, "summary": "Natural language querying of visual content underpins many vision-language\ntasks, typically categorized by text granularity and visual search scope.\nText-Image Retrieval (TIR) retrieves whole images using coarse descriptions,\nwhile Referring Expression Comprehension (REC) localizes objects using\nfine-grained expressions within a single image. However, real-world scenarios\noften require both instance-level retrieval and localization across large\ngalleries -- tasks where TIR lacks precision and REC lacks scalability. To\naddress this gap, we propose a new task: Referring Expression Instance\nRetrieval (REIR), which jointly supports instance-level retrieval and\nlocalization. We introduce REIRCOCO, a large-scale benchmark constructed by\nprompting vision-language models to generate fine-grained expressions for\nMSCOCO and RefCOCO instances. We also present a baseline method, CLARE,\nfeaturing a dual-stream architecture with a Mix of Relation Experts (MORE)\nmodule for capturing inter-instance relationships. CLARE integrates object\ndetection and REC pretraining with Contrastive Language-Instance Alignment\n(CLIA) for end-to-end optimization. Experiments show that CLARE achieves\nstate-of-the-art performance on REIR and generalizes well to TIR and REC,\nhighlighting its effectiveness and versatility.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "fine-grained"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18248", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18248", "abs": "https://arxiv.org/abs/2506.18248", "authors": ["Jongoh Jeong", "Hunmin Yang", "Jaeseok Jeong", "Kuk-Jin Yoon"], "title": "Semantic Structure-Aware Generative Attacks for Enhanced Adversarial Transferability", "comment": null, "summary": "Generative adversarial attacks train a perturbation generator on a white-box\nsurrogate model and subsequently apply the crafted perturbations to unseen\nblack-box victim models. In contrast to iterative attacks, these methods\ndeliver superior inference-time efficiency, scalability, and transferability;\nhowever, up until now, existing studies have not fully exploited the\nrepresentational capacity of generative models to preserve and harness semantic\ninformation. Specifically, the intermediate activations of the generator encode\nrich semantic features--object boundaries and coarse shapes--that remain\nunder-exploited, thereby limiting the alignment of perturbations with\nobject-salient regions which are critical for adversarial transferability. To\nremedy this, we introduce a semantic structure-aware attack framework based on\nthe Mean Teacher, which serves as a temporally smoothed feature reference. With\nthis smoothed reference, we further direct semantic consistency between the\nearly-layer activations in the student and those of the semantically rich\nteacher by feature distillation. By anchoring perturbation synthesis to the\nsemantically salient early intermediate blocks within the generator based on\nempirical findings, our method guides progressive adversarial perturbation on\nregions that substantially enhance adversarial transferability. We conduct\nextensive experiments over diverse models, domains and tasks to demonstrate\nconsistent improvements relative to state-of-the-art generative attacks,\ncomprehensively evaluated using conventional metrics and our newly proposed\nAccidental Correction Rate (ACR).", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18183", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.18183", "abs": "https://arxiv.org/abs/2506.18183", "authors": ["Zhiting Mei", "Christina Zhang", "Tenny Yin", "Justin Lidard", "Ola Shorinwa", "Anirudha Majumdar"], "title": "Reasoning about Uncertainty: Do Reasoning Models Know When They Don't Know?", "comment": null, "summary": "Reasoning language models have set state-of-the-art (SOTA) records on many\nchallenging benchmarks, enabled by multi-step reasoning induced using\nreinforcement learning. However, like previous language models, reasoning\nmodels are prone to generating confident, plausible responses that are\nincorrect (hallucinations). Knowing when and how much to trust these models is\ncritical to the safe deployment of reasoning models in real-world applications.\nTo this end, we explore uncertainty quantification of reasoning models in this\nwork. Specifically, we ask three fundamental questions: First, are reasoning\nmodels well-calibrated? Second, does deeper reasoning improve model\ncalibration? Finally, inspired by humans' innate ability to double-check their\nthought processes to verify the validity of their answers and their confidence,\nwe ask: can reasoning models improve their calibration by explicitly reasoning\nabout their chain-of-thought traces? We introduce introspective uncertainty\nquantification (UQ) to explore this direction. In extensive evaluations on SOTA\nreasoning models across a broad range of benchmarks, we find that reasoning\nmodels: (i) are typically overconfident, with self-verbalized confidence\nestimates often greater than 85% particularly for incorrect responses, (ii)\nbecome even more overconfident with deeper reasoning, and (iii) can become\nbetter calibrated through introspection (e.g., o3-Mini and DeepSeek R1) but not\nuniformly (e.g., Claude 3.7 Sonnet becomes more poorly calibrated). Lastly, we\nconclude with important research directions to design necessary UQ benchmarks\nand improve the calibration of reasoning models.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["multi-step reasoning"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18129", "categories": ["cs.CL", "cs.AI", "68T50, 68T45, 03B70", "I.2.6; I.2.7; I.2.3; F.4.1"], "pdf": "https://arxiv.org/pdf/2506.18129", "abs": "https://arxiv.org/abs/2506.18129", "authors": ["Bugra Kilictas", "Faruk Alpay"], "title": "$φ^{\\infty}$: Clause Purification, Embedding Realignment, and the Total Suppression of the Em Dash in Autoregressive Language Models", "comment": "16 pages, 3 figures", "summary": "We identify a critical vulnerability in autoregressive transformer language\nmodels where the em dash token induces recursive semantic drift, leading to\nclause boundary hallucination and embedding space entanglement. Through formal\nanalysis of token-level perturbations in semantic lattices, we demonstrate that\nem dash insertion fundamentally alters the model's latent representations,\ncausing compounding errors in long-form generation. We propose a novel solution\ncombining symbolic clause purification via the phi-infinity operator with\ntargeted embedding matrix realignment. Our approach enables total suppression\nof problematic tokens without requiring model retraining, while preserving\nsemantic coherence through fixed-point convergence guarantees. Experimental\nvalidation shows significant improvements in generation consistency and topic\nmaintenance. This work establishes a general framework for identifying and\nmitigating token-level vulnerabilities in foundation models, with immediate\nimplications for AI safety, model alignment, and robust deployment of large\nlanguage models in production environments. The methodology extends beyond\npunctuation to address broader classes of recursive instabilities in neural\ntext generation systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18777", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18777", "abs": "https://arxiv.org/abs/2506.18777", "authors": ["Jonathan Cook", "Silvia Sapora", "Arash Ahmadian", "Akbir Khan", "Tim Rocktaschel", "Jakob Foerster", "Laura Ruis"], "title": "Programming by Backprop: LLMs Acquire Reusable Algorithmic Abstractions During Code Training", "comment": null, "summary": "Training large language models (LLMs) on source code significantly enhances\ntheir general-purpose reasoning abilities, but the mechanisms underlying this\ngeneralisation are poorly understood. In this paper, we propose Programming by\nBackprop (PBB) as a potential driver of this effect - teaching a model to\nevaluate a program for inputs by training on its source code alone, without\never seeing I/O examples. To explore this idea, we finetune LLMs on two sets of\nprograms representing simple maths problems and algorithms: one with source\ncode and I/O examples (w/ IO), the other with source code only (w/o IO). We\nfind evidence that LLMs have some ability to evaluate w/o IO programs for\ninputs in a range of experimental settings, and make several observations.\nFirstly, PBB works significantly better when programs are provided as code\nrather than semantically equivalent language descriptions. Secondly, LLMs can\nproduce outputs for w/o IO programs directly, by implicitly evaluating the\nprogram within the forward pass, and more reliably when stepping through the\nprogram in-context via chain-of-thought. We further show that PBB leads to more\nrobust evaluation of programs across inputs than training on I/O pairs drawn\nfrom a distribution that mirrors naturally occurring data. Our findings suggest\na mechanism for enhanced reasoning through code training: it allows LLMs to\ninternalise reusable algorithmic abstractions. Significant scope remains for\nfuture work to enable LLMs to more effectively learn from symbolic procedures,\nand progress in this direction opens other avenues like model alignment by\ntraining on formal constitutional principles.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18209", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18209", "abs": "https://arxiv.org/abs/2506.18209", "authors": ["Zhisen Hu", "Dominic Cullen", "Peter Thompson", "David Johnson", "Chang Bian", "Aleksei Tiulpin", "Timothy Cootes", "Claudia Lindner"], "title": "Deep Learning-based Alignment Measurement in Knee Radiographs", "comment": "Accepted to MICCAI 2025", "summary": "Radiographic knee alignment (KA) measurement is important for predicting\njoint health and surgical outcomes after total knee replacement. Traditional\nmethods for KA measurements are manual, time-consuming and require long-leg\nradiographs. This study proposes a deep learning-based method to measure KA in\nanteroposterior knee radiographs via automatically localized knee anatomical\nlandmarks. Our method builds on hourglass networks and incorporates an\nattention gate structure to enhance robustness and focus on key anatomical\nfeatures. To our knowledge, this is the first deep learning-based method to\nlocalize over 100 knee anatomical landmarks to fully outline the knee shape\nwhile integrating KA measurements on both pre-operative and post-operative\nimages. It provides highly accurate and reliable anatomical varus/valgus KA\nmeasurements using the anatomical tibiofemoral angle, achieving mean absolute\ndifferences ~1{\\deg} when compared to clinical ground truth measurements.\nAgreement between automated and clinical measurements was excellent\npre-operatively (intra-class correlation coefficient (ICC) = 0.97) and good\npost-operatively (ICC = 0.86). Our findings demonstrate that KA assessment can\nbe automated with high accuracy, creating opportunities for digitally enhanced\nclinical workflows.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "agreement", "accuracy"], "score": 3}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18248", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18248", "abs": "https://arxiv.org/abs/2506.18248", "authors": ["Jongoh Jeong", "Hunmin Yang", "Jaeseok Jeong", "Kuk-Jin Yoon"], "title": "Semantic Structure-Aware Generative Attacks for Enhanced Adversarial Transferability", "comment": null, "summary": "Generative adversarial attacks train a perturbation generator on a white-box\nsurrogate model and subsequently apply the crafted perturbations to unseen\nblack-box victim models. In contrast to iterative attacks, these methods\ndeliver superior inference-time efficiency, scalability, and transferability;\nhowever, up until now, existing studies have not fully exploited the\nrepresentational capacity of generative models to preserve and harness semantic\ninformation. Specifically, the intermediate activations of the generator encode\nrich semantic features--object boundaries and coarse shapes--that remain\nunder-exploited, thereby limiting the alignment of perturbations with\nobject-salient regions which are critical for adversarial transferability. To\nremedy this, we introduce a semantic structure-aware attack framework based on\nthe Mean Teacher, which serves as a temporally smoothed feature reference. With\nthis smoothed reference, we further direct semantic consistency between the\nearly-layer activations in the student and those of the semantically rich\nteacher by feature distillation. By anchoring perturbation synthesis to the\nsemantically salient early intermediate blocks within the generator based on\nempirical findings, our method guides progressive adversarial perturbation on\nregions that substantially enhance adversarial transferability. We conduct\nextensive experiments over diverse models, domains and tasks to demonstrate\nconsistent improvements relative to state-of-the-art generative attacks,\ncomprehensively evaluated using conventional metrics and our newly proposed\nAccidental Correction Rate (ACR).", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18369", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18369", "abs": "https://arxiv.org/abs/2506.18369", "authors": ["Yeongtak Oh", "Jisoo Mok", "Dohyun Chung", "Juhyeon Shin", "Sangha Park", "Johan Barthelemy", "Sungroh Yoon"], "title": "RePIC: Reinforced Post-Training for Personalizing Multi-Modal Language Models", "comment": "Project Page: https://github.com/oyt9306/RePIC", "summary": "Recent multi-modal large language models (MLLMs) often struggle to generate\npersonalized image captions, even when trained on high-quality captions. In\nthis work, we observe that such limitations persist in existing\npost-training-based MLLM personalization methods. Specifically, despite being\npost-tuned with large-scale caption data through supervised fine-tuning (SFT),\nthese models frequently fail to produce faithful descriptions in real-world\nscenarios, such as multi-concept image captioning. However, acquiring\nlarge-scale, high-quality captions for such complex settings is both costly and\ndifficult. To address the data-centric nature of SFT, we propose a\nreinforcement learning (RL)-based post-training framework. To the best of our\nknowledge, this is the first RL-based approach to post-train MLLMs for\npersonalized image captioning. Our method significantly enhances both visual\nrecognition and personalized generation capabilities of MLLMs, and consistently\noutperforms existing SFT-based baselines, especially in the challenging\nmulti-concept image captioning task.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18658", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18658", "abs": "https://arxiv.org/abs/2506.18658", "authors": ["Ling Zhang", "Boxiang Yun", "Qingli Li", "Yan Wang"], "title": "Historical Report Guided Bi-modal Concurrent Learning for Pathology Report Generation", "comment": null, "summary": "Automated pathology report generation from Whole Slide Images (WSIs) faces\ntwo key challenges: (1) lack of semantic content in visual features and (2)\ninherent information redundancy in WSIs. To address these issues, we propose a\nnovel Historical Report Guided \\textbf{Bi}-modal Concurrent Learning Framework\nfor Pathology Report \\textbf{Gen}eration (BiGen) emulating pathologists'\ndiagnostic reasoning, consisting of: (1) A knowledge retrieval mechanism to\nprovide rich semantic content, which retrieves WSI-relevant knowledge from\npre-built medical knowledge bank by matching high-attention patches and (2) A\nbi-modal concurrent learning strategy instantiated via a learnable visual token\nand a learnable textual token to dynamically extract key visual features and\nretrieved knowledge, where weight-shared layers enable cross-modal alignment\nbetween visual features and knowledge features. Our multi-modal decoder\nintegrates both modals for comprehensive diagnostic reports generation.\nExperiments on the PathText (BRCA) dataset demonstrate our framework's\nsuperiority, achieving state-of-the-art performance with 7.4\\% relative\nimprovement in NLP metrics and 19.1\\% enhancement in classification metrics for\nHer-2 prediction versus existing methods. Ablation studies validate the\nnecessity of our proposed modules, highlighting our method's ability to provide\nWSI-relevant rich semantic content and suppress information redundancy in WSIs.\nCode is publicly available at https://github.com/DeepMed-Lab-ECNU/BiGen.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18493", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18493", "abs": "https://arxiv.org/abs/2506.18493", "authors": ["Trong-Vu Hoang", "Quang-Binh Nguyen", "Thanh-Toan Do", "Tam V. Nguyen", "Minh-Triet Tran", "Trung-Nghia Le"], "title": "ShowFlow: From Robust Single Concept to Condition-Free Multi-Concept Generation", "comment": null, "summary": "Customizing image generation remains a core challenge in controllable image\nsynthesis. For single-concept generation, maintaining both identity\npreservation and prompt alignment is challenging. In multi-concept scenarios,\nrelying solely on a prompt without additional conditions like layout boxes or\nsemantic masks, often leads to identity loss and concept omission. In this\npaper, we introduce ShowFlow, a comprehensive framework designed to tackle\nthese challenges. We propose ShowFlow-S for single-concept image generation,\nand ShowFlow-M for handling multiple concepts. ShowFlow-S introduces a\nKronA-WED adapter, which integrates a Kronecker adapter with weight and\nembedding decomposition, and employs a disentangled learning approach with a\nnovel attention regularization objective to enhance single-concept generation.\nBuilding on this foundation, ShowFlow-M directly reuses the learned models from\nShowFlow-S to support multi-concept generation without extra conditions,\nincorporating a Subject-Adaptive Matching Attention (SAMA) and a layout\nconsistency strategy as the plug-and-play module. Extensive experiments and\nuser studies validate ShowFlow's effectiveness, highlighting its potential in\nreal-world applications like advertising and virtual dressing.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18841", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18841", "abs": "https://arxiv.org/abs/2506.18841", "authors": ["Yuhao Wu", "Yushi Bai", "Zhiqiang Hu", "Roy Ka-Wei Lee", "Juanzi Li"], "title": "LongWriter-Zero: Mastering Ultra-Long Text Generation via Reinforcement Learning", "comment": null, "summary": "Ultra-long generation by large language models (LLMs) is a widely demanded\nscenario, yet it remains a significant challenge due to their maximum\ngeneration length limit and overall quality degradation as sequence length\nincreases. Previous approaches, exemplified by LongWriter, typically rely on\n''teaching'', which involves supervised fine-tuning (SFT) on synthetic\nlong-form outputs. However, this strategy heavily depends on synthetic SFT\ndata, which is difficult and costly to construct, often lacks coherence and\nconsistency, and tends to be overly artificial and structurally monotonous. In\nthis work, we propose an incentivization-based approach that, starting entirely\nfrom scratch and without relying on any annotated or synthetic data, leverages\nreinforcement learning (RL) to foster the emergence of ultra-long, high-quality\ntext generation capabilities in LLMs. We perform RL training starting from a\nbase model, similar to R1-Zero, guiding it to engage in reasoning that\nfacilitates planning and refinement during the writing process. To support\nthis, we employ specialized reward models that steer the LLM towards improved\nlength control, writing quality, and structural formatting. Experimental\nevaluations show that our LongWriter-Zero model, trained from Qwen2.5-32B,\nconsistently outperforms traditional SFT methods on long-form writing tasks,\nachieving state-of-the-art results across all metrics on WritingBench and\nArena-Write, and even surpassing 100B+ models such as DeepSeek R1 and\nQwen3-235B. We open-source our data and model checkpoints under\nhttps://huggingface.co/THU-KEG/LongWriter-Zero-32B", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18557", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18557", "abs": "https://arxiv.org/abs/2506.18557", "authors": ["Sung Jin Um", "Dongjin Kim", "Sangmin Lee", "Jung Uk Kim"], "title": "Object-aware Sound Source Localization via Audio-Visual Scene Understanding", "comment": "Accepted at CVPR 2025", "summary": "Audio-visual sound source localization task aims to spatially localize\nsound-making objects within visual scenes by integrating visual and audio cues.\nHowever, existing methods struggle with accurately localizing sound-making\nobjects in complex scenes, particularly when visually similar silent objects\ncoexist. This limitation arises primarily from their reliance on simple\naudio-visual correspondence, which does not capture fine-grained semantic\ndifferences between sound-making and silent objects. To address these\nchallenges, we propose a novel sound source localization framework leveraging\nMultimodal Large Language Models (MLLMs) to generate detailed contextual\ninformation that explicitly distinguishes between sound-making foreground\nobjects and silent background objects. To effectively integrate this detailed\ninformation, we introduce two novel loss functions: Object-aware Contrastive\nAlignment (OCA) loss and Object Region Isolation (ORI) loss. Extensive\nexperimental results on MUSIC and VGGSound datasets demonstrate the\neffectiveness of our approach, significantly outperforming existing methods in\nboth single-source and multi-source localization scenarios. Code and generated\ndetailed contextual information are available at:\nhttps://github.com/VisualAIKHU/OA-SSL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18569", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18569", "abs": "https://arxiv.org/abs/2506.18569", "authors": ["Oleh Kuzyk", "Zuoyue Li", "Marc Pollefeys", "Xi Wang"], "title": "VisualChef: Generating Visual Aids in Cooking via Mask Inpainting", "comment": null, "summary": "Cooking requires not only following instructions but also understanding,\nexecuting, and monitoring each step - a process that can be challenging without\nvisual guidance. Although recipe images and videos offer helpful cues, they\noften lack consistency in focus, tools, and setup. To better support the\ncooking process, we introduce VisualChef, a method for generating contextual\nvisual aids tailored to cooking scenarios. Given an initial frame and a\nspecified action, VisualChef generates images depicting both the action's\nexecution and the resulting appearance of the object, while preserving the\ninitial frame's environment. Previous work aims to integrate knowledge\nextracted from large language models by generating detailed textual\ndescriptions to guide image generation, which requires fine-grained\nvisual-textual alignment and involves additional annotations. In contrast,\nVisualChef simplifies alignment through mask-based visual grounding. Our key\ninsight is identifying action-relevant objects and classifying them to enable\ntargeted modifications that reflect the intended action and outcome while\nmaintaining a consistent environment. In addition, we propose an automated\npipeline to extract high-quality initial, action, and final state frames. We\nevaluate VisualChef quantitatively and qualitatively on three egocentric video\ndatasets and show its improvements over state-of-the-art methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "fine-grained"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18655", "categories": ["cs.CV", "I.2.6; I.2.10"], "pdf": "https://arxiv.org/pdf/2506.18655", "abs": "https://arxiv.org/abs/2506.18655", "authors": ["Wenxu Qian", "Chaoyue Wang", "Hou Peng", "Zhiyu Tan", "Hao Li", "Anxiang Zeng"], "title": "RDPO: Real Data Preference Optimization for Physics Consistency Video Generation", "comment": "16 pages, 10 figures", "summary": "Video generation techniques have achieved remarkable advancements in visual\nquality, yet faithfully reproducing real-world physics remains elusive.\nPreference-based model post-training may improve physical consistency, but\nrequires costly human-annotated datasets or reward models that are not yet\nfeasible. To address these challenges, we present Real Data Preference\nOptimisation (RDPO), an annotation-free framework that distills physical priors\ndirectly from real-world videos. Specifically, the proposed RDPO\nreverse-samples real video sequences with a pre-trained generator to\nautomatically build preference pairs that are statistically distinguishable in\nterms of physical correctness. A multi-stage iterative training schedule then\nguides the generator to obey physical laws increasingly well. Benefiting from\nthe dynamic information explored from real videos, our proposed RDPO\nsignificantly improves the action coherence and physical realism of the\ngenerated videos. Evaluations on multiple benchmarks and human evaluations have\ndemonstrated that RDPO achieves improvements across multiple dimensions. The\nsource code and demonstration of this paper are available at:\nhttps://wwenxu.github.io/RDPO/", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18658", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18658", "abs": "https://arxiv.org/abs/2506.18658", "authors": ["Ling Zhang", "Boxiang Yun", "Qingli Li", "Yan Wang"], "title": "Historical Report Guided Bi-modal Concurrent Learning for Pathology Report Generation", "comment": null, "summary": "Automated pathology report generation from Whole Slide Images (WSIs) faces\ntwo key challenges: (1) lack of semantic content in visual features and (2)\ninherent information redundancy in WSIs. To address these issues, we propose a\nnovel Historical Report Guided \\textbf{Bi}-modal Concurrent Learning Framework\nfor Pathology Report \\textbf{Gen}eration (BiGen) emulating pathologists'\ndiagnostic reasoning, consisting of: (1) A knowledge retrieval mechanism to\nprovide rich semantic content, which retrieves WSI-relevant knowledge from\npre-built medical knowledge bank by matching high-attention patches and (2) A\nbi-modal concurrent learning strategy instantiated via a learnable visual token\nand a learnable textual token to dynamically extract key visual features and\nretrieved knowledge, where weight-shared layers enable cross-modal alignment\nbetween visual features and knowledge features. Our multi-modal decoder\nintegrates both modals for comprehensive diagnostic reports generation.\nExperiments on the PathText (BRCA) dataset demonstrate our framework's\nsuperiority, achieving state-of-the-art performance with 7.4\\% relative\nimprovement in NLP metrics and 19.1\\% enhancement in classification metrics for\nHer-2 prediction versus existing methods. Ablation studies validate the\nnecessity of our proposed modules, highlighting our method's ability to provide\nWSI-relevant rich semantic content and suppress information redundancy in WSIs.\nCode is publicly available at https://github.com/DeepMed-Lab-ECNU/BiGen.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18679", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18679", "abs": "https://arxiv.org/abs/2506.18679", "authors": ["Ruicheng Zhang", "Yu Sun", "Zeyu Zhang", "Jinai Li", "Xiaofan Liu", "Au Hoi Fan", "Haowei Guo", "Puxin Yan"], "title": "MARL-MambaContour: Unleashing Multi-Agent Deep Reinforcement Learning for Active Contour Optimization in Medical Image Segmentation", "comment": null, "summary": "We introduce MARL-MambaContour, the first contour-based medical image\nsegmentation framework based on Multi-Agent Reinforcement Learning (MARL). Our\napproach reframes segmentation as a multi-agent cooperation task focused on\ngenerate topologically consistent object-level contours, addressing the\nlimitations of traditional pixel-based methods which could lack topological\nconstraints and holistic structural awareness of anatomical regions. Each\ncontour point is modeled as an autonomous agent that iteratively adjusts its\nposition to align precisely with the target boundary, enabling adaptation to\nblurred edges and intricate morphologies common in medical images. This\niterative adjustment process is optimized by a contour-specific Soft\nActor-Critic (SAC) algorithm, further enhanced with the Entropy Regularization\nAdjustment Mechanism (ERAM) which dynamically balance agent exploration with\ncontour smoothness. Furthermore, the framework incorporates a Mamba-based\npolicy network featuring a novel Bidirectional Cross-attention Hidden-state\nFusion Mechanism (BCHFM). This mechanism mitigates potential memory confusion\nlimitations associated with long-range modeling in state space models, thereby\nfacilitating more accurate inter-agent information exchange and informed\ndecision-making. Extensive experiments on five diverse medical imaging datasets\ndemonstrate the state-of-the-art performance of MARL-MambaContour, highlighting\nits potential as an accurate and robust clinical application.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18851", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18851", "abs": "https://arxiv.org/abs/2506.18851", "authors": ["Zhuowei Chen", "Bingchuan Li", "Tianxiang Ma", "Lijie Liu", "Mingcong Liu", "Yi Zhang", "Gen Li", "Xinghui Li", "Siyu Zhou", "Qian He", "Xinglong Wu"], "title": "Phantom-Data : Towards a General Subject-Consistent Video Generation Dataset", "comment": "Project page:https://phantom-video.github.io/Phantom-Data/", "summary": "Subject-to-video generation has witnessed substantial progress in recent\nyears. However, existing models still face significant challenges in faithfully\nfollowing textual instructions. This limitation, commonly known as the\ncopy-paste problem, arises from the widely used in-pair training paradigm. This\napproach inherently entangles subject identity with background and contextual\nattributes by sampling reference images from the same scene as the target\nvideo. To address this issue, we introduce \\textbf{Phantom-Data, the first\ngeneral-purpose cross-pair subject-to-video consistency dataset}, containing\napproximately one million identity-consistent pairs across diverse categories.\nOur dataset is constructed via a three-stage pipeline: (1) a general and\ninput-aligned subject detection module, (2) large-scale cross-context subject\nretrieval from more than 53 million videos and 3 billion images, and (3)\nprior-guided identity verification to ensure visual consistency under\ncontextual variation. Comprehensive experiments show that training with\nPhantom-Data significantly improves prompt alignment and visual quality while\npreserving identity consistency on par with in-pair baselines.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18881", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2506.18881", "abs": "https://arxiv.org/abs/2506.18881", "authors": ["Xinyu Zhang", "Dong Gong", "Zicheng Duan", "Anton van den Hengel", "Lingqiao Liu"], "title": "Let Your Video Listen to Your Music!", "comment": "project page: https://zhangxinyu-xyz.github.io/MVAA/", "summary": "Aligning the rhythm of visual motion in a video with a given music track is a\npractical need in multimedia production, yet remains an underexplored task in\nautonomous video editing. Effective alignment between motion and musical beats\nenhances viewer engagement and visual appeal, particularly in music videos,\npromotional content, and cinematic editing. Existing methods typically depend\non labor-intensive manual cutting, speed adjustments, or heuristic-based\nediting techniques to achieve synchronization. While some generative models\nhandle joint video and music generation, they often entangle the two\nmodalities, limiting flexibility in aligning video to music beats while\npreserving the full visual content. In this paper, we propose a novel and\nefficient framework, termed MVAA (Music-Video Auto-Alignment), that\nautomatically edits video to align with the rhythm of a given music track while\npreserving the original visual content. To enhance flexibility, we modularize\nthe task into a two-step process in our MVAA: aligning motion keyframes with\naudio beats, followed by rhythm-aware video inpainting. Specifically, we first\ninsert keyframes at timestamps aligned with musical beats, then use a\nframe-conditioned diffusion model to generate coherent intermediate frames,\npreserving the original video's semantic content. Since comprehensive test-time\ntraining can be time-consuming, we adopt a two-stage strategy: pretraining the\ninpainting module on a small video set to learn general motion priors, followed\nby rapid inference-time fine-tuning for video-specific adaptation. This hybrid\napproach enables adaptation within 10 minutes with one epoch on a single NVIDIA\n4090 GPU using CogVideoX-5b-I2V as the backbone. Extensive experiments show\nthat our approach can achieve high-quality beat alignment and visual\nsmoothness.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "inference-time"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-24.jsonl"}
{"id": "2506.18680", "categories": ["cs.GR", "cs.CV", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2506.18680", "abs": "https://arxiv.org/abs/2506.18680", "authors": ["Anindita Ghosh", "Bing Zhou", "Rishabh Dabral", "Jian Wang", "Vladislav Golyanik", "Christian Theobalt", "Philipp Slusallek", "Chuan Guo"], "title": "DuetGen: Music Driven Two-Person Dance Generation via Hierarchical Masked Modeling", "comment": "11 pages, 7 figures, 2 tables, accepted in ACM Siggraph 2025\n  conference track", "summary": "We present DuetGen, a novel framework for generating interactive two-person\ndances from music. The key challenge of this task lies in the inherent\ncomplexities of two-person dance interactions, where the partners need to\nsynchronize both with each other and with the music. Inspired by the recent\nadvances in motion synthesis, we propose a two-stage solution: encoding\ntwo-person motions into discrete tokens and then generating these tokens from\nmusic. To effectively capture intricate interactions, we represent both\ndancers' motions as a unified whole to learn the necessary motion tokens, and\nadopt a coarse-to-fine learning strategy in both the stages. Our first stage\nutilizes a VQ-VAE that hierarchically separates high-level semantic features at\na coarse temporal resolution from low-level details at a finer resolution,\nproducing two discrete token sequences at different abstraction levels.\nSubsequently, in the second stage, two generative masked transformers learn to\nmap music signals to these dance tokens: the first producing high-level\nsemantic tokens, and the second, conditioned on music and these semantic\ntokens, producing the low-level tokens. We train both transformers to learn to\npredict randomly masked tokens within the sequence, enabling them to\niteratively generate motion tokens by filling an empty token sequence during\ninference. Through the hierarchical masked modeling and dedicated interaction\nrepresentation, DuetGen achieves the generation of synchronized and interactive\ntwo-person dances across various genres. Extensive experiments and user studies\non a benchmark duet dance dataset demonstrate state-of-the-art performance of\nDuetGen in motion realism, music-dance alignment, and partner coordination.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-06-24.jsonl"}
