{"id": "2506.05070", "pdf": "https://arxiv.org/pdf/2506.05070", "abs": "https://arxiv.org/abs/2506.05070", "authors": ["Tianjiao Li", "Mengran Yu", "Chenyu Shi", "Yanjun Zhao", "Xiaojing Liu", "Qiang Zhang", "Qi Zhang", "Xuanjing Huang", "Jiayin Wang"], "title": "RIVAL: Reinforcement Learning with Iterative and Adversarial Optimization for Machine Translation", "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) possess strong multilingual capabilities, and\ncombining Reinforcement Learning from Human Feedback (RLHF) with translation\ntasks has shown great potential. However, we observe that this paradigm\nperforms unexpectedly poorly when applied to colloquial subtitle translation\ntasks. In this work, we investigate this issue and find that the offline reward\nmodel (RM) gradually diverges from the online LLM due to distributional shift,\nultimately leading to undesirable training outcomes. To address this, we\npropose RIVAL, an adversarial training framework that formulates the process as\na min-max game between the RM and the LLM. RIVAL iteratively updates the both\nmodels, with the RM trained to distinguish strong from weak translations\n(qualitative preference reward), and the LLM trained to enhance its translation\nfor closing this gap. To stabilize training and improve generalizability, we\nalso incorporate quantitative preference reward (e.g., BLEU) into the RM,\nenabling reference-free quality modeling aligned with human evaluation. Through\nextensive experiments, we demonstrate that the proposed adversarial training\nframework significantly improves upon translation baselines.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "reinforcement learning from human feedback", "human feedback", "reinforcement learning", "preference"], "score": 5}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04463", "pdf": "https://arxiv.org/pdf/2506.04463", "abs": "https://arxiv.org/abs/2506.04463", "authors": ["Zhaoxuan Tan", "Zheng Li", "Tianyi Liu", "Haodong Wang", "Hyokun Yun", "Ming Zeng", "Pei Chen", "Zhihan Zhang", "Yifan Gao", "Ruijie Wang", "Priyanka Nigam", "Bing Yin", "Meng Jiang"], "title": "Aligning Large Language Models with Implicit Preferences from User-Generated Content", "categories": ["cs.CL"], "comment": "Accepted to ACL 2025 Main Conference", "summary": "Learning from preference feedback is essential for aligning large language\nmodels (LLMs) with human values and improving the quality of generated\nresponses. However, existing preference learning methods rely heavily on\ncurated data from humans or advanced LLMs, which is costly and difficult to\nscale. In this work, we present PUGC, a novel framework that leverages implicit\nhuman Preferences in unlabeled User-Generated Content (UGC) to generate\npreference data. Although UGC is not explicitly created to guide LLMs in\ngenerating human-preferred responses, it often reflects valuable insights and\nimplicit preferences from its creators that has the potential to address\nreaders' questions. PUGC transforms UGC into user queries and generates\nresponses from the policy model. The UGC is then leveraged as a reference text\nfor response scoring, aligning the model with these implicit preferences. This\napproach improves the quality of preference data while enabling scalable,\ndomain-specific alignment. Experimental results on Alpaca Eval 2 show that\nmodels trained with DPO and PUGC achieve a 9.37% performance improvement over\ntraditional methods, setting a 35.93% state-of-the-art length-controlled win\nrate using Mistral-7B-Instruct. Further studies highlight gains in reward\nquality, domain-specific alignment effectiveness, robustness against UGC\nquality, and theory of mind capabilities. Our code and dataset are available at\nhttps://zhaoxuan.info/PUGC.github.io/", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference learning", "preference", "alignment", "DPO"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "Alpaca"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05339", "pdf": "https://arxiv.org/pdf/2506.05339", "abs": "https://arxiv.org/abs/2506.05339", "authors": ["Anirudh Bharadwaj", "Chaitanya Malaviya", "Nitish Joshi", "Mark Yatskar"], "title": "Flattery, Fluff, and Fog: Diagnosing and Mitigating Idiosyncratic Biases in Preference Models", "categories": ["cs.CL"], "comment": "Code and data available at\n  https://github.com/anirudhb123/preference-model-biases", "summary": "Language models serve as proxies for human preference judgements in alignment\nand evaluation, yet they exhibit systematic miscalibration, prioritizing\nsuperficial patterns over substantive qualities. This bias manifests as\noverreliance on features like length, structure, and style, leading to issues\nlike reward hacking and unreliable evaluations. Evidence suggests these biases\noriginate in artifacts in human training data. In this work, we systematically\ninvestigate the relationship between training data biases and preference model\nmiscalibration across five idiosyncratic features of language model\ngenerations: length, structure, jargon, sycophancy and vagueness. Using\ncontrolled counterfactual pairs, we first quantify the extent to which\npreference models favor responses with magnified biases (skew), finding this\npreference occurs in >60% of instances, and model preferences show high\nmiscalibration (~40%) compared to human preferences. Notably, bias features\nonly show mild negative correlations to human preference labels (mean r_human =\n-0.12) but show moderately strong positive correlations with labels from a\nstrong reward model (mean r_model = +0.36), suggesting that models may overrely\non spurious cues. To mitigate these issues, we propose a simple post-training\nmethod based on counterfactual data augmentation (CDA) using synthesized\ncontrastive examples. Finetuning models with CDA reduces average miscalibration\nfrom 39.4% to 32.5% and average absolute skew difference from 20.5% to 10.0%,\nwhile maintaining overall RewardBench performance, showing that targeted\ndebiasing is effective for building reliable preference models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "preference", "alignment", "reward hacking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "human preference"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04721", "pdf": "https://arxiv.org/pdf/2506.04721", "abs": "https://arxiv.org/abs/2506.04721", "authors": ["Yuru Jiang", "Wenxuan Ding", "Shangbin Feng", "Greg Durrett", "Yulia Tsvetkov"], "title": "SPARTA ALIGNMENT: Collectively Aligning Multiple Language Models through Combat", "categories": ["cs.CL"], "comment": null, "summary": "We propose SPARTA ALIGNMENT, an algorithm to collectively align multiple LLMs\nthrough competition and combat. To complement a single model's lack of\ndiversity in generation and biases in evaluation, multiple LLMs form a \"sparta\ntribe\" to compete against each other in fulfilling instructions while serving\nas judges for the competition of others. For each iteration, one instruction\nand two models are selected for a duel, the other models evaluate the two\nresponses, and their evaluation scores are aggregated through a adapted\nelo-ranking based reputation system, where winners/losers of combat gain/lose\nweight in evaluating others. The peer-evaluated combat results then become\npreference pairs where the winning response is preferred over the losing one,\nand all models learn from these preferences at the end of each iteration.\nSPARTA ALIGNMENT enables the self-evolution of multiple LLMs in an iterative\nand collective competition process. Extensive experiments demonstrate that\nSPARTA ALIGNMENT outperforms initial models and 4 self-alignment baselines\nacross 10 out of 12 tasks and datasets with 7.0% average improvement. Further\nanalysis reveals that SPARTA ALIGNMENT generalizes more effectively to unseen\ntasks and leverages the expertise diversity of participating models to produce\nmore logical, direct and informative outputs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "ranking", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05260", "pdf": "https://arxiv.org/pdf/2506.05260", "abs": "https://arxiv.org/abs/2506.05260", "authors": ["Xiaodong Wang", "Jinfa Huang", "Li Yuan", "Peixi Peng"], "title": "LeanPO: Lean Preference Optimization for Likelihood Alignment in Video-LLMs", "categories": ["cs.CV"], "comment": "Code: https://github.com/Wang-Xiaodong1899/LeanPO", "summary": "Most Video Large Language Models (Video-LLMs) adopt preference alignment\ntechniques, e.g., DPO~\\citep{rafailov2024dpo}, to optimize the reward margin\nbetween a winning response ($y_w$) and a losing response ($y_l$). However, the\nlikelihood displacement observed in DPO indicates that both $\\log \\pi_\\theta\n(y_w\\mid x)$ and $\\log \\pi_\\theta (y_l\\mid x) $ often decrease during training,\ninadvertently boosting the probabilities of non-target responses. In this\npaper, we systematically revisit this phenomenon from LLMs to Video-LLMs,\nshowing that it intensifies when dealing with the redundant complexity of video\ncontent. To alleviate the impact of this phenomenon, we propose \\emph{Lean\nPreference Optimization} (LeanPO), a reference-free approach that reformulates\nthe implicit reward as the average likelihood of the response with respect to\nthe policy model. A key component of LeanPO is the reward-trustworthiness\ncorrelated self-generated preference data pipeline, which carefully infuses\nrelevant prior knowledge into the model while continuously refining the\npreference data via self-reflection. This allows the policy model to obtain\nhigh-quality paired data and accurately estimate the newly defined reward, thus\nmitigating the unintended drop. In addition, we introduce a dynamic label\nsmoothing strategy that mitigates the impact of noise in responses from diverse\nvideo content, preventing the model from overfitting to spurious details.\nExtensive experiments demonstrate that LeanPO significantly enhances the\nperformance of state-of-the-art Video-LLMs, consistently boosting baselines of\nvarying capacities with minimal additional training overhead. Moreover, LeanPO\noffers a simple yet effective solution for aligning Video-LLM preferences with\nhuman trustworthiness, paving the way toward the reliable and efficient\nVideo-LLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04462", "pdf": "https://arxiv.org/pdf/2506.04462", "abs": "https://arxiv.org/abs/2506.04462", "authors": ["Apurv Verma", "NhatHai Phan", "Shubhendu Trivedi"], "title": "Watermarking Degrades Alignment in Language Models: Analysis and Mitigation", "categories": ["cs.CL", "cs.CR", "cs.LG", "I.2.7"], "comment": "Published at the 1st Workshop on GenAI Watermarking, collocated with\n  ICLR 2025. OpenReview: https://openreview.net/forum?id=SIBkIV48gF", "summary": "Watermarking techniques for large language models (LLMs) can significantly\nimpact output quality, yet their effects on truthfulness, safety, and\nhelpfulness remain critically underexamined. This paper presents a systematic\nanalysis of how two popular watermarking approaches-Gumbel and KGW-affect these\ncore alignment properties across four aligned LLMs. Our experiments reveal two\ndistinct degradation patterns: guard attenuation, where enhanced helpfulness\nundermines model safety, and guard amplification, where excessive caution\nreduces model helpfulness. These patterns emerge from watermark-induced shifts\nin token distribution, surfacing the fundamental tension that exists between\nalignment objectives.\n  To mitigate these degradations, we propose Alignment Resampling (AR), an\ninference-time sampling method that uses an external reward model to restore\nalignment. We establish a theoretical lower bound on the improvement in\nexpected reward score as the sample size is increased and empirically\ndemonstrate that sampling just 2-4 watermarked generations effectively recovers\nor surpasses baseline (unwatermarked) alignment scores. To overcome the limited\nresponse diversity of standard Gumbel watermarking, our modified implementation\nsacrifices strict distortion-freeness while maintaining robust detectability,\nensuring compatibility with AR. Experimental results confirm that AR\nsuccessfully recovers baseline alignment in both watermarking approaches, while\nmaintaining strong watermark detectability. This work reveals the critical\nbalance between watermark strength and model alignment, providing a simple\ninference-time solution to responsibly deploy watermarked LLMs in practice.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["helpfulness", "truthfulness", "safety"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04559", "pdf": "https://arxiv.org/pdf/2506.04559", "abs": "https://arxiv.org/abs/2506.04559", "authors": ["Yunhao Gou", "Kai Chen", "Zhili Liu", "Lanqing Hong", "Xin Jin", "Zhenguo Li", "James T. Kwok", "Yu Zhang"], "title": "Perceptual Decoupling for Scalable Multi-modal Reasoning via Reward-Optimized Captioning", "categories": ["cs.CV"], "comment": null, "summary": "Recent advances in slow-thinking language models (e.g., OpenAI-o1 and\nDeepSeek-R1) have demonstrated remarkable abilities in complex reasoning tasks\nby emulating human-like reflective cognition. However, extending such\ncapabilities to multi-modal large language models (MLLMs) remains challenging\ndue to the high cost of retraining vision-language alignments when upgrading\nthe underlying reasoner LLMs. A straightforward solution is to decouple\nperception from reasoning, i.e., converting visual inputs into language\nrepresentations (e.g., captions) that are then passed to a powerful text-only\nreasoner. However, this decoupling introduces a critical challenge: the visual\nextractor must generate descriptions that are both faithful to the image and\ninformative enough to support accurate downstream reasoning. To address this,\nwe propose Reasoning-Aligned Perceptual Decoupling via Caption Reward\nOptimization (RACRO) - a reasoning-guided reinforcement learning strategy that\naligns the extractor's captioning behavior with the reasoning objective. By\nclosing the perception-reasoning loop via reward-based optimization, RACRO\nsignificantly enhances visual grounding and extracts reasoning-optimized\nrepresentations. Experiments on multi-modal math and science benchmarks show\nthat the proposed RACRO method achieves state-of-the-art average performance\nwhile enabling superior scalability and plug-and-play adaptation to more\nadvanced reasoning LLMs without the necessity for costly multi-modal\nre-alignment.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["o1"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04679", "pdf": "https://arxiv.org/pdf/2506.04679", "abs": "https://arxiv.org/abs/2506.04679", "authors": ["Raphaël Millière"], "title": "Normative Conflicts and Shallow AI Alignment", "categories": ["cs.CL"], "comment": "Published in Philosophical Studies", "summary": "The progress of AI systems such as large language models (LLMs) raises\nincreasingly pressing concerns about their safe deployment. This paper examines\nthe value alignment problem for LLMs, arguing that current alignment strategies\nare fundamentally inadequate to prevent misuse. Despite ongoing efforts to\ninstill norms such as helpfulness, honesty, and harmlessness in LLMs through\nfine-tuning based on human preferences, they remain vulnerable to adversarial\nattacks that exploit conflicts between these norms. I argue that this\nvulnerability reflects a fundamental limitation of existing alignment methods:\nthey reinforce shallow behavioral dispositions rather than endowing LLMs with a\ngenuine capacity for normative deliberation. Drawing from on research in moral\npsychology, I show how humans' ability to engage in deliberative reasoning\nenhances their resilience against similar adversarial tactics. LLMs, by\ncontrast, lack a robust capacity to detect and rationally resolve normative\nconflicts, leaving them susceptible to manipulation; even recent advances in\nreasoning-focused LLMs have not addressed this vulnerability. This ``shallow\nalignment'' problem carries significant implications for AI safety and\nregulation, suggesting that current approaches are insufficient for mitigating\npotential harms posed by increasingly capable AI systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "value alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["helpfulness", "harmlessness", "honesty", "safety"], "score": 4}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04990", "pdf": "https://arxiv.org/pdf/2506.04990", "abs": "https://arxiv.org/abs/2506.04990", "authors": ["Enrique Sanchez", "Isma Hadji", "Adrian Bulat", "Christos Tzelepis", "Brais Martinez", "Georgios Tzimiropoulos"], "title": "Multi-scale Image Super Resolution with a Single Auto-Regressive Model", "categories": ["cs.CV"], "comment": "Enrique Sanchez and Isma Hadji equally contributed to this work.\n  Project site https://github.com/saic-fi/ms_sr_var", "summary": "In this paper we tackle Image Super Resolution (ISR), using recent advances\nin Visual Auto-Regressive (VAR) modeling. VAR iteratively estimates the\nresidual in latent space between gradually increasing image scales, a process\nreferred to as next-scale prediction. Thus, the strong priors learned during\npre-training align well with the downstream task (ISR). To our knowledge, only\nVARSR has exploited this synergy so far, showing promising results. However,\ndue to the limitations of existing residual quantizers, VARSR works only at a\nfixed resolution, i.e. it fails to map intermediate outputs to the\ncorresponding image scales. Additionally, it relies on a 1B transformer\narchitecture (VAR-d24), and leverages a large-scale private dataset to achieve\nstate-of-the-art results. We address these limitations through two novel\ncomponents: a) a Hierarchical Image Tokenization approach with a multi-scale\nimage tokenizer that progressively represents images at different scales while\nsimultaneously enforcing token overlap across scales, and b) a Direct\nPreference Optimization (DPO) regularization term that, relying solely on the\nLR and HR tokenizations, encourages the transformer to produce the latter over\nthe former. To the best of our knowledge, this is the first time a quantizer is\ntrained to force semantically consistent residuals at different scales, and the\nfirst time that preference-based optimization is used to train a VAR. Using\nthese two components, our model can denoise the LR image and super-resolve at\nhalf and full target upscale factors in a single forward pass. Additionally, we\nachieve \\textit{state-of-the-art results on ISR}, while using a small model\n(300M params vs ~1B params of VARSR), and without using external training data.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05142", "pdf": "https://arxiv.org/pdf/2506.05142", "abs": "https://arxiv.org/abs/2506.05142", "authors": ["Diege Sun", "Guanyi Chen", "Fan Zhao", "Xiaorong Cheng", "Tingting He"], "title": "Do Large Language Models Judge Error Severity Like Humans?", "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) are increasingly used as automated evaluators in\nnatural language generation, yet it remains unclear whether they can accurately\nreplicate human judgments of error severity. In this study, we systematically\ncompare human and LLM assessments of image descriptions containing controlled\nsemantic errors. We extend the experimental framework of van Miltenburg et al.\n(2020) to both unimodal (text-only) and multimodal (text + image) settings,\nevaluating four error types: age, gender, clothing type, and clothing colour.\nOur findings reveal that humans assign varying levels of severity to different\nerror types, with visual context significantly amplifying perceived severity\nfor colour and type errors. Notably, most LLMs assign low scores to gender\nerrors but disproportionately high scores to colour errors, unlike humans, who\njudge both as highly severe but for different reasons. This suggests that these\nmodels may have internalised social norms influencing gender judgments but lack\nthe perceptual grounding to emulate human sensitivity to colour, which is\nshaped by distinct neural mechanisms. Only one of the evaluated LLMs, Doubao,\nreplicates the human-like ranking of error severity, but it fails to\ndistinguish between error types as clearly as humans. Surprisingly,\nDeepSeek-V3, a unimodal LLM, achieves the highest alignment with human\njudgments across both unimodal and multimodal conditions, outperforming even\nstate-of-the-art multimodal models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking", "alignment"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04913", "pdf": "https://arxiv.org/pdf/2506.04913", "abs": "https://arxiv.org/abs/2506.04913", "authors": ["Yongyu Mu", "Jiali Zeng", "Bei Li", "Xinyan Guan", "Fandong Meng", "Jie Zhou", "Tong Xiao", "Jingbo Zhu"], "title": "Dissecting Long Reasoning Models: An Empirical Study", "categories": ["cs.LG", "cs.CL"], "comment": "Working in process", "summary": "Despite recent progress in training long-context reasoning models via\nreinforcement learning (RL), several open questions and counterintuitive\nbehaviors remain. This work focuses on three key aspects: (1) We systematically\nanalyze the roles of positive and negative samples in RL, revealing that\npositive samples mainly facilitate data fitting, whereas negative samples\nsignificantly enhance generalization and robustness. Interestingly, training\nsolely on negative samples can rival standard RL training performance. (2) We\nidentify substantial data inefficiency in group relative policy optimization,\nwhere over half of the samples yield zero advantage. To address this, we\nexplore two straightforward strategies, including relative length rewards and\noffline sample injection, to better leverage these data and enhance reasoning\nefficiency and capability. (3) We investigate unstable performance across\nvarious reasoning models and benchmarks, attributing instability to uncertain\nproblems with ambiguous outcomes, and demonstrate that multiple evaluation runs\nmitigate this issue.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05343", "pdf": "https://arxiv.org/pdf/2506.05343", "abs": "https://arxiv.org/abs/2506.05343", "authors": ["Wenfeng Lin", "Renjie Chen", "Boyuan Liu", "Shiyue Yan", "Ruoyu Feng", "Jiangchuan Wei", "Yichen Zhang", "Yimeng Zhou", "Chao Feng", "Jiao Ran", "Qi Wu", "Zuotao Liu", "Mingyu Guo"], "title": "ContentV: Efficient Training of Video Generation Models with Limited Compute", "categories": ["cs.CV"], "comment": "Project Page: https://contentv.github.io", "summary": "Recent advances in video generation demand increasingly efficient training\nrecipes to mitigate escalating computational costs. In this report, we present\nContentV, an 8B-parameter text-to-video model that achieves state-of-the-art\nperformance (85.14 on VBench) after training on 256 x 64GB Neural Processing\nUnits (NPUs) for merely four weeks. ContentV generates diverse, high-quality\nvideos across multiple resolutions and durations from text prompts, enabled by\nthree key innovations: (1) A minimalist architecture that maximizes reuse of\npre-trained image generation models for video generation; (2) A systematic\nmulti-stage training strategy leveraging flow matching for enhanced efficiency;\nand (3) A cost-effective reinforcement learning with human feedback framework\nthat improves generation quality without requiring additional human\nannotations. All the code and models are available at:\nhttps://contentv.github.io.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["human feedback", "reinforcement learning"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04280", "pdf": "https://arxiv.org/pdf/2506.04280", "abs": "https://arxiv.org/abs/2506.04280", "authors": ["Ziming Cheng", "Binrui Xu", "Lisheng Gong", "Zuhe Song", "Tianshuo Zhou", "Shiqi Zhong", "Siyu Ren", "Mingxiang Chen", "Xiangchao Meng", "Yuxin Zhang", "Yanlin Li", "Lei Ren", "Wei Chen", "Zhiyuan Huang", "Mingjie Zhan", "Xiaojie Wang", "Fangxiang Feng"], "title": "Evaluating MLLMs with Multimodal Multi-image Reasoning Benchmark", "categories": ["cs.CV", "cs.AI", "68T50", "I.2.7"], "comment": "18 pages", "summary": "With enhanced capabilities and widespread applications, Multimodal Large\nLanguage Models (MLLMs) are increasingly required to process and reason over\nmultiple images simultaneously. However, existing MLLM benchmarks focus either\non single-image visual reasoning or on multi-image understanding tasks with\nonly final-answer evaluation, leaving the reasoning capabilities of MLLMs over\nmulti-image inputs largely underexplored. To address this gap, we introduce the\n$\\textbf{Multimodal Multi-image Reasoning Benchmark (MMRB)}$, the first\nbenchmark designed to evaluate structured visual reasoning across multiple\nimages. MMRB comprises $\\textbf{92 sub-tasks}$ covering spatial, temporal, and\nsemantic reasoning, with multi-solution, CoT-style annotations generated by\nGPT-4o and refined by human experts. A derivative subset is designed to\nevaluate multimodal reward models in multi-image scenarios. To support fast and\nscalable evaluation, we propose a sentence-level matching framework using\nopen-source LLMs. Extensive baseline experiments on $\\textbf{40 MLLMs}$,\nincluding 9 reasoning-specific models and 8 reward models, demonstrate that\nopen-source MLLMs still lag significantly behind commercial MLLMs in\nmulti-image reasoning tasks. Furthermore, current multimodal reward models are\nnearly incapable of handling multi-image reward ranking tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04351", "pdf": "https://arxiv.org/pdf/2506.04351", "abs": "https://arxiv.org/abs/2506.04351", "authors": ["Maksym Ivashechkin", "Oscar Mendez", "Richard Bowden"], "title": "HuGeDiff: 3D Human Generation via Diffusion with Gaussian Splatting", "categories": ["cs.CV"], "comment": null, "summary": "3D human generation is an important problem with a wide range of applications\nin computer vision and graphics. Despite recent progress in generative AI such\nas diffusion models or rendering methods like Neural Radiance Fields or\nGaussian Splatting, controlling the generation of accurate 3D humans from text\nprompts remains an open challenge. Current methods struggle with fine detail,\naccurate rendering of hands and faces, human realism, and controlability over\nappearance. The lack of diversity, realism, and annotation in human image data\nalso remains a challenge, hindering the development of a foundational 3D human\nmodel. We present a weakly supervised pipeline that tries to address these\nchallenges. In the first step, we generate a photorealistic human image dataset\nwith controllable attributes such as appearance, race, gender, etc using a\nstate-of-the-art image diffusion model. Next, we propose an efficient mapping\napproach from image features to 3D point clouds using a transformer-based\narchitecture. Finally, we close the loop by training a point-cloud diffusion\nmodel that is conditioned on the same text prompts used to generate the\noriginal samples. We demonstrate orders-of-magnitude speed-ups in 3D human\ngeneration compared to the state-of-the-art approaches, along with\nsignificantly improved text-prompt alignment, realism, and rendering quality.\nWe will make the code and dataset available.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04363", "pdf": "https://arxiv.org/pdf/2506.04363", "abs": "https://arxiv.org/abs/2506.04363", "authors": ["Delong Chen", "Willy Chung", "Yejin Bang", "Ziwei Ji", "Pascale Fung"], "title": "WorldPrediction: A Benchmark for High-level World Modeling and Long-horizon Procedural Planning", "categories": ["cs.CV"], "comment": null, "summary": "Humans are known to have an internal \"world model\" that enables us to carry\nout action planning based on world states. AI agents need to have such a world\nmodel for action planning as well. It is not clear how current AI models,\nespecially generative models, are able to learn such world models and carry out\nprocedural planning in diverse environments. We introduce WorldPrediction, a\nvideo-based benchmark for evaluating world modeling and procedural planning\ncapabilities of different AI models. In contrast to prior benchmarks that focus\nprimarily on low-level world modeling and robotic motion planning,\nWorldPrediction is the first benchmark that emphasizes actions with temporal\nand semantic abstraction. Given initial and final world states, the task is to\ndistinguish the proper action (WorldPrediction-WM) or the properly ordered\nsequence of actions (WorldPrediction-PP) from a set of counterfactual\ndistractors. This discriminative task setup enable us to evaluate different\ntypes of world models and planners and realize a thorough comparison across\ndifferent hypothesis. The benchmark represents states and actions using visual\nobservations. In order to prevent models from exploiting low-level continuity\ncues in background scenes, we provide \"action equivalents\" - identical actions\nobserved in different contexts - as candidates for selection. This benchmark is\ngrounded in a formal framework of partially observable semi-MDP, ensuring\nbetter reliability and robustness of the evaluation. We conduct extensive human\nfiltering and validation on our benchmark and show that current frontier models\nbarely achieve 57% accuracy on WorldPrediction-WM and 38% on WorldPrediction-PP\nwhereas humans are able to solve both tasks perfectly.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "reliability", "accuracy"], "score": 4}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04623", "pdf": "https://arxiv.org/pdf/2506.04623", "abs": "https://arxiv.org/abs/2506.04623", "authors": ["Wuyang Li", "Zhu Yu", "Alexandre Alahi"], "title": "VoxDet: Rethinking 3D Semantic Occupancy Prediction as Dense Object Detection", "categories": ["cs.GR", "cs.CV"], "comment": "Project Page: https://vita-epfl.github.io/VoxDet/", "summary": "3D semantic occupancy prediction aims to reconstruct the 3D geometry and\nsemantics of the surrounding environment. With dense voxel labels, prior works\ntypically formulate it as a dense segmentation task, independently classifying\neach voxel. However, this paradigm neglects critical instance-centric\ndiscriminability, leading to instance-level incompleteness and adjacent\nambiguities. To address this, we highlight a free lunch of occupancy labels:\nthe voxel-level class label implicitly provides insight at the instance level,\nwhich is overlooked by the community. Motivated by this observation, we first\nintroduce a training-free Voxel-to-Instance (VoxNT) trick: a simple yet\neffective method that freely converts voxel-level class labels into\ninstance-level offset labels. Building on this, we further propose VoxDet, an\ninstance-centric framework that reformulates the voxel-level occupancy\nprediction as dense object detection by decoupling it into two sub-tasks:\noffset regression and semantic prediction. Specifically, based on the lifted 3D\nvolume, VoxDet first uses (a) Spatially-decoupled Voxel Encoder to generate\ndisentangled feature volumes for the two sub-tasks, which learn task-specific\nspatial deformation in the densely projected tri-perceptive space. Then, we\ndeploy (b) Task-decoupled Dense Predictor to address this task via dense\ndetection. Here, we first regress a 4D offset field to estimate distances (6\ndirections) between voxels and object borders in the voxel space. The regressed\noffsets are then used to guide the instance-level aggregation in the\nclassification branch, achieving instance-aware prediction. Experiments show\nthat VoxDet can be deployed on both camera and LiDAR input, jointly achieving\nstate-of-the-art results on both benchmarks. VoxDet is not only highly\nefficient, but also achieves 63.0 IoU on the SemanticKITTI test set, ranking\n1st on the online leaderboard.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04405", "pdf": "https://arxiv.org/pdf/2506.04405", "abs": "https://arxiv.org/abs/2506.04405", "authors": ["Ran Xu", "Yuchen Zhuang", "Yishan Zhong", "Yue Yu", "Xiangru Tang", "Hang Wu", "May D. Wang", "Peifeng Ruan", "Donghan Yang", "Tao Wang", "Guanghua Xiao", "Carl Yang", "Yang Xie", "Wenqi Shi"], "title": "MedAgentGym: Training LLM Agents for Code-Based Medical Reasoning at Scale", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "We introduce MedAgentGYM, the first publicly available training environment\ndesigned to enhance coding-based medical reasoning capabilities in large\nlanguage model (LLM) agents. MedAgentGYM comprises 72,413 task instances across\n129 categories derived from authentic real-world biomedical scenarios. Tasks\nare encapsulated within executable coding environments, each featuring detailed\ntask descriptions, interactive feedback mechanisms, verifiable ground-truth\nannotations, and scalable training trajectory generation. Extensive\nbenchmarking of over 30 LLMs reveals a notable performance disparity between\ncommercial API-based models and open-source counterparts. Leveraging\nMedAgentGYM, Med-Copilot-7B achieves substantial performance gains through\nsupervised fine-tuning (+36.44%) and continued reinforcement learning\n(+42.47%), emerging as an affordable and privacy-preserving alternative\ncompetitive with gpt-4o. By offering both a comprehensive benchmark and\naccessible, expandable training resources within unified execution\nenvironments, MedAgentGYM delivers an integrated platform to develop LLM-based\ncoding assistants for advanced biomedical research and practice.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04496", "pdf": "https://arxiv.org/pdf/2506.04496", "abs": "https://arxiv.org/abs/2506.04496", "authors": ["Patrik Mesec", "Alan Jović"], "title": "Towards Large-Scale Pose-Invariant Face Recognition Using Face Defrontalization", "categories": ["cs.CV"], "comment": "13 pages, 5 figures, 4 tables", "summary": "Face recognition under extreme head poses is a challenging task. Ideally, a\nface recognition system should perform well across different head poses, which\nis known as pose-invariant face recognition. To achieve pose invariance,\ncurrent approaches rely on sophisticated methods, such as face frontalization\nand various facial feature extraction model architectures. However, these\nmethods are somewhat impractical in real-life settings and are typically\nevaluated on small scientific datasets, such as Multi-PIE. In this work, we\npropose the inverse method of face frontalization, called face\ndefrontalization, to augment the training dataset of facial feature extraction\nmodel. The method does not introduce any time overhead during the inference\nstep. The method is composed of: 1) training an adapted face defrontalization\nFFWM model on a frontal-profile pairs dataset, which has been preprocessed\nusing our proposed face alignment method; 2) training a ResNet-50 facial\nfeature extraction model based on ArcFace loss on a raw and randomly\ndefrontalized large-scale dataset, where defrontalization was performed with\nour previously trained face defrontalization model. Our method was compared\nwith the existing approaches on four open-access datasets: LFW, AgeDB, CFP, and\nMulti-PIE. Defrontalization shows improved results compared to models without\ndefrontalization, while the proposed adjustments show clear superiority over\nthe state-of-the-art face frontalization FFWM method on three larger\nopen-access datasets, but not on the small Multi-PIE dataset for extreme poses\n(75 and 90 degrees). The results suggest that at least some of the current\nmethods may be overfitted to small datasets.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04513", "pdf": "https://arxiv.org/pdf/2506.04513", "abs": "https://arxiv.org/abs/2506.04513", "authors": ["Gustavo Henrique do Nascimento", "Ian Pons", "Anna Helena Reali Costa", "Artur Jordao"], "title": "Pruning Everything, Everywhere, All at Once", "categories": ["cs.CV"], "comment": "To be published in International Joint Conference on Neural Networks\n  (IJCNN), 2025", "summary": "Deep learning stands as the modern paradigm for solving cognitive tasks.\nHowever, as the problem complexity increases, models grow deeper and\ncomputationally prohibitive, hindering advancements in real-world and\nresource-constrained applications. Extensive studies reveal that pruning\nstructures in these models efficiently reduces model complexity and improves\ncomputational efficiency. Successful strategies in this sphere include removing\nneurons (i.e., filters, heads) or layers, but not both together. Therefore,\nsimultaneously pruning different structures remains an open problem. To fill\nthis gap and leverage the benefits of eliminating neurons and layers at once,\nwe propose a new method capable of pruning different structures within a model\nas follows. Given two candidate subnetworks (pruned models), one from layer\npruning and the other from neuron pruning, our method decides which to choose\nby selecting the one with the highest representation similarity to its parent\n(the network that generates the subnetworks) using the Centered Kernel\nAlignment metric. Iteratively repeating this process provides highly sparse\nmodels that preserve the original predictive ability. Throughout extensive\nexperiments on standard architectures and benchmarks, we confirm the\neffectiveness of our approach and show that it outperforms state-of-the-art\nlayer and filter pruning techniques. At high levels of Floating Point\nOperations reduction, most state-of-the-art methods degrade accuracy, whereas\nour approach either improves it or experiences only a minimal drop. Notably, on\nthe popular ResNet56 and ResNet110, we achieve a milestone of 86.37% and 95.82%\nFLOPs reduction. Besides, our pruned models obtain robustness to adversarial\nand out-of-distribution samples and take an important step towards GreenAI,\nreducing carbon emissions by up to 83.31%. Overall, we believe our work opens a\nnew chapter in pruning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04516", "pdf": "https://arxiv.org/pdf/2506.04516", "abs": "https://arxiv.org/abs/2506.04516", "authors": ["Kun Zhao", "Bohao Yang", "Chen Tang", "Siyuan Dai", "Haoteng Tang", "Chenghua Lin", "Liang Zhan"], "title": "DRE: An Effective Dual-Refined Method for Integrating Small and Large Language Models in Open-Domain Dialogue Evaluation", "categories": ["cs.CL"], "comment": "arXiv admin note: text overlap with arXiv:2405.15924", "summary": "Large Language Models (LLMs) excel at many tasks but struggle with ambiguous\nscenarios where multiple valid responses exist, often yielding unreliable\nresults. Conversely, Small Language Models (SLMs) demonstrate robustness in\nsuch scenarios but are susceptible to misleading or adversarial inputs. We\nobserved that LLMs handle negative examples effectively, while SLMs excel with\npositive examples. To leverage their complementary strengths, we introduce\nSLIDE (Small and Large Integrated for Dialogue Evaluation), a method\nintegrating SLMs and LLMs via adaptive weighting. Building on SLIDE, we further\npropose a Dual-Refinement Evaluation (DRE) method to enhance SLM-LLM\nintegration: (1) SLM-generated insights guide the LLM to produce initial\nevaluations; (2) SLM-derived adjustments refine the LLM's scores for improved\naccuracy. Experiments demonstrate that DRE outperforms existing methods,\nshowing stronger alignment with human judgment across diverse benchmarks. This\nwork illustrates how combining small and large models can yield more reliable\nevaluation tools, particularly for open-ended tasks such as dialogue\nevaluation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy", "dialogue"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04606", "pdf": "https://arxiv.org/pdf/2506.04606", "abs": "https://arxiv.org/abs/2506.04606", "authors": ["Alexander Huang-Menders", "Xinhang Liu", "Andy Xu", "Yuyao Zhang", "Chi-Keung Tang", "Yu-Wing Tai"], "title": "SmartAvatar: Text- and Image-Guided Human Avatar Generation with VLM AI Agents", "categories": ["cs.CV"], "comment": "16 pages", "summary": "SmartAvatar is a vision-language-agent-driven framework for generating fully\nrigged, animation-ready 3D human avatars from a single photo or textual prompt.\nWhile diffusion-based methods have made progress in general 3D object\ngeneration, they continue to struggle with precise control over human identity,\nbody shape, and animation readiness. In contrast, SmartAvatar leverages the\ncommonsense reasoning capabilities of large vision-language models (VLMs) in\ncombination with off-the-shelf parametric human generators to deliver\nhigh-quality, customizable avatars. A key innovation is an autonomous\nverification loop, where the agent renders draft avatars, evaluates facial\nsimilarity, anatomical plausibility, and prompt alignment, and iteratively\nadjusts generation parameters for convergence. This interactive, AI-guided\nrefinement process promotes fine-grained control over both facial and body\nfeatures, enabling users to iteratively refine their avatars via\nnatural-language conversations. Unlike diffusion models that rely on static\npre-trained datasets and offer limited flexibility, SmartAvatar brings users\ninto the modeling loop and ensures continuous improvement through an LLM-driven\nprocedural generation and verification system. The generated avatars are fully\nrigged and support pose manipulation with consistent identity and appearance,\nmaking them suitable for downstream animation and interactive applications.\nQuantitative benchmarks and user studies demonstrate that SmartAvatar\noutperforms recent text- and image-driven avatar generation systems in terms of\nreconstructed mesh quality, identity fidelity, attribute accuracy, and\nanimation readiness, making it a versatile tool for realistic, customizable\navatar creation on consumer-grade hardware.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04673", "pdf": "https://arxiv.org/pdf/2506.04673", "abs": "https://arxiv.org/abs/2506.04673", "authors": ["Zhong Ji", "Rongshuai Wei", "Jingren Liu", "Yanwei Pang", "Jungong Han"], "title": "Interpretable Few-Shot Image Classification via Prototypical Concept-Guided Mixture of LoRA Experts", "categories": ["cs.CV"], "comment": "13 pages,5 figures", "summary": "Self-Explainable Models (SEMs) rely on Prototypical Concept Learning (PCL) to\nenable their visual recognition processes more interpretable, but they often\nstruggle in data-scarce settings where insufficient training samples lead to\nsuboptimal performance.To address this limitation, we propose a Few-Shot\nPrototypical Concept Classification (FSPCC) framework that systematically\nmitigates two key challenges under low-data regimes: parametric imbalance and\nrepresentation misalignment. Specifically, our approach leverages a Mixture of\nLoRA Experts (MoLE) for parameter-efficient adaptation, ensuring a balanced\nallocation of trainable parameters between the backbone and the PCL\nmodule.Meanwhile, cross-module concept guidance enforces tight alignment\nbetween the backbone's feature representations and the prototypical concept\nactivation patterns.In addition, we incorporate a multi-level feature\npreservation strategy that fuses spatial and semantic cues across various\nlayers, thereby enriching the learned representations and mitigating the\nchallenges posed by limited data availability.Finally, to enhance\ninterpretability and minimize concept overlap, we introduce a geometry-aware\nconcept discrimination loss that enforces orthogonality among concepts,\nencouraging more disentangled and transparent decision boundaries.Experimental\nresults on six popular benchmarks (CUB-200-2011, mini-ImageNet, CIFAR-FS,\nStanford Cars, FGVC-Aircraft, and DTD) demonstrate that our approach\nconsistently outperforms existing SEMs by a notable margin, with 4.2%-8.7%\nrelative gains in 5-way 5-shot classification.These findings highlight the\nefficacy of coupling concept learning with few-shot adaptation to achieve both\nhigher accuracy and clearer model interpretability, paving the way for more\ntransparent visual recognition systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04704", "pdf": "https://arxiv.org/pdf/2506.04704", "abs": "https://arxiv.org/abs/2506.04704", "authors": ["Youngwan Lee", "Kangsan Kim", "Kwanyong Park", "Ilcahe Jung", "Soojin Jang", "Seanie Lee", "Yong-Ju Lee", "Sung Ju Hwang"], "title": "HoliSafe: Holistic Safety Benchmarking and Modeling with Safety Meta Token for Vision-Language Model", "categories": ["cs.CV", "cs.AI"], "comment": "Project page: https://youngwanlee.github.io/holisafe", "summary": "Despite emerging efforts to enhance the safety of Vision-Language Models\n(VLMs), current approaches face two main shortcomings. 1) Existing\nsafety-tuning datasets and benchmarks only partially consider how image-text\ninteractions can yield harmful content, often overlooking contextually unsafe\noutcomes from seemingly benign pairs. This narrow coverage leaves VLMs\nvulnerable to jailbreak attacks in unseen configurations. 2) Prior methods rely\nprimarily on data-centric tuning, with limited architectural innovations to\nintrinsically strengthen safety. We address these gaps by introducing a\nholistic safety dataset and benchmark, HoliSafe, that spans all five\nsafe/unsafe image-text combinations, providing a more robust basis for both\ntraining and evaluation. We further propose SafeLLaVA, a novel VLM augmented\nwith a learnable safety meta token and a dedicated safety head. The meta token\nencodes harmful visual cues during training, intrinsically guiding the language\nmodel toward safer responses, while the safety head offers interpretable\nharmfulness classification aligned with refusal rationales. Experiments show\nthat SafeLLaVA, trained on HoliSafe, achieves state-of-the-art safety\nperformance across multiple VLM benchmarks. Additionally, the HoliSafe\nbenchmark itself reveals critical vulnerabilities in existing models. We hope\nthat HoliSafe and SafeLLaVA will spur further research into robust and\ninterpretable VLM safety, expanding future avenues for multimodal alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "safety"], "score": 4}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04743", "pdf": "https://arxiv.org/pdf/2506.04743", "abs": "https://arxiv.org/abs/2506.04743", "authors": ["Shuhan Xu", "Siyuan Liang", "Hongling Zheng", "Yong Luo", "Aishan Liu", "Dacheng Tao"], "title": "SRD: Reinforcement-Learned Semantic Perturbation for Backdoor Defense in VLMs", "categories": ["cs.CV"], "comment": null, "summary": "Vision-Language Models (VLMs) have achieved remarkable performance in image\ncaptioning, but recent studies show they are vulnerable to backdoor attacks.\nAttackers can inject imperceptible perturbations-such as local pixel triggers\nor global semantic phrases-into the training data, causing the model to\ngenerate malicious, attacker-controlled captions for specific inputs. These\nattacks are hard to detect and defend due to their stealthiness and cross-modal\nnature. By analyzing attack samples, we identify two key vulnerabilities: (1)\nabnormal attention concentration on specific image regions, and (2) semantic\ndrift and incoherence in generated captions. To counter this, we propose\nSemantic Reward Defense (SRD), a reinforcement learning framework that\nmitigates backdoor behavior without prior knowledge of triggers. SRD uses a\nDeep Q-Network to learn policies for applying discrete perturbations (e.g.,\nocclusion, color masking) to sensitive image regions, aiming to disrupt the\nactivation of malicious pathways. We design a semantic fidelity score as the\nreward signal, which jointly evaluates semantic consistency and linguistic\nfluency of the output, guiding the agent toward generating robust yet faithful\ncaptions. Experiments across mainstream VLMs and datasets show SRD reduces\nattack success rates to 5.6%, while preserving caption quality on clean inputs\nwith less than 10% performance drop. SRD offers a trigger-agnostic,\ninterpretable defense paradigm against stealthy backdoor threats in multimodal\ngenerative models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04755", "pdf": "https://arxiv.org/pdf/2506.04755", "abs": "https://arxiv.org/abs/2506.04755", "authors": ["Shenshen Li", "Kaiyuan Deng", "Lei Wang", "Hao Yang", "Chong Peng", "Peng Yan", "Fumin Shen", "Heng Tao Shen", "Xing Xu"], "title": "Truth in the Few: High-Value Data Selection for Efficient Multi-Modal Reasoning", "categories": ["cs.CV", "cs.AI", "cs.MM"], "comment": null, "summary": "While multi-modal large language models (MLLMs) have made significant\nprogress in complex reasoning tasks via reinforcement learning, it is commonly\nbelieved that extensive training data is necessary for improving multi-modal\nreasoning ability, inevitably leading to data redundancy and substantial\ncomputational costs. However, can smaller high-value datasets match or\noutperform full corpora for multi-modal reasoning in MLLMs? In this work, we\nchallenge this assumption through a key observation: meaningful multi-modal\nreasoning is triggered by only a sparse subset of training samples, termed\ncognitive samples, whereas the majority contribute marginally. Building on this\ninsight, we propose a novel data selection paradigm termed Reasoning Activation\nPotential (RAP), which identifies cognitive samples by estimating each sample's\npotential to stimulate genuine multi-modal reasoning by two complementary\nestimators: 1) Causal Discrepancy Estimator (CDE) based on the potential\noutcome model principle, eliminates samples that overly rely on language priors\nby comparing outputs between multi-modal and text-only inputs; 2) Attention\nConfidence Estimator (ACE), which exploits token-level self-attention to\ndiscard samples dominated by irrelevant but over-emphasized tokens in\nintermediate reasoning stages. Moreover, we introduce a Difficulty-aware\nReplacement Module (DRM) to substitute trivial instances with cognitively\nchallenging ones, thereby ensuring complexity for robust multi-modal reasoning.\nExperiments on six datasets show that our RAP method consistently achieves\nsuperior performance using only 9.3% of the training data, while reducing\ncomputational costs by over 43%. Our code is available at\nhttps://github.com/Leo-ssl/RAP.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04789", "pdf": "https://arxiv.org/pdf/2506.04789", "abs": "https://arxiv.org/abs/2506.04789", "authors": ["Gaia Di Lorenzo", "Federico Tombari", "Marc Pollefeys", "Daniel Barath"], "title": "Object-X: Learning to Reconstruct Multi-Modal 3D Object Representations", "categories": ["cs.CV"], "comment": null, "summary": "Learning effective multi-modal 3D representations of objects is essential for\nnumerous applications, such as augmented reality and robotics. Existing methods\noften rely on task-specific embeddings that are tailored either for semantic\nunderstanding or geometric reconstruction. As a result, these embeddings\ntypically cannot be decoded into explicit geometry and simultaneously reused\nacross tasks. In this paper, we propose Object-X, a versatile multi-modal\nobject representation framework capable of encoding rich object embeddings\n(e.g. images, point cloud, text) and decoding them back into detailed geometric\nand visual reconstructions. Object-X operates by geometrically grounding the\ncaptured modalities in a 3D voxel grid and learning an unstructured embedding\nfusing the information from the voxels with the object attributes. The learned\nembedding enables 3D Gaussian Splatting-based object reconstruction, while also\nsupporting a range of downstream tasks, including scene alignment, single-image\n3D object reconstruction, and localization. Evaluations on two challenging\nreal-world datasets demonstrate that Object-X produces high-fidelity novel-view\nsynthesis comparable to standard 3D Gaussian Splatting, while significantly\nimproving geometric accuracy. Moreover, Object-X achieves competitive\nperformance with specialized methods in scene alignment and localization.\nCritically, our object-centric descriptors require 3-4 orders of magnitude less\nstorage compared to traditional image- or point cloud-based approaches,\nestablishing Object-X as a scalable and highly practical solution for\nmulti-modal 3D scene representation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04810", "pdf": "https://arxiv.org/pdf/2506.04810", "abs": "https://arxiv.org/abs/2506.04810", "authors": ["Yujun Zhou", "Jiayi Ye", "Zipeng Ling", "Yufei Han", "Yue Huang", "Haomin Zhuang", "Zhenwen Liang", "Kehan Guo", "Taicheng Guo", "Xiangqi Wang", "Xiangliang Zhang"], "title": "Dissecting Logical Reasoning in LLMs: A Fine-Grained Evaluation and Supervision Study", "categories": ["cs.CL", "cs.AI", "cs.LO"], "comment": null, "summary": "Logical reasoning is a core capability for many applications of large\nlanguage models (LLMs), yet existing benchmarks often rely solely on\nfinal-answer accuracy, failing to capture the quality and structure of the\nreasoning process. We propose FineLogic, a fine-grained evaluation framework\nthat assesses logical reasoning across three dimensions: overall benchmark\naccuracy, stepwise soundness, and representation-level alignment. In addition,\nto better understand how reasoning capabilities emerge, we conduct a\ncomprehensive study on the effects of supervision format during fine-tuning. We\nconstruct four supervision styles (one natural language and three symbolic\nvariants) and train LLMs under each. Our findings reveal that natural language\nsupervision yields strong generalization even on out-of-distribution and\nlong-context tasks, while symbolic reasoning styles promote more structurally\nsound and atomic inference chains. Further, our representation-level probing\nshows that fine-tuning primarily improves reasoning behaviors through\nstep-by-step generation, rather than enhancing shortcut prediction or\ninternalized correctness. Together, our framework and analysis provide a more\nrigorous and interpretable lens for evaluating and improving logical reasoning\nin LLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04811", "pdf": "https://arxiv.org/pdf/2506.04811", "abs": "https://arxiv.org/abs/2506.04811", "authors": ["Feijun Liu", "Huifeng Wang", "Kun Wang", "Yizhen Wang"], "title": "Design of intelligent proofreading system for English translation based on CNN and BERT", "categories": ["cs.CL"], "comment": null, "summary": "Since automatic translations can contain errors that require substantial\nhuman post-editing, machine translation proofreading is essential for improving\nquality. This paper proposes a novel hybrid approach for robust proofreading\nthat combines convolutional neural networks (CNN) with Bidirectional Encoder\nRepresentations from Transformers (BERT). In order to extract semantic\ninformation from phrases and expressions, CNN uses a variety of convolution\nkernel filters to capture local n-gram patterns. In the meanwhile, BERT creates\ncontext-rich representations of whole sequences by utilizing stacked\nbidirectional transformer encoders. Using BERT's attention processes, the\nintegrated error detection component relates tokens to spot translation\nirregularities including word order problems and omissions. The correction\nmodule then uses parallel English-German alignment and GRU decoder models in\nconjunction with translation memory to propose logical modifications that\nmaintain original meaning. A unified end-to-end training process optimized for\npost-editing performance is applied to the whole pipeline. The multi-domain\ncollection of WMT and the conversational dialogues of Open-Subtitles are two of\nthe English-German parallel corpora used to train the model. Multiple loss\nfunctions supervise detection and correction capabilities. Experiments attain a\n90% accuracy, 89.37% F1, and 16.24% MSE, exceeding recent proofreading\ntechniques by over 10% overall. Comparative benchmarking demonstrates\nstate-of-the-art performance in identifying and coherently rectifying\nmistranslations and omissions.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04830", "pdf": "https://arxiv.org/pdf/2506.04830", "abs": "https://arxiv.org/abs/2506.04830", "authors": ["Shuo Cao", "Yihao Liu", "Xiaohui Li. Yuanting Gao. Yu Zhou", "Chao Dong"], "title": "DualX-VSR: Dual Axial Spatial$\\times$Temporal Transformer for Real-World Video Super-Resolution without Motion Compensation", "categories": ["cs.CV"], "comment": "15 pages, 9 figures", "summary": "Transformer-based models like ViViT and TimeSformer have advanced video\nunderstanding by effectively modeling spatiotemporal dependencies. Recent video\ngeneration models, such as Sora and Vidu, further highlight the power of\ntransformers in long-range feature extraction and holistic spatiotemporal\nmodeling. However, directly applying these models to real-world video\nsuper-resolution (VSR) is challenging, as VSR demands pixel-level precision,\nwhich can be compromised by tokenization and sequential attention mechanisms.\nWhile recent transformer-based VSR models attempt to address these issues using\nsmaller patches and local attention, they still face limitations such as\nrestricted receptive fields and dependence on optical flow-based alignment,\nwhich can introduce inaccuracies in real-world settings. To overcome these\nissues, we propose Dual Axial Spatial$\\times$Temporal Transformer for\nReal-World Video Super-Resolution (DualX-VSR), which introduces a novel dual\naxial spatial$\\times$temporal attention mechanism that integrates spatial and\ntemporal information along orthogonal directions. DualX-VSR eliminates the need\nfor motion compensation, offering a simplified structure that provides a\ncohesive representation of spatiotemporal information. As a result, DualX-VSR\nachieves high fidelity and superior performance in real-world VSR task.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04832", "pdf": "https://arxiv.org/pdf/2506.04832", "abs": "https://arxiv.org/abs/2506.04832", "authors": ["Changyue Wang", "Weihang Su", "Qingyao Ai", "Yiqun Liu"], "title": "Joint Evaluation of Answer and Reasoning Consistency for Hallucination Detection in Large Reasoning Models", "categories": ["cs.CL"], "comment": null, "summary": "Large Reasoning Models (LRMs) extend large language models with explicit,\nmulti-step reasoning traces to enhance transparency and performance on complex\ntasks. However, these reasoning traces can be redundant or logically\ninconsistent, making them a new source of hallucination that is difficult to\ndetect. Existing hallucination detection methods focus primarily on\nanswer-level uncertainty and often fail to detect hallucinations or logical\ninconsistencies arising from the model's reasoning trace. This oversight is\nparticularly problematic for LRMs, where the explicit thinking trace is not\nonly an important support to the model's decision-making process but also a key\nsource of potential hallucination. To this end, we propose RACE (Reasoning and\nAnswer Consistency Evaluation), a novel framework specifically tailored for\nhallucination detection in LRMs. RACE operates by extracting essential\nreasoning steps and computing four diagnostic signals: inter-sample consistency\nof reasoning traces, entropy-based answer uncertainty, semantic alignment\nbetween reasoning and answers, and internal coherence of reasoning. This joint\nanalysis enables fine-grained hallucination detection even when the final\nanswer appears correct. Experiments across datasets and different LLMs\ndemonstrate that RACE outperforms existing hallucination detection baselines,\noffering a robust and generalizable solution for evaluating LRMs. Our code is\navailable at: https://github.com/bebr2/RACE.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["multi-step reasoning"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency", "fine-grained"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04848", "pdf": "https://arxiv.org/pdf/2506.04848", "abs": "https://arxiv.org/abs/2506.04848", "authors": ["Dávid Javorský", "Ondřej Bojar", "François Yvon"], "title": "MockConf: A Student Interpretation Dataset: Analysis, Word- and Span-level Alignment and Baselines", "categories": ["cs.CL"], "comment": "Accepted to ACL 2025 Main Conference", "summary": "In simultaneous interpreting, an interpreter renders a source speech into\nanother language with a very short lag, much sooner than sentences are\nfinished. In order to understand and later reproduce this dynamic and complex\ntask automatically, we need dedicated datasets and tools for analysis,\nmonitoring, and evaluation, such as parallel speech corpora, and tools for\ntheir automatic annotation. Existing parallel corpora of translated texts and\nassociated alignment algorithms hardly fill this gap, as they fail to model\nlong-range interactions between speech segments or specific types of\ndivergences (e.g., shortening, simplification, functional generalization)\nbetween the original and interpreted speeches. In this work, we introduce\nMockConf, a student interpreting dataset that was collected from Mock\nConferences run as part of the students' curriculum. This dataset contains 7\nhours of recordings in 5 European languages, transcribed and aligned at the\nlevel of spans and words. We further implement and release InterAlign, a modern\nweb-based annotation tool for parallel word and span annotations on long\ninputs, suitable for aligning simultaneous interpreting. We propose metrics for\nthe evaluation and a baseline for automatic alignment. Dataset and tools are\nreleased to the community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "annotation"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04956", "pdf": "https://arxiv.org/pdf/2506.04956", "abs": "https://arxiv.org/abs/2506.04956", "authors": ["Huihan Wang", "Zhiwen Yang", "Hui Zhang", "Dan Zhao", "Bingzheng Wei", "Yan Xu"], "title": "FEAT: Full-Dimensional Efficient Attention Transformer for Medical Video Generation", "categories": ["cs.CV"], "comment": "This paper has been early accepted by MICCAI 2025", "summary": "Synthesizing high-quality dynamic medical videos remains a significant\nchallenge due to the need for modeling both spatial consistency and temporal\ndynamics. Existing Transformer-based approaches face critical limitations,\nincluding insufficient channel interactions, high computational complexity from\nself-attention, and coarse denoising guidance from timestep embeddings when\nhandling varying noise levels. In this work, we propose FEAT, a\nfull-dimensional efficient attention Transformer, which addresses these issues\nthrough three key innovations: (1) a unified paradigm with sequential\nspatial-temporal-channel attention mechanisms to capture global dependencies\nacross all dimensions, (2) a linear-complexity design for attention mechanisms\nin each dimension, utilizing weighted key-value attention and global channel\nattention, and (3) a residual value guidance module that provides fine-grained\npixel-level guidance to adapt to different noise levels. We evaluate FEAT on\nstandard benchmarks and downstream tasks, demonstrating that FEAT-S, with only\n23\\% of the parameters of the state-of-the-art model Endora, achieves\ncomparable or even superior performance. Furthermore, FEAT-L surpasses all\ncomparison methods across multiple datasets, showcasing both superior\neffectiveness and scalability. Code is available at\nhttps://github.com/Yaziwel/FEAT.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "fine-grained", "dimension"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04999", "pdf": "https://arxiv.org/pdf/2506.04999", "abs": "https://arxiv.org/abs/2506.04999", "authors": ["Gengluo Li", "Huawen Shen", "Yu Zhou"], "title": "Beyond Cropped Regions: New Benchmark and Corresponding Baseline for Chinese Scene Text Retrieval in Diverse Layouts", "categories": ["cs.CV"], "comment": null, "summary": "Chinese scene text retrieval is a practical task that aims to search for\nimages containing visual instances of a Chinese query text. This task is\nextremely challenging because Chinese text often features complex and diverse\nlayouts in real-world scenes. Current efforts tend to inherit the solution for\nEnglish scene text retrieval, failing to achieve satisfactory performance. In\nthis paper, we establish a Diversified Layout benchmark for Chinese Street View\nText Retrieval (DL-CSVTR), which is specifically designed to evaluate retrieval\nperformance across various text layouts, including vertical, cross-line, and\npartial alignments. To address the limitations in existing methods, we propose\nChinese Scene Text Retrieval CLIP (CSTR-CLIP), a novel model that integrates\nglobal visual information with multi-granularity alignment training. CSTR-CLIP\napplies a two-stage training process to overcome previous limitations, such as\nthe exclusion of visual features outside the text region and reliance on\nsingle-granularity alignment, thereby enabling the model to effectively handle\ndiverse text layouts. Experiments on existing benchmark show that CSTR-CLIP\noutperforms the previous state-of-the-art model by 18.82% accuracy and also\nprovides faster inference speed. Further analysis on DL-CSVTR confirms the\nsuperior performance of CSTR-CLIP in handling various text layouts. The dataset\nand code will be publicly available to facilitate research in Chinese scene\ntext retrieval.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05057", "pdf": "https://arxiv.org/pdf/2506.05057", "abs": "https://arxiv.org/abs/2506.05057", "authors": ["Moshe Ofer", "Orel Zamler", "Amos Azaria"], "title": "TALL -- A Trainable Architecture for Enhancing LLM Performance in Low-Resource Languages", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large Language Models (LLMs) excel in high-resource languages but struggle\nwith low-resource languages due to limited training data. This paper presents\nTALL (Trainable Architecture for Enhancing LLM Performance in Low-Resource\nLanguages), which integrates an LLM with two bilingual translation models. TALL\ntransforms low-resource inputs into high-resource representations, leveraging\nthe LLM's capabilities while preserving linguistic features through dimension\nalignment layers and custom transformers. Our experiments on Hebrew demonstrate\nsignificant improvements over several baselines, including direct use, naive\ntranslation, and fine-tuning approaches. The architecture employs a\nparameter-efficient strategy, freezing pre-trained components while training\nonly lightweight adapter modules, balancing computational efficiency with\nperformance gains.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dimension"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05046", "pdf": "https://arxiv.org/pdf/2506.05046", "abs": "https://arxiv.org/abs/2506.05046", "authors": ["Guangzhao Li", "Yanming Yang", "Chenxi Song", "Chi Zhang"], "title": "FlowDirector: Training-Free Flow Steering for Precise Text-to-Video Editing", "categories": ["cs.CV"], "comment": "Project Page is https://flowdirector-edit.github.io", "summary": "Text-driven video editing aims to modify video content according to natural\nlanguage instructions. While recent training-free approaches have made progress\nby leveraging pre-trained diffusion models, they typically rely on\ninversion-based techniques that map input videos into the latent space, which\noften leads to temporal inconsistencies and degraded structural fidelity. To\naddress this, we propose FlowDirector, a novel inversion-free video editing\nframework. Our framework models the editing process as a direct evolution in\ndata space, guiding the video via an Ordinary Differential Equation (ODE) to\nsmoothly transition along its inherent spatiotemporal manifold, thereby\npreserving temporal coherence and structural details. To achieve localized and\ncontrollable edits, we introduce an attention-guided masking mechanism that\nmodulates the ODE velocity field, preserving non-target regions both spatially\nand temporally. Furthermore, to address incomplete edits and enhance semantic\nalignment with editing instructions, we present a guidance-enhanced editing\nstrategy inspired by Classifier-Free Guidance, which leverages differential\nsignals between multiple candidate flows to steer the editing trajectory toward\nstronger semantic alignment without compromising structural consistency.\nExtensive experiments across benchmarks demonstrate that FlowDirector achieves\nstate-of-the-art performance in instruction adherence, temporal consistency,\nand background preservation, establishing a new paradigm for efficient and\ncoherent video editing without inversion.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05121", "pdf": "https://arxiv.org/pdf/2506.05121", "abs": "https://arxiv.org/abs/2506.05121", "authors": ["Hong-Yun Lin", "Tien-Hong Lo", "Yu-Hsuan Fang", "Jhen-Ke Lin", "Chung-Chun Wang", "Hao-Chien Lu", "Berlin Chen"], "title": "The NTNU System at the S&I Challenge 2025 SLA Open Track", "categories": ["cs.CL", "cs.SD", "eess.AS"], "comment": "submitted to the ISCA SLaTE-2025 Workshop", "summary": "A recent line of research on spoken language assessment (SLA) employs neural\nmodels such as BERT and wav2vec 2.0 (W2V) to evaluate speaking proficiency\nacross linguistic and acoustic modalities. Although both models effectively\ncapture features relevant to oral competence, each exhibits modality-specific\nlimitations. BERT-based methods rely on ASR transcripts, which often fail to\ncapture prosodic and phonetic cues for SLA. In contrast, W2V-based methods\nexcel at modeling acoustic features but lack semantic interpretability. To\novercome these limitations, we propose a system that integrates W2V with Phi-4\nmultimodal large language model (MLLM) through a score fusion strategy. The\nproposed system achieves a root mean square error (RMSE) of 0.375 on the\nofficial test set of the Speak & Improve Challenge 2025, securing second place\nin the competition. For comparison, the RMSEs of the top-ranked, third-ranked,\nand official baseline systems are 0.364, 0.384, and 0.444, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05095", "pdf": "https://arxiv.org/pdf/2506.05095", "abs": "https://arxiv.org/abs/2506.05095", "authors": ["Jiaee Cheong", "Yang Liu", "Harold Soh", "Hatice Gunes"], "title": "FG 2025 TrustFAA: the First Workshop on Towards Trustworthy Facial Affect Analysis: Advancing Insights of Fairness, Explainability, and Safety (TrustFAA)", "categories": ["cs.CV"], "comment": null, "summary": "With the increasing prevalence and deployment of Emotion AI-powered facial\naffect analysis (FAA) tools, concerns about the trustworthiness of these\nsystems have become more prominent. This first workshop on \"Towards Trustworthy\nFacial Affect Analysis: Advancing Insights of Fairness, Explainability, and\nSafety (TrustFAA)\" aims to bring together researchers who are investigating\ndifferent challenges in relation to trustworthiness-such as interpretability,\nuncertainty, biases, and privacy-across various facial affect analysis tasks,\nincluding macro/ micro-expression recognition, facial action unit detection,\nother corresponding applications such as pain and depression detection, as well\nas human-robot interaction and collaboration. In alignment with FG2025's\nemphasis on ethics, as demonstrated by the inclusion of an Ethical Impact\nStatement requirement for this year's submissions, this workshop supports\nFG2025's efforts by encouraging research, discussion and dialogue on\ntrustworthy FAA.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "dialogue"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05154", "pdf": "https://arxiv.org/pdf/2506.05154", "abs": "https://arxiv.org/abs/2506.05154", "authors": ["Chenyu Lin", "Yilin Wen", "Du Su", "Fei Sun", "Muhan Chen", "Chenfu Bao", "Zhonghou Lv"], "title": "Knowledgeable-r1: Policy Optimization for Knowledge Exploration in Retrieval-Augmented Generation", "categories": ["cs.CL", "cs.AI", "cs.IR"], "comment": null, "summary": "Retrieval-augmented generation (RAG) is a mainstream method for improving\nperformance on knowledge-intensive tasks. However,current RAG systems often\nplace too much emphasis on retrieved contexts. This can lead to reliance on\ninaccurate sources and overlook the model's inherent knowledge, especially when\ndealing with misleading or excessive information. To resolve this imbalance, we\npropose Knowledgeable-r1 that using joint sampling and define multi policy\ndistributions in knowledge capability exploration to stimulate large language\nmodels'self-integrated utilization of parametric and contextual knowledge.\nExperiments show that Knowledgeable-r1 significantly enhances robustness and\nreasoning accuracy in both parameters and contextual conflict tasks and general\nRAG tasks, especially outperforming baselines by 17.07% in counterfactual\nscenarios and demonstrating consistent gains across RAG tasks. Our code are\navailable at https://github.com/lcy80366872/ knowledgeable-r1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05217", "pdf": "https://arxiv.org/pdf/2506.05217", "abs": "https://arxiv.org/abs/2506.05217", "authors": ["Wenhao Hu", "Xuexiang Wen", "Xi Li", "Gaoang Wang"], "title": "DSG-World: Learning a 3D Gaussian World Model from Dual State Videos", "categories": ["cs.CV"], "comment": null, "summary": "Building an efficient and physically consistent world model from limited\nobservations is a long standing challenge in vision and robotics. Many existing\nworld modeling pipelines are based on implicit generative models, which are\nhard to train and often lack 3D or physical consistency. On the other hand,\nexplicit 3D methods built from a single state often require multi-stage\nprocessing-such as segmentation, background completion, and inpainting-due to\nocclusions. To address this, we leverage two perturbed observations of the same\nscene under different object configurations. These dual states offer\ncomplementary visibility, alleviating occlusion issues during state transitions\nand enabling more stable and complete reconstruction. In this paper, we present\nDSG-World, a novel end-to-end framework that explicitly constructs a 3D\nGaussian World model from Dual State observations. Our approach builds dual\nsegmentation-aware Gaussian fields and enforces bidirectional photometric and\nsemantic consistency. We further introduce a pseudo intermediate state for\nsymmetric alignment and design collaborative co-pruning trategies to refine\ngeometric completeness. DSG-World enables efficient real-to-simulation transfer\npurely in the explicit Gaussian representation space, supporting high-fidelity\nrendering and object-level scene manipulation without relying on dense\nobservations or multi-stage pipelines. Extensive experiments demonstrate strong\ngeneralization to novel views and scene states, highlighting the effectiveness\nof our approach for real-world 3D reconstruction and simulation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05334", "pdf": "https://arxiv.org/pdf/2506.05334", "abs": "https://arxiv.org/abs/2506.05334", "authors": ["Mihran Miroyan", "Tsung-Han Wu", "Logan King", "Tianle Li", "Jiayi Pan", "Xinyan Hu", "Wei-Lin Chiang", "Anastasios N. Angelopoulos", "Trevor Darrell", "Narges Norouzi", "Joseph E. Gonzalez"], "title": "Search Arena: Analyzing Search-Augmented LLMs", "categories": ["cs.CL", "cs.IR", "cs.LG"], "comment": "Preprint. Code: https://github.com/lmarena/search-arena. Dataset:\n  https://huggingface.co/datasets/lmarena-ai/search-arena-24k", "summary": "Search-augmented language models combine web search with Large Language\nModels (LLMs) to improve response groundedness and freshness. However,\nanalyzing these systems remains challenging: existing datasets are limited in\nscale and narrow in scope, often constrained to static, single-turn,\nfact-checking questions. In this work, we introduce Search Arena, a\ncrowd-sourced, large-scale, human-preference dataset of over 24,000 paired\nmulti-turn user interactions with search-augmented LLMs. The dataset spans\ndiverse intents and languages, and contains full system traces with around\n12,000 human preference votes. Our analysis reveals that user preferences are\ninfluenced by the number of citations, even when the cited content does not\ndirectly support the attributed claims, uncovering a gap between perceived and\nactual credibility. Furthermore, user preferences vary across cited sources,\nrevealing that community-driven platforms are generally preferred and static\nencyclopedic sources are not always appropriate and reliable. To assess\nperformance across different settings, we conduct cross-arena analyses by\ntesting search-augmented LLMs in a general-purpose chat environment and\nconventional LLMs in search-intensive settings. We find that web search does\nnot degrade and may even improve performance in non-search settings; however,\nthe quality in search settings is significantly affected if solely relying on\nthe model's parametric knowledge. We open-sourced the dataset to support future\nresearch in this direction. Our dataset and code are available at:\nhttps://github.com/lmarena/search-arena.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "preference dataset", "human preference"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05250", "pdf": "https://arxiv.org/pdf/2506.05250", "abs": "https://arxiv.org/abs/2506.05250", "authors": ["Zhiyun Deng", "Dongmyeong Lee", "Amanda Adkins", "Jesse Quattrociocchi", "Christian Ellis", "Joydeep Biswas"], "title": "Spatiotemporal Contrastive Learning for Cross-View Video Localization in Unstructured Off-road Terrains", "categories": ["cs.CV", "cs.RO"], "comment": null, "summary": "Robust cross-view 3-DoF localization in GPS-denied, off-road environments\nremains challenging due to (1) perceptual ambiguities from repetitive\nvegetation and unstructured terrain, and (2) seasonal shifts that significantly\nalter scene appearance, hindering alignment with outdated satellite imagery. To\naddress this, we introduce MoViX, a self-supervised cross-view video\nlocalization framework that learns viewpoint- and season-invariant\nrepresentations while preserving directional awareness essential for accurate\nlocalization. MoViX employs a pose-dependent positive sampling strategy to\nenhance directional discrimination and temporally aligned hard negative mining\nto discourage shortcut learning from seasonal cues. A motion-informed frame\nsampler selects spatially diverse frames, and a lightweight temporal aggregator\nemphasizes geometrically aligned observations while downweighting ambiguous\nones. At inference, MoViX runs within a Monte Carlo Localization framework,\nusing a learned cross-view matching module in place of handcrafted models.\nEntropy-guided temperature scaling enables robust multi-hypothesis tracking and\nconfident convergence under visual ambiguity. We evaluate MoViX on the\nTartanDrive 2.0 dataset, training on under 30 minutes of data and testing over\n12.29 km. Despite outdated satellite imagery, MoViX localizes within 25 meters\nof ground truth 93% of the time, and within 50 meters 100% of the time in\nunseen regions, outperforming state-of-the-art baselines without\nenvironment-specific tuning. We further demonstrate generalization on a\nreal-world off-road dataset from a geographically distinct site with a\ndifferent robot platform.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04245", "pdf": "https://arxiv.org/pdf/2506.04245", "abs": "https://arxiv.org/abs/2506.04245", "authors": ["Guangchen Lan", "Huseyin A. Inan", "Sahar Abdelnabi", "Janardhan Kulkarni", "Lukas Wutschitz", "Reza Shokri", "Christopher G. Brinton", "Robert Sim"], "title": "Contextual Integrity in LLMs via Reasoning and Reinforcement Learning", "categories": ["cs.AI", "cs.CL", "cs.LG", "I.2.6; I.2.7"], "comment": null, "summary": "As the era of autonomous agents making decisions on behalf of users unfolds,\nensuring contextual integrity (CI) -- what is the appropriate information to\nshare while carrying out a certain task -- becomes a central question to the\nfield. We posit that CI demands a form of reasoning where the agent needs to\nreason about the context in which it is operating. To test this, we first\nprompt LLMs to reason explicitly about CI when deciding what information to\ndisclose. We then extend this approach by developing a reinforcement learning\n(RL) framework that further instills in models the reasoning necessary to\nachieve CI. Using a synthetic, automatically created, dataset of only $\\sim700$\nexamples but with diverse contexts and information disclosure norms, we show\nthat our method substantially reduces inappropriate information disclosure\nwhile maintaining task performance across multiple model sizes and families.\nImportantly, improvements transfer from this synthetic dataset to established\nCI benchmarks such as PrivacyLens that has human annotations and evaluates\nprivacy leakage of AI assistants in actions and tool calls.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05282", "pdf": "https://arxiv.org/pdf/2506.05282", "abs": "https://arxiv.org/abs/2506.05282", "authors": ["Tao Sun", "Liyuan Zhu", "Shengyu Huang", "Shuran Song", "Iro Armeni"], "title": "Rectified Point Flow: Generic Point Cloud Pose Estimation", "categories": ["cs.CV", "cs.AI", "cs.RO"], "comment": "Project page: https://rectified-pointflow.github.io/", "summary": "We introduce Rectified Point Flow, a unified parameterization that formulates\npairwise point cloud registration and multi-part shape assembly as a single\nconditional generative problem. Given unposed point clouds, our method learns a\ncontinuous point-wise velocity field that transports noisy points toward their\ntarget positions, from which part poses are recovered. In contrast to prior\nwork that regresses part-wise poses with ad-hoc symmetry handling, our method\nintrinsically learns assembly symmetries without symmetry labels. Together with\na self-supervised encoder focused on overlapping points, our method achieves a\nnew state-of-the-art performance on six benchmarks spanning pairwise\nregistration and shape assembly. Notably, our unified formulation enables\neffective joint training on diverse datasets, facilitating the learning of\nshared geometric priors and consequently boosting accuracy. Project page:\nhttps://rectified-pointflow.github.io/.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04518", "pdf": "https://arxiv.org/pdf/2506.04518", "abs": "https://arxiv.org/abs/2506.04518", "authors": ["Haibin Wu", "Yuxuan Hu", "Ruchao Fan", "Xiaofei Wang", "Kenichi Kumatani", "Bo Ren", "Jianwei Yu", "Heng Lu", "Lijuan Wang", "Yao Qian", "Jinyu Li"], "title": "Towards Efficient Speech-Text Jointly Decoding within One Speech Language Model", "categories": ["eess.AS", "cs.CL"], "comment": null, "summary": "Speech language models (Speech LMs) enable end-to-end speech-text modelling\nwithin a single model, offering a promising direction for spoken dialogue\nsystems. The choice of speech-text jointly decoding paradigm plays a critical\nrole in performance, efficiency, and alignment quality. In this work, we\nsystematically compare representative joint speech-text decoding\nstrategies-including the interleaved, and parallel generation paradigms-under a\ncontrolled experimental setup using the same base language model, speech\ntokenizer and training data. Our results show that the interleaved approach\nachieves the best alignment. However it suffers from slow inference due to long\ntoken sequence length. To address this, we propose a novel early-stop\ninterleaved (ESI) pattern that not only significantly accelerates decoding but\nalso yields slightly better performance. Additionally, we curate high-quality\nquestion answering (QA) datasets to further improve speech QA performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue", "question answering"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05289", "pdf": "https://arxiv.org/pdf/2506.05289", "abs": "https://arxiv.org/abs/2506.05289", "authors": ["Pingyu Wu", "Kai Zhu", "Yu Liu", "Longxiang Tang", "Jian Yang", "Yansong Peng", "Wei Zhai", "Yang Cao", "Zheng-Jun Zha"], "title": "AliTok: Towards Sequence Modeling Alignment between Tokenizer and Autoregressive Model", "categories": ["cs.CV"], "comment": "Code: https://github.com/ali-vilab/alitok", "summary": "Autoregressive image generation aims to predict the next token based on\nprevious ones. However, existing image tokenizers encode tokens with\nbidirectional dependencies during the compression process, which hinders the\neffective modeling by autoregressive models. In this paper, we propose a novel\nAligned Tokenizer (AliTok), which utilizes a causal decoder to establish\nunidirectional dependencies among encoded tokens, thereby aligning the token\nmodeling approach between the tokenizer and autoregressive model. Furthermore,\nby incorporating prefix tokens and employing two-stage tokenizer training to\nenhance reconstruction consistency, AliTok achieves great reconstruction\nperformance while being generation-friendly. On ImageNet-256 benchmark, using a\nstandard decoder-only autoregressive model as the generator with only 177M\nparameters, AliTok achieves a gFID score of 1.50 and an IS of 305.9. When the\nparameter count is increased to 662M, AliTok achieves a gFID score of 1.35,\nsurpassing the state-of-the-art diffusion method with 10x faster sampling\nspeed. The code and weights are available at\nhttps://github.com/ali-vilab/alitok.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04652", "pdf": "https://arxiv.org/pdf/2506.04652", "abs": "https://arxiv.org/abs/2506.04652", "authors": ["Yi-Cheng Lin", "Huang-Cheng Chou", "Yu-Hsuan Li Liang", "Hung-yi Lee"], "title": "EMO-Debias: Benchmarking Gender Debiasing Techniques in Multi-Label Speech Emotion Recognition", "categories": ["eess.AS", "cs.CL"], "comment": "8 pages", "summary": "Speech emotion recognition (SER) systems often exhibit gender bias. However,\nthe effectiveness and robustness of existing debiasing methods in such\nmulti-label scenarios remain underexplored. To address this gap, we present\nEMO-Debias, a large-scale comparison of 13 debiasing methods applied to\nmulti-label SER. Our study encompasses techniques from pre-processing,\nregularization, adversarial learning, biased learners, and distributionally\nrobust optimization. Experiments conducted on acted and naturalistic emotion\ndatasets, using WavLM and XLSR representations, evaluate each method under\nconditions of gender imbalance. Our analysis quantifies the trade-offs between\nfairness and accuracy, identifying which approaches consistently reduce gender\nperformance gaps without compromising overall model performance. The findings\nprovide actionable insights for selecting effective debiasing strategies and\nhighlight the impact of dataset distributions.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04760", "pdf": "https://arxiv.org/pdf/2506.04760", "abs": "https://arxiv.org/abs/2506.04760", "authors": ["Lingyuan Liu", "Mengxiang Zhang"], "title": "Exp4Fuse: A Rank Fusion Framework for Enhanced Sparse Retrieval using Large Language Model-based Query Expansion", "categories": ["cs.IR", "cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) have shown potential in generating hypothetical\ndocuments for query expansion, thereby enhancing information retrieval\nperformance. However, the efficacy of this method is highly dependent on the\nquality of the generated documents, which often requires complex prompt\nstrategies and the integration of advanced dense retrieval techniques. This can\nbe both costly and computationally intensive. To mitigate these limitations, we\nexplore the use of zero-shot LLM-based query expansion to improve sparse\nretrieval, particularly for learned sparse retrievers. We introduce a novel\nfusion ranking framework, Exp4Fuse, which enhances the performance of sparse\nretrievers through an indirect application of zero-shot LLM-based query\nexpansion. Exp4Fuse operates by simultaneously considering two retrieval\nroutes-one based on the original query and the other on the LLM-augmented\nquery. It then generates two ranked lists using a sparse retriever and fuses\nthem using a modified reciprocal rank fusion method. We conduct extensive\nevaluations of Exp4Fuse against leading LLM-based query expansion methods and\nadvanced retrieval techniques on three MS MARCO-related datasets and seven\nlow-resource datasets. Experimental results reveal that Exp4Fuse not only\nsurpasses existing LLM-based query expansion methods in enhancing sparse\nretrievers but also, when combined with advanced sparse retrievers, achieves\nSOTA results on several benchmarks. This highlights the superior performance\nand effectiveness of Exp4Fuse in improving query expansion for sparse\nretrieval.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05318", "pdf": "https://arxiv.org/pdf/2506.05318", "abs": "https://arxiv.org/abs/2506.05318", "authors": ["Haoyuan Li", "Yanpeng Zhou", "Yufei Gao", "Tao Tang", "Jianhua Han", "Yujie Yuan", "Dave Zhenyu Chen", "Jiawang Bian", "Hang Xu", "Xiaodan Liang"], "title": "Does Your 3D Encoder Really Work? When Pretrain-SFT from 2D VLMs Meets 3D VLMs", "categories": ["cs.CV"], "comment": null, "summary": "Remarkable progress in 2D Vision-Language Models (VLMs) has spurred interest\nin extending them to 3D settings for tasks like 3D Question Answering, Dense\nCaptioning, and Visual Grounding. Unlike 2D VLMs that typically process images\nthrough an image encoder, 3D scenes, with their intricate spatial structures,\nallow for diverse model architectures. Based on their encoder design, this\npaper categorizes recent 3D VLMs into 3D object-centric, 2D image-based, and 3D\nscene-centric approaches. Despite the architectural similarity of 3D\nscene-centric VLMs to their 2D counterparts, they have exhibited comparatively\nlower performance compared with the latest 3D object-centric and 2D image-based\napproaches. To understand this gap, we conduct an in-depth analysis, revealing\nthat 3D scene-centric VLMs show limited reliance on the 3D scene encoder, and\nthe pre-train stage appears less effective than in 2D VLMs. Furthermore, we\nobserve that data scaling benefits are less pronounced on larger datasets. Our\ninvestigation suggests that while these models possess cross-modal alignment\ncapabilities, they tend to over-rely on linguistic cues and overfit to frequent\nanswer distributions, thereby diminishing the effective utilization of the 3D\nencoder. To address these limitations and encourage genuine 3D scene\nunderstanding, we introduce a novel 3D Relevance Discrimination QA dataset\ndesigned to disrupt shortcut learning and improve 3D understanding. Our\nfindings highlight the need for advanced evaluation and improved strategies for\nbetter 3D understanding in 3D VLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "question answering"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04909", "pdf": "https://arxiv.org/pdf/2506.04909", "abs": "https://arxiv.org/abs/2506.04909", "authors": ["Kai Wang", "Yihao Zhang", "Meng Sun"], "title": "When Thinking LLMs Lie: Unveiling the Strategic Deception in Representations of Reasoning Models", "categories": ["cs.AI", "cs.CL", "cs.CR", "cs.LG"], "comment": null, "summary": "The honesty of large language models (LLMs) is a critical alignment\nchallenge, especially as advanced systems with chain-of-thought (CoT) reasoning\nmay strategically deceive humans. Unlike traditional honesty issues on LLMs,\nwhich could be possibly explained as some kind of hallucination, those models'\nexplicit thought paths enable us to study strategic deception--goal-driven,\nintentional misinformation where reasoning contradicts outputs. Using\nrepresentation engineering, we systematically induce, detect, and control such\ndeception in CoT-enabled LLMs, extracting \"deception vectors\" via Linear\nArtificial Tomography (LAT) for 89% detection accuracy. Through activation\nsteering, we achieve a 40% success rate in eliciting context-appropriate\ndeception without explicit prompts, unveiling the specific honesty-related\nissue of reasoning models and providing tools for trustworthy AI alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["honesty", "accuracy"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05328", "pdf": "https://arxiv.org/pdf/2506.05328", "abs": "https://arxiv.org/abs/2506.05328", "authors": ["Lidong Lu", "Guo Chen", "Zhiqi Li", "Yicheng Liu", "Tong Lu"], "title": "AV-Reasoner: Improving and Benchmarking Clue-Grounded Audio-Visual Counting for MLLMs", "categories": ["cs.CV"], "comment": "21 pages, 11 figures", "summary": "Despite progress in video understanding, current MLLMs struggle with counting\ntasks. Existing benchmarks are limited by short videos, close-set queries, lack\nof clue annotations, and weak multimodal coverage. In this paper, we introduce\nCG-AV-Counting, a manually-annotated clue-grounded counting benchmark with\n1,027 multimodal questions and 5,845 annotated clues over 497 long videos. It\nsupports both black-box and white-box evaluation, serving as a comprehensive\ntestbed for both end-to-end and reasoning-based counting. To explore ways to\nimprove model's counting capability, we propose AV-Reasoner, a model trained\nwith GRPO and curriculum learning to generalize counting ability from related\ntasks. AV-Reasoner achieves state-of-the-art results across multiple\nbenchmarks, demonstrating the effectiveness of reinforcement learning. However,\nexperiments show that on out-of-domain benchmarks, reasoning in the language\nspace fails to bring performance gains. The code and benchmark have been\nrealeased on https://av-reasoner.github.io.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "testbed"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05336", "pdf": "https://arxiv.org/pdf/2506.05336", "abs": "https://arxiv.org/abs/2506.05336", "authors": ["Ghazi Shazan Ahmad", "Ahmed Heakl", "Hanan Gani", "Abdelrahman Shaker", "Zhiqiang Shen", "Ranjay Krishna", "Fahad Shahbaz Khan", "Salman Khan"], "title": "VideoMolmo: Spatio-Temporal Grounding Meets Pointing", "categories": ["cs.CV"], "comment": "20 pages, 13 figures", "summary": "Spatio-temporal localization is vital for precise interactions across diverse\ndomains, from biological research to autonomous navigation and interactive\ninterfaces. Current video-based approaches, while proficient in tracking, lack\nthe sophisticated reasoning capabilities of large language models, limiting\ntheir contextual understanding and generalization. We introduce VideoMolmo, a\nlarge multimodal model tailored for fine-grained spatio-temporal pointing\nconditioned on textual descriptions. Building upon the Molmo architecture,\nVideoMolmo incorporates a temporal module utilizing an attention mechanism to\ncondition each frame on preceding frames, ensuring temporal consistency.\nAdditionally, our novel temporal mask fusion pipeline employs SAM2 for\nbidirectional point propagation, significantly enhancing coherence across video\nsequences. This two-step decomposition, i.e., first using the LLM to generate\nprecise pointing coordinates, then relying on a sequential mask-fusion module\nto produce coherent segmentation, not only simplifies the task for the language\nmodel but also enhances interpretability. Due to the lack of suitable datasets,\nwe curate a comprehensive dataset comprising 72k video-caption pairs annotated\nwith 100k object points. To evaluate the generalization of VideoMolmo, we\nintroduce VPoS-Bench, a challenging out-of-distribution benchmark spanning five\nreal-world scenarios: Cell Tracking, Egocentric Vision, Autonomous Driving,\nVideo-GUI Interaction, and Robotics. We also evaluate our model on Referring\nVideo Object Segmentation (Refer-VOS) and Reasoning VOS tasks. In comparison to\nexisting models, VideoMolmo substantially improves spatio-temporal pointing\naccuracy and reasoning capability. Our code and models are publicly available\nat https://github.com/mbzuai-oryx/VideoMolmo.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "consistency", "accuracy", "fine-grained"], "score": 5}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05341", "pdf": "https://arxiv.org/pdf/2506.05341", "abs": "https://arxiv.org/abs/2506.05341", "authors": ["Xingjian Ran", "Yixuan Li", "Linning Xu", "Mulin Yu", "Bo Dai"], "title": "Direct Numerical Layout Generation for 3D Indoor Scene Synthesis via Spatial Reasoning", "categories": ["cs.CV", "cs.AI"], "comment": "Project Page: https://directlayout.github.io/", "summary": "Realistic 3D indoor scene synthesis is vital for embodied AI and digital\ncontent creation. It can be naturally divided into two subtasks: object\ngeneration and layout generation. While recent generative models have\nsignificantly advanced object-level quality and controllability, layout\ngeneration remains challenging due to limited datasets. Existing methods either\noverfit to these datasets or rely on predefined constraints to optimize\nnumerical layout that sacrifice flexibility. As a result, they fail to generate\nscenes that are both open-vocabulary and aligned with fine-grained user\ninstructions. We introduce DirectLayout, a framework that directly generates\nnumerical 3D layouts from text descriptions using generalizable spatial\nreasoning of large language models (LLMs). DirectLayout decomposes the\ngeneration into three stages: producing a Bird's-Eye View (BEV) layout, lifting\nit into 3D space, and refining object placements. To enable explicit spatial\nreasoning and help the model grasp basic principles of object placement, we\nemploy Chain-of-Thought (CoT) Activation based on the 3D-Front dataset.\nAdditionally, we design CoT-Grounded Generative Layout Reward to enhance\ngeneralization and spatial planning. During inference, DirectLayout addresses\nasset-layout mismatches via Iterative Asset-Layout Alignment through in-context\nlearning. Extensive experiments demonstrate that DirectLayout achieves\nimpressive semantic consistency, generalization and physical plausibility.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "fine-grained"], "score": 3}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05316", "pdf": "https://arxiv.org/pdf/2506.05316", "abs": "https://arxiv.org/abs/2506.05316", "authors": ["Yifan Sun", "Jingyan Shen", "Yibin Wang", "Tianyu Chen", "Zhendong Wang", "Mingyuan Zhou", "Huan Zhang"], "title": "Improving Data Efficiency for LLM Reinforcement Fine-tuning Through Difficulty-targeted Online Data Selection and Rollout Replay", "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Reinforcement learning (RL) has become an effective approach for fine-tuning\nlarge language models (LLMs), particularly to enhance their reasoning\ncapabilities. However, RL fine-tuning remains highly resource-intensive, and\nexisting work has largely overlooked the problem of data efficiency. In this\npaper, we propose two techniques to improve data efficiency in LLM RL\nfine-tuning: difficulty-targeted online data selection and rollout replay. We\nintroduce the notion of adaptive difficulty to guide online data selection,\nprioritizing questions of moderate difficulty that are more likely to yield\ninformative learning signals. To estimate adaptive difficulty efficiently, we\ndevelop an attention-based framework that requires rollouts for only a small\nreference set of questions. The adaptive difficulty of the remaining questions\nis then estimated based on their similarity to this set. To further reduce\nrollout cost, we introduce a rollout replay mechanism that reuses recent\nrollouts, lowering per-step computation while maintaining stable updates.\nExtensive experiments across 6 LLM-dataset combinations show that our method\nreduces RL fine-tuning time by 25% to 65% to reach the same level of\nperformance as the original GRPO algorithm.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05346", "pdf": "https://arxiv.org/pdf/2506.05346", "abs": "https://arxiv.org/abs/2506.05346", "authors": ["Lei Hsiung", "Tianyu Pang", "Yung-Chen Tang", "Linyue Song", "Tsung-Yi Ho", "Pin-Yu Chen", "Yaoqing Yang"], "title": "Why LLM Safety Guardrails Collapse After Fine-tuning: A Similarity Analysis Between Alignment and Fine-tuning Datasets", "categories": ["cs.CR", "cs.CL", "cs.LG"], "comment": "Project Page: https://hsiung.cc/llm-similarity-risk/", "summary": "Recent advancements in large language models (LLMs) have underscored their\nvulnerability to safety alignment jailbreaks, particularly when subjected to\ndownstream fine-tuning. However, existing mitigation strategies primarily focus\non reactively addressing jailbreak incidents after safety guardrails have been\ncompromised, removing harmful gradients during fine-tuning, or continuously\nreinforcing safety alignment throughout fine-tuning. As such, they tend to\noverlook a critical upstream factor: the role of the original safety-alignment\ndata. This paper therefore investigates the degradation of safety guardrails\nthrough the lens of representation similarity between upstream alignment\ndatasets and downstream fine-tuning tasks. Our experiments demonstrate that\nhigh similarity between these datasets significantly weakens safety guardrails,\nmaking models more susceptible to jailbreaks. Conversely, low similarity\nbetween these two types of datasets yields substantially more robust models and\nthus reduces harmfulness score by up to 10.33%. By highlighting the importance\nof upstream dataset design in the building of durable safety guardrails and\nreducing real-world vulnerability to jailbreak attacks, these findings offer\nactionable insights for fine-tuning service providers.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04598", "pdf": "https://arxiv.org/pdf/2506.04598", "abs": "https://arxiv.org/abs/2506.04598", "authors": ["Marianna Nezhurina", "Tomer Porian", "Giovanni Pucceti", "Tommie Kerssies", "Romain Beaumont", "Mehdi Cherti", "Jenia Jitsev"], "title": "Scaling Laws for Robust Comparison of Open Foundation Language-Vision Models and Datasets", "categories": ["cs.LG", "cs.AI", "cs.CV"], "comment": "Preprint. In Review", "summary": "In studies of transferable learning, scaling laws are obtained for various\nimportant foundation models to predict their properties and performance at\nlarger scales. We show here how scaling law derivation can also be used for\nmodel and dataset comparison, allowing to decide which procedure is to be\npreferred for pre-training. For the first time, full scaling laws based on\ndense measurements across a wide span of model and samples seen scales are\nderived for two important language-vision learning procedures, CLIP and MaMMUT,\nthat use either contrastive only or contrastive and captioning text generative\nloss. Ensuring sufficient prediction accuracy for held out points, we use\nderived scaling laws to compare both models, obtaining evidence for MaMMUT's\nstronger improvement with scale and better sample efficiency than standard\nCLIP. To strengthen validity of the comparison, we show scaling laws for\nvarious downstream tasks, classification, retrieval, and segmentation, and for\ndifferent open datasets, DataComp, DFN and Re-LAION, observing consistently the\nsame trends. We show that comparison can also be performed when deriving\nscaling laws with a constant learning rate schedule, reducing compute cost.\nAccurate derivation of scaling laws provides thus means to perform model and\ndataset comparison across scale spans, avoiding misleading conclusions based on\nmeasurements from single reference scales only, paving the road for systematic\ncomparison and improvement of open foundation models and datasets for their\ncreation. We release all the pre-trained models with their intermediate\ncheckpoints, including openMaMMUT-L/14, which achieves $80.3\\%$ zero-shot\nImageNet-1k accuracy, trained on 12.8B samples from DataComp-1.4B. Code for\nreproducing experiments in the paper and raw experiments data can be found at\nhttps://github.com/LAION-AI/scaling-laws-for-comparison.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale", "scaling law"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.04623", "pdf": "https://arxiv.org/pdf/2506.04623", "abs": "https://arxiv.org/abs/2506.04623", "authors": ["Wuyang Li", "Zhu Yu", "Alexandre Alahi"], "title": "VoxDet: Rethinking 3D Semantic Occupancy Prediction as Dense Object Detection", "categories": ["cs.GR", "cs.CV"], "comment": "Project Page: https://vita-epfl.github.io/VoxDet/", "summary": "3D semantic occupancy prediction aims to reconstruct the 3D geometry and\nsemantics of the surrounding environment. With dense voxel labels, prior works\ntypically formulate it as a dense segmentation task, independently classifying\neach voxel. However, this paradigm neglects critical instance-centric\ndiscriminability, leading to instance-level incompleteness and adjacent\nambiguities. To address this, we highlight a free lunch of occupancy labels:\nthe voxel-level class label implicitly provides insight at the instance level,\nwhich is overlooked by the community. Motivated by this observation, we first\nintroduce a training-free Voxel-to-Instance (VoxNT) trick: a simple yet\neffective method that freely converts voxel-level class labels into\ninstance-level offset labels. Building on this, we further propose VoxDet, an\ninstance-centric framework that reformulates the voxel-level occupancy\nprediction as dense object detection by decoupling it into two sub-tasks:\noffset regression and semantic prediction. Specifically, based on the lifted 3D\nvolume, VoxDet first uses (a) Spatially-decoupled Voxel Encoder to generate\ndisentangled feature volumes for the two sub-tasks, which learn task-specific\nspatial deformation in the densely projected tri-perceptive space. Then, we\ndeploy (b) Task-decoupled Dense Predictor to address this task via dense\ndetection. Here, we first regress a 4D offset field to estimate distances (6\ndirections) between voxels and object borders in the voxel space. The regressed\noffsets are then used to guide the instance-level aggregation in the\nclassification branch, achieving instance-aware prediction. Experiments show\nthat VoxDet can be deployed on both camera and LiDAR input, jointly achieving\nstate-of-the-art results on both benchmarks. VoxDet is not only highly\nefficient, but also achieves 63.0 IoU on the SemanticKITTI test set, ranking\n1st on the online leaderboard.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
{"id": "2506.05240", "pdf": "https://arxiv.org/pdf/2506.05240", "abs": "https://arxiv.org/abs/2506.05240", "authors": ["Yizhuo Li", "Yuying Ge", "Yixiao Ge", "Ying Shan", "Ping Luo"], "title": "Aligning Latent Spaces with Flow Priors", "categories": ["cs.LG", "cs.CV"], "comment": null, "summary": "This paper presents a novel framework for aligning learnable latent spaces to\narbitrary target distributions by leveraging flow-based generative models as\npriors. Our method first pretrains a flow model on the target features to\ncapture the underlying distribution. This fixed flow model subsequently\nregularizes the latent space via an alignment loss, which reformulates the flow\nmatching objective to treat the latents as optimization targets. We formally\nprove that minimizing this alignment loss establishes a computationally\ntractable surrogate objective for maximizing a variational lower bound on the\nlog-likelihood of latents under the target distribution. Notably, the proposed\nmethod eliminates computationally expensive likelihood evaluations and avoids\nODE solving during optimization. As a proof of concept, we demonstrate in a\ncontrolled setting that the alignment loss landscape closely approximates the\nnegative log-likelihood of the target distribution. We further validate the\neffectiveness of our approach through large-scale image generation experiments\non ImageNet with diverse target distributions, accompanied by detailed\ndiscussions and ablation studies. With both theoretical and empirical\nvalidation, our framework paves a new way for latent space alignment.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-06.jsonl"}
