{"id": "2508.13426", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13426", "abs": "https://arxiv.org/abs/2508.13426", "authors": ["Chunhua Liu", "Kabir Manandhar Shrestha", "Sukai Huang"], "title": "ALIGN: Word Association Learning for Cross-Cultural Generalization in Large Language Models", "comment": null, "summary": "As large language models (LLMs) increasingly mediate cross-cultural\ncommunication, their behavior still reflects the distributional bias of the\nlanguages and viewpoints that are over-represented in their pre-training\ncorpora. Yet, it remains a challenge to model and align culture due to limited\ncultural knowledge and a lack of exploration into effective learning\napproaches. We introduce a cost-efficient, cognitively grounded remedy:\nparameter-efficient fine-tuning on native speakers' free word-association\nnorms, which encode implicit cultural schemas. Leveraging English-US and\nMandarin associations from the Small-World-of-Words project, we adapt\nLlama-3.1-8B and Qwen-2.5-7B via supervised fine-tuning (SFT) and PPO-based\npreference optimization. SFT boosts held-out association Precision at 5 by\n16-20% in English and 43-165% in Mandarin, lifts median concreteness by +0.20,\nand attains human-level valence and arousal. These lexical gains transfer: on\nWorld-Values-Survey questions, fine-tuned models shift answer distributions\ntoward the target culture, and on a 50-item high-tension subset, Qwen's\nChinese-aligned responses double while Llama's US bias drops by one-third. Our\n7-8B models rival or beat vanilla 70B baselines, showing that a few million\nculture-grounded associations can instill value alignment without costly\nretraining. Our work highlights both the promise and the need for future\nresearch grounded in human cognition in improving cultural alignment in AI\nmodels.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["PPO", "preference", "alignment", "value alignment"], "score": 4}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13426", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13426", "abs": "https://arxiv.org/abs/2508.13426", "authors": ["Chunhua Liu", "Kabir Manandhar Shrestha", "Sukai Huang"], "title": "ALIGN: Word Association Learning for Cross-Cultural Generalization in Large Language Models", "comment": null, "summary": "As large language models (LLMs) increasingly mediate cross-cultural\ncommunication, their behavior still reflects the distributional bias of the\nlanguages and viewpoints that are over-represented in their pre-training\ncorpora. Yet, it remains a challenge to model and align culture due to limited\ncultural knowledge and a lack of exploration into effective learning\napproaches. We introduce a cost-efficient, cognitively grounded remedy:\nparameter-efficient fine-tuning on native speakers' free word-association\nnorms, which encode implicit cultural schemas. Leveraging English-US and\nMandarin associations from the Small-World-of-Words project, we adapt\nLlama-3.1-8B and Qwen-2.5-7B via supervised fine-tuning (SFT) and PPO-based\npreference optimization. SFT boosts held-out association Precision at 5 by\n16-20% in English and 43-165% in Mandarin, lifts median concreteness by +0.20,\nand attains human-level valence and arousal. These lexical gains transfer: on\nWorld-Values-Survey questions, fine-tuned models shift answer distributions\ntoward the target culture, and on a 50-item high-tension subset, Qwen's\nChinese-aligned responses double while Llama's US bias drops by one-third. Our\n7-8B models rival or beat vanilla 70B baselines, showing that a few million\nculture-grounded associations can instill value alignment without costly\nretraining. Our work highlights both the promise and the need for future\nresearch grounded in human cognition in improving cultural alignment in AI\nmodels.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["PPO", "preference", "alignment", "value alignment"], "score": 4}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13993", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13993", "abs": "https://arxiv.org/abs/2508.13993", "authors": ["Shaohua Duan", "Xinze Li", "Zhenghao Liu", "Xiaoyuan Yi", "Yukun Yan", "Shuo Wang", "Yu Gu", "Ge Yu", "Maosong Sun"], "title": "Chunks as Arms: Multi-Armed Bandit-Guided Sampling for Long-Context LLM Preference Optimization", "comment": null, "summary": "Long-context modeling is critical for a wide range of real-world tasks,\nincluding long-context question answering, summarization, and complex reasoning\ntasks. Recent studies have explored fine-tuning Large Language Models (LLMs)\nwith synthetic data to enhance their long-context capabilities. However, the\neffectiveness of such approaches is often limited by the low diversity and\nfactual inconsistencies in the generated data. To address these challenges, we\npropose LongMab-PO, a novel framework that leverages a Multi-Armed Bandit (MAB)\nrollout strategy to identify the most informative chunks from the given long\ncontext for sampling high-quality and diverse responses and constructing\npreference data pairs for Direct Preference Optimization (DPO) training.\nSpecifically, we treat context chunks as arms of MAB, select chunks based on\ntheir expected reward scores to input into LLMs to generate responses, and\niteratively update these scores based on reward feedback. This exploration and\nexploitation process enables the model to focus on the most relevant context\nsegments, thereby generating and collecting high-quality and diverse responses.\nFinally, we collect these generated responses from the rollout process and\napply the DPO method to further optimize the LLM. Experimental results show\nthat LongMab-PO significantly improves the diversity and quality of preference\ndata pairs, achieving state-of-the-art performance on long-context reasoning\nbenchmarks. All code and data will be released on\nhttps://github.com/NEUIR/LongMab-PO.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization", "question answering"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13911", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13911", "abs": "https://arxiv.org/abs/2508.13911", "authors": ["Chunji Lv", "Zequn Chen", "Donglin Di", "Weinan Zhang", "Hao Li", "Wei Chen", "Changsheng Li"], "title": "PhysGM: Large Physical Gaussian Model for Feed-Forward 4D Synthesis", "comment": null, "summary": "While physics-grounded 3D motion synthesis has seen significant progress,\ncurrent methods face critical limitations. They typically rely on\npre-reconstructed 3D Gaussian Splatting (3DGS) representations, while physics\nintegration depends on either inflexible, manually defined physical attributes\nor unstable, optimization-heavy guidance from video models. To overcome these\nchallenges, we introduce PhysGM, a feed-forward framework that jointly predicts\na 3D Gaussian representation and its physical properties from a single image,\nenabling immediate, physical simulation and high-fidelity 4D rendering. We\nfirst establish a base model by jointly optimizing for Gaussian reconstruction\nand probabilistic physics prediction. The model is then refined with physically\nplausible reference videos to enhance both rendering fidelity and physics\nprediction accuracy. We adopt the Direct Preference Optimization (DPO) to align\nits simulations with reference videos, circumventing Score Distillation\nSampling (SDS) optimization which needs back-propagating gradients through the\ncomplex differentiable simulation and rasterization. To facilitate the\ntraining, we introduce a new dataset PhysAssets of over 24,000 3D assets,\nannotated with physical properties and corresponding guiding videos.\nExperimental results demonstrate that our method effectively generates\nhigh-fidelity 4D simulations from a single image in one minute. This represents\na significant speedup over prior works while delivering realistic rendering\nresults. Our project page is at:https://hihixiaolv.github.io/PhysGM.github.io/", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13993", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13993", "abs": "https://arxiv.org/abs/2508.13993", "authors": ["Shaohua Duan", "Xinze Li", "Zhenghao Liu", "Xiaoyuan Yi", "Yukun Yan", "Shuo Wang", "Yu Gu", "Ge Yu", "Maosong Sun"], "title": "Chunks as Arms: Multi-Armed Bandit-Guided Sampling for Long-Context LLM Preference Optimization", "comment": null, "summary": "Long-context modeling is critical for a wide range of real-world tasks,\nincluding long-context question answering, summarization, and complex reasoning\ntasks. Recent studies have explored fine-tuning Large Language Models (LLMs)\nwith synthetic data to enhance their long-context capabilities. However, the\neffectiveness of such approaches is often limited by the low diversity and\nfactual inconsistencies in the generated data. To address these challenges, we\npropose LongMab-PO, a novel framework that leverages a Multi-Armed Bandit (MAB)\nrollout strategy to identify the most informative chunks from the given long\ncontext for sampling high-quality and diverse responses and constructing\npreference data pairs for Direct Preference Optimization (DPO) training.\nSpecifically, we treat context chunks as arms of MAB, select chunks based on\ntheir expected reward scores to input into LLMs to generate responses, and\niteratively update these scores based on reward feedback. This exploration and\nexploitation process enables the model to focus on the most relevant context\nsegments, thereby generating and collecting high-quality and diverse responses.\nFinally, we collect these generated responses from the rollout process and\napply the DPO method to further optimize the LLM. Experimental results show\nthat LongMab-PO significantly improves the diversity and quality of preference\ndata pairs, achieving state-of-the-art performance on long-context reasoning\nbenchmarks. All code and data will be released on\nhttps://github.com/NEUIR/LongMab-PO.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization", "question answering"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13382", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13382", "abs": "https://arxiv.org/abs/2508.13382", "authors": ["Ayoub Ben Chaliah", "Hela Dellagi"], "title": "Datarus-R1: An Adaptive Multi-Step Reasoning LLM for Automated Data Analysis", "comment": null, "summary": "We present Datarus-R1-14B, a 14 B-parameter open-weights language model\nfine-tuned from Qwen 2.5-14B-Instruct to act as a virtual data analyst and\ngraduate-level problem solver. Datarus is trained not on isolated\nquestion-answer pairs but on full analytical trajectories including reasoning\nsteps, code execution, error traces, self-corrections, and final conclusions,\nall captured in a ReAct-style notebook format spanning finance, medicine,\nnumerical analysis, and other quantitative domains. Our training pipeline\ncombines (i) a trajectory-centric synthetic data generator that yielded 144 000\ntagged notebook episodes, (ii) a dual-reward framework blending a lightweight\ntag-based structural signal with a Hierarchical Reward Model (HRM) that scores\nboth single-step soundness and end-to-end coherence, and (iii) a\nmemory-optimized implementation of Group Relative Policy Optimization (GRPO)\nfeaturing KV-cache reuse, sequential generation, and reference-model sharding.\nA cosine curriculum smoothly shifts emphasis from structural fidelity to\nsemantic depth, reducing the format collapse and verbosity that often plague\nRL-aligned LLMs. A central design choice in Datarus is it dual reasoning\ninterface. In agentic mode the model produces ReAct-tagged steps that invoke\nPython tools to execute real code; in reflection mode it outputs compact\nChain-of-Thought (CoT) traces delimited by <think> and <answer> tags. On\ndemanding postgraduate-level problems, Datarus exhibits an \"AHA-moment\"\npattern: it sketches hypotheses, revises them once or twice, and converges\navoiding the circular, token-inflating loops common to contemporary systems.\nAcross standard public benchmarks Datarus surpasses similar size models and\neven reaches the level of larger reasoning models such as QwQ-32B achieving up\nto 30% higher accuracy on AIME 2024/2025 and LiveCodeBench while emitting\n18-49% fewer tokens per solution.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["multi-step reasoning"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13514", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13514", "abs": "https://arxiv.org/abs/2508.13514", "authors": ["Hongxin Ding", "Baixiang Huang", "Yue Fang", "Weibin Liao", "Xinke Jiang", "Zheng Li", "Junfeng Zhao", "Yasha Wang"], "title": "ProMed: Shapley Information Gain Guided Reinforcement Learning for Proactive Medical LLMs", "comment": null, "summary": "Interactive medical questioning is essential in real-world clinical\nconsultations, where physicians must actively gather information from patients.\nWhile medical Large Language Models (LLMs) have shown impressive capabilities\nin static medical question answering, they predominantly operate under a\nreactive paradigm: generating answers directly without seeking additional\ninformation, which risks incorrect diagnoses in such interactive settings. To\naddress this limitation, we propose ProMed, a reinforcement learning (RL)\nframework that transitions medical LLMs toward a proactive paradigm, equipping\nthem with the ability to ask clinically valuable questions before\ndecision-making. At the core of ProMed is the Shapley Information Gain (SIG)\nreward, which quantifies the clinical utility of each question by combining the\namount of newly acquired information with its contextual importance, estimated\nvia Shapley values. We integrate SIG into a two-stage training pipeline: (1)\nSIG-Guided Model Initialization uses Monte Carlo Tree Search (MCTS) to\nconstruct high-reward interaction trajectories to supervise the model, and (2)\nSIG-Augmented Policy Optimization, which integrates SIG and enhances RL with a\nnovel SIG-guided Reward Distribution Mechanism that assigns higher rewards to\ninformative questions for targeted optimization. Extensive experiments on two\nnewly curated partial-information medical benchmarks demonstrate that ProMed\nsignificantly outperforms state-of-the-art methods by an average of 6.29% and\ndelivers a 54.45% gain over the reactive paradigm, while also generalizing\nrobustly to out-of-domain cases.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["monte carlo tree search", "MCTS"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13250", "categories": ["cs.AI", "cs.CL", "cs.IR"], "pdf": "https://arxiv.org/pdf/2508.13250", "abs": "https://arxiv.org/abs/2508.13250", "authors": ["Zeyu Zhang", "Yang Zhang", "Haoran Tan", "Rui Li", "Xu Chen"], "title": "Explicit v.s. Implicit Memory: Exploring Multi-hop Complex Reasoning Over Personalized Information", "comment": "15 pages, 13 figures, 3 tables", "summary": "In large language model-based agents, memory serves as a critical capability\nfor achieving personalization by storing and utilizing users' information.\nAlthough some previous studies have adopted memory to implement user\npersonalization, they typically focus on preference alignment and simple\nquestion-answering. However, in the real world, complex tasks often require\nmulti-hop reasoning on a large amount of user information, which poses\nsignificant challenges for current memory approaches. To address this\nlimitation, we propose the multi-hop personalized reasoning task to explore how\ndifferent memory mechanisms perform in multi-hop reasoning over personalized\ninformation. We explicitly define this task and construct a dataset along with\na unified evaluation framework. Then, we implement various explicit and\nimplicit memory methods and conduct comprehensive experiments. We evaluate\ntheir performance on this task from multiple perspectives and analyze their\nstrengths and weaknesses. Besides, we explore hybrid approaches that combine\nboth paradigms and propose the HybridMem method to address their limitations.\nWe demonstrate the effectiveness of our proposed model through extensive\nexperiments. To benefit the research community, we release this project at\nhttps://github.com/nuster1128/MPR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13743", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13743", "abs": "https://arxiv.org/abs/2508.13743", "authors": ["Kaiwei Zhang", "Qi Jia", "Zijian Chen", "Wei Sun", "Xiangyang Zhu", "Chunyi Li", "Dandan Zhu", "Guangtao Zhai"], "title": "Sycophancy under Pressure: Evaluating and Mitigating Sycophantic Bias via Adversarial Dialogues in Scientific QA", "comment": null, "summary": "Large language models (LLMs), while increasingly used in domains requiring\nfactual rigor, often display a troubling behavior: sycophancy, the tendency to\nalign with user beliefs regardless of correctness. This tendency is reinforced\nby preference-based alignment techniques that optimize for user satisfaction\nbut can undermine truthfulness. While relatively benign in casual dialogue,\nsycophancy poses serious risks in high-stakes settings such as scientific\nquestion answering (QA), where model outputs may shape collaborative reasoning,\ndecision-making, and knowledge formation. Despite its importance, this\nphenomenon remains underexamined in factual QA contexts. We address this gap by\nintroducing a unified evaluation framework to quantify the impact of\nsycophantic context on model behavior in scientific QA, measuring how much\nuser-imposed social pressure distorts model outputs. The framework incorporates\nadversarial prompting setups and targeted metrics, such as misleading\nresistance and sycophancy resistance, that capture a model's ability to\nmaintain factual consistency under misleading cues. Systematic evaluations\nacross open-source and proprietary models reveal pervasive sycophantic\ntendencies, driven more by alignment strategy than by model size. To mitigate\nthis issue, we propose Pressure-Tune, a lightweight post-training method that\nfine-tunes models on synthetic adversarial dialogues paired with\nchain-of-thought rationales. These rationales reject user misinformation while\nreinforcing factual commitments. Experiments on challenging scientific QA\nbenchmarks show that Pressure-Tune significantly enhances sycophancy resistance\nwithout compromising accuracy or responsiveness to valid feedback, offering a\npractical pathway toward more truthful and principled model behavior.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "truthfulness", "consistency", "accuracy", "dialogue", "question answering"], "score": 6}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13250", "categories": ["cs.AI", "cs.CL", "cs.IR"], "pdf": "https://arxiv.org/pdf/2508.13250", "abs": "https://arxiv.org/abs/2508.13250", "authors": ["Zeyu Zhang", "Yang Zhang", "Haoran Tan", "Rui Li", "Xu Chen"], "title": "Explicit v.s. Implicit Memory: Exploring Multi-hop Complex Reasoning Over Personalized Information", "comment": "15 pages, 13 figures, 3 tables", "summary": "In large language model-based agents, memory serves as a critical capability\nfor achieving personalization by storing and utilizing users' information.\nAlthough some previous studies have adopted memory to implement user\npersonalization, they typically focus on preference alignment and simple\nquestion-answering. However, in the real world, complex tasks often require\nmulti-hop reasoning on a large amount of user information, which poses\nsignificant challenges for current memory approaches. To address this\nlimitation, we propose the multi-hop personalized reasoning task to explore how\ndifferent memory mechanisms perform in multi-hop reasoning over personalized\ninformation. We explicitly define this task and construct a dataset along with\na unified evaluation framework. Then, we implement various explicit and\nimplicit memory methods and conduct comprehensive experiments. We evaluate\ntheir performance on this task from multiple perspectives and analyze their\nstrengths and weaknesses. Besides, we explore hybrid approaches that combine\nboth paradigms and propose the HybridMem method to address their limitations.\nWe demonstrate the effectiveness of our proposed model through extensive\nexperiments. To benefit the research community, we release this project at\nhttps://github.com/nuster1128/MPR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13382", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13382", "abs": "https://arxiv.org/abs/2508.13382", "authors": ["Ayoub Ben Chaliah", "Hela Dellagi"], "title": "Datarus-R1: An Adaptive Multi-Step Reasoning LLM for Automated Data Analysis", "comment": null, "summary": "We present Datarus-R1-14B, a 14 B-parameter open-weights language model\nfine-tuned from Qwen 2.5-14B-Instruct to act as a virtual data analyst and\ngraduate-level problem solver. Datarus is trained not on isolated\nquestion-answer pairs but on full analytical trajectories including reasoning\nsteps, code execution, error traces, self-corrections, and final conclusions,\nall captured in a ReAct-style notebook format spanning finance, medicine,\nnumerical analysis, and other quantitative domains. Our training pipeline\ncombines (i) a trajectory-centric synthetic data generator that yielded 144 000\ntagged notebook episodes, (ii) a dual-reward framework blending a lightweight\ntag-based structural signal with a Hierarchical Reward Model (HRM) that scores\nboth single-step soundness and end-to-end coherence, and (iii) a\nmemory-optimized implementation of Group Relative Policy Optimization (GRPO)\nfeaturing KV-cache reuse, sequential generation, and reference-model sharding.\nA cosine curriculum smoothly shifts emphasis from structural fidelity to\nsemantic depth, reducing the format collapse and verbosity that often plague\nRL-aligned LLMs. A central design choice in Datarus is it dual reasoning\ninterface. In agentic mode the model produces ReAct-tagged steps that invoke\nPython tools to execute real code; in reflection mode it outputs compact\nChain-of-Thought (CoT) traces delimited by <think> and <answer> tags. On\ndemanding postgraduate-level problems, Datarus exhibits an \"AHA-moment\"\npattern: it sketches hypotheses, revises them once or twice, and converges\navoiding the circular, token-inflating loops common to contemporary systems.\nAcross standard public benchmarks Datarus surpasses similar size models and\neven reaches the level of larger reasoning models such as QwQ-32B achieving up\nto 30% higher accuracy on AIME 2024/2025 and LiveCodeBench while emitting\n18-49% fewer tokens per solution.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["multi-step reasoning"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13514", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13514", "abs": "https://arxiv.org/abs/2508.13514", "authors": ["Hongxin Ding", "Baixiang Huang", "Yue Fang", "Weibin Liao", "Xinke Jiang", "Zheng Li", "Junfeng Zhao", "Yasha Wang"], "title": "ProMed: Shapley Information Gain Guided Reinforcement Learning for Proactive Medical LLMs", "comment": null, "summary": "Interactive medical questioning is essential in real-world clinical\nconsultations, where physicians must actively gather information from patients.\nWhile medical Large Language Models (LLMs) have shown impressive capabilities\nin static medical question answering, they predominantly operate under a\nreactive paradigm: generating answers directly without seeking additional\ninformation, which risks incorrect diagnoses in such interactive settings. To\naddress this limitation, we propose ProMed, a reinforcement learning (RL)\nframework that transitions medical LLMs toward a proactive paradigm, equipping\nthem with the ability to ask clinically valuable questions before\ndecision-making. At the core of ProMed is the Shapley Information Gain (SIG)\nreward, which quantifies the clinical utility of each question by combining the\namount of newly acquired information with its contextual importance, estimated\nvia Shapley values. We integrate SIG into a two-stage training pipeline: (1)\nSIG-Guided Model Initialization uses Monte Carlo Tree Search (MCTS) to\nconstruct high-reward interaction trajectories to supervise the model, and (2)\nSIG-Augmented Policy Optimization, which integrates SIG and enhances RL with a\nnovel SIG-guided Reward Distribution Mechanism that assigns higher rewards to\ninformative questions for targeted optimization. Extensive experiments on two\nnewly curated partial-information medical benchmarks demonstrate that ProMed\nsignificantly outperforms state-of-the-art methods by an average of 6.29% and\ndelivers a 54.45% gain over the reactive paradigm, while also generalizing\nrobustly to out-of-domain cases.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["monte carlo tree search", "MCTS"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14006", "categories": ["cs.CV", "cs.RO", "68T45"], "pdf": "https://arxiv.org/pdf/2508.14006", "abs": "https://arxiv.org/abs/2508.14006", "authors": ["Mohamed Abouagour", "Eleftherios Garyfallidis"], "title": "ResPlan: A Large-Scale Vector-Graph Dataset of 17,000 Residential Floor Plans", "comment": "18 pages, 3 figures, 4 tables", "summary": "We introduce ResPlan, a large-scale dataset of 17,000 detailed, structurally\nrich, and realistic residential floor plans, created to advance spatial AI\nresearch. Each plan includes precise annotations of architectural elements\n(walls, doors, windows, balconies) and functional spaces (such as kitchens,\nbedrooms, and bathrooms). ResPlan addresses key limitations of existing\ndatasets such as RPLAN (Wu et al., 2019) and MSD (van Engelenburg et al., 2024)\nby offering enhanced visual fidelity and greater structural diversity,\nreflecting realistic and non-idealized residential layouts. Designed as a\nversatile, general-purpose resource, ResPlan supports a wide range of\napplications including robotics, reinforcement learning, generative AI, virtual\nand augmented reality, simulations, and game development. Plans are provided in\nboth geometric and graph-based formats, enabling direct integration into\nsimulation engines and fast 3D conversion. A key contribution is an open-source\npipeline for geometry cleaning, alignment, and annotation refinement.\nAdditionally, ResPlan includes structured representations of room connectivity,\nsupporting graph-based spatial reasoning tasks. Finally, we present comparative\nanalyses with existing benchmarks and outline several open benchmark tasks\nenabled by ResPlan. Ultimately, ResPlan offers a significant advance in scale,\nrealism, and usability, providing a robust foundation for developing and\nbenchmarking next-generation spatial intelligence systems.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation"], "score": 3}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13738", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2508.13738", "abs": "https://arxiv.org/abs/2508.13738", "authors": ["Shidong Wang", "Renato Pajarola"], "title": "Eliminating Rasterization: Direct Vector Floor Plan Generation with DiffPlanner", "comment": "accepted to IEEE Transactions on Visualization and Computer Graphics", "summary": "The boundary-constrained floor plan generation problem aims to generate the\ntopological and geometric properties of a set of rooms within a given boundary.\nRecently, learning-based methods have made significant progress in generating\nrealistic floor plans. However, these methods involve a workflow of converting\nvector data into raster images, using image-based generative models, and then\nconverting the results back into vector data. This process is complex and\nredundant, often resulting in information loss. Raster images, unlike vector\ndata, cannot scale without losing detail and precision. To address these\nissues, we propose a novel deep learning framework called DiffPlanner for\nboundary-constrained floor plan generation, which operates entirely in vector\nspace. Our framework is a Transformer-based conditional diffusion model that\nintegrates an alignment mechanism in training, aligning the optimization\ntrajectory of the model with the iterative design processes of designers. This\nenables our model to handle complex vector data, better fit the distribution of\nthe predicted targets, accomplish the challenging task of floor plan layout\ndesign, and achieve user-controllable generation. We conduct quantitative\ncomparisons, qualitative evaluations, ablation experiments, and perceptual\nstudies to evaluate our method. Extensive experiments demonstrate that\nDiffPlanner surpasses existing state-of-the-art methods in generating floor\nplans and bubble diagrams in the creative stages, offering more controllability\nto users and producing higher-quality results that closely match the ground\ntruths.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13167", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13167", "abs": "https://arxiv.org/abs/2508.13167", "authors": ["Weizhen Li", "Jianbo Lin", "Zhuosong Jiang", "Jingyi Cao", "Xinpeng Liu", "Jiayu Zhang", "Zhenqiang Huang", "Qianben Chen", "Weichen Sun", "Qiexiang Wang", "Hongxuan Lu", "Tianrui Qin", "Chenghao Zhu", "Yi Yao", "Shuying Fan", "Xiaowan Li", "Tiannan Wang", "Pai Liu", "King Zhu", "He Zhu", "Dingfeng Shi", "Piaohong Wang", "Yeyi Guan", "Xiangru Tang", "Minghao Liu", "Yuchen Eleanor Jiang", "Jian Yang", "Jiaheng Liu", "Ge Zhang", "Wangchunshu Zhou"], "title": "Chain-of-Agents: End-to-End Agent Foundation Models via Multi-Agent Distillation and Agentic RL", "comment": "51 pages", "summary": "Recent advances in large language models (LLMs) and multi-agent systems have\ndemonstrated remarkable capabilities in complex problem-solving tasks such as\ndeep research, vibe coding, and mathematical reasoning. However, most existing\nmulti-agent systems are built upon manual prompt/workflow engineering with\nsophisticated agent frameworks, making them computationally inefficient, less\ncapable, and can not benefit from data-centric learning. In this work, we\nintroduce Chain-of-Agents (CoA), a novel paradigm of LLM reasoning that enables\nnative end-to-end complex problem-solving in the same way as a multi-agent\nsystem (i.e., multi-turn problem solving with multiple tools and multiple\nagents) within one model. In chain-of-agents problem-solving, the model\ndynamically activates different tool agents and role-playing agents to simulate\nmulti-agent collaboration in an end-to-end fashion. To elicit end-to-end\nchain-of-agents problem-solving abilities in LLMs, we introduce a multi-agent\ndistillation framework to distill state-of-the-art multi-agent systems into\nchain-of-agents trajectories for agentic supervised fine-tuning. We then use\nagentic reinforcement learning on verifiable agentic tasks to further improve\nthe models' capabilities on chain-of-agents problem solving. We call the\nresulting models Agent Foundation Models (AFMs). Our empirical studies\ndemonstrate that AFM establishes new state-of-the-art performance across\ndiverse benchmarks in both web agent and code agent settings. We make the\nentire research, including the model weights, code for training and evaluation,\nand the training data, fully open-sourced, which offers a solid starting point\nfor future research on agent models and agentic RL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "mathematical reasoning"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13223", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13223", "abs": "https://arxiv.org/abs/2508.13223", "authors": ["Cheng Xia", "Manxi Lin", "Jiexiang Tan", "Xiaoxiong Du", "Yang Qiu", "Junjun Zheng", "Xiangheng Kong", "Yuning Jiang", "Bo Zheng"], "title": "MIRAGE: Towards AI-Generated Image Detection in the Wild", "comment": null, "summary": "The spreading of AI-generated images (AIGI), driven by advances in generative\nAI, poses a significant threat to information security and public trust.\nExisting AIGI detectors, while effective against images in clean laboratory\nsettings, fail to generalize to in-the-wild scenarios. These real-world images\nare noisy, varying from ``obviously fake\" images to realistic ones derived from\nmultiple generative models and further edited for quality control. We address\nin-the-wild AIGI detection in this paper. We introduce Mirage, a challenging\nbenchmark designed to emulate the complexity of in-the-wild AIGI. Mirage is\nconstructed from two sources: (1) a large corpus of Internet-sourced AIGI\nverified by human experts, and (2) a synthesized dataset created through the\ncollaboration between multiple expert generators, closely simulating the\nrealistic AIGI in the wild. Building on this benchmark, we propose Mirage-R1, a\nvision-language model with heuristic-to-analytic reasoning, a reflective\nreasoning mechanism for AIGI detection. Mirage-R1 is trained in two stages: a\nsupervised-fine-tuning cold start, followed by a reinforcement learning stage.\nBy further adopting an inference-time adaptive thinking strategy, Mirage-R1 is\nable to provide either a quick judgment or a more robust and accurate\nconclusion, effectively balancing inference speed and performance. Extensive\nexperiments show that our model leads state-of-the-art detectors by 5% and 10%\non Mirage and the public benchmark, respectively. The benchmark and code will\nbe made publicly available.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13174", "categories": ["cs.AI", "cs.LG", "q-fin.CP", "stat.ML"], "pdf": "https://arxiv.org/pdf/2508.13174", "abs": "https://arxiv.org/abs/2508.13174", "authors": ["Hongjun Ding", "Binqi Chen", "Jinsheng Huang", "Taian Guo", "Zhengyang Mao", "Guoyi Shao", "Lutong Zou", "Luchen Liu", "Ming Zhang"], "title": "AlphaEval: A Comprehensive and Efficient Evaluation Framework for Formula Alpha Mining", "comment": "12 pages, 5 figures", "summary": "Formula alpha mining, which generates predictive signals from financial data,\nis critical for quantitative investment. Although various algorithmic\napproaches-such as genetic programming, reinforcement learning, and large\nlanguage models-have significantly expanded the capacity for alpha discovery,\nsystematic evaluation remains a key challenge. Existing evaluation metrics\npredominantly include backtesting and correlation-based measures. Backtesting\nis computationally intensive, inherently sequential, and sensitive to specific\nstrategy parameters. Correlation-based metrics, though efficient, assess only\npredictive ability and overlook other crucial properties such as temporal\nstability, robustness, diversity, and interpretability. Additionally, the\nclosed-source nature of most existing alpha mining models hinders\nreproducibility and slows progress in this field. To address these issues, we\npropose AlphaEval, a unified, parallelizable, and backtest-free evaluation\nframework for automated alpha mining models. AlphaEval assesses the overall\nquality of generated alphas along five complementary dimensions: predictive\npower, stability, robustness to market perturbations, financial logic, and\ndiversity. Extensive experiments across representative alpha mining algorithms\ndemonstrate that AlphaEval achieves evaluation consistency comparable to\ncomprehensive backtesting, while providing more comprehensive insights and\nhigher efficiency. Furthermore, AlphaEval effectively identifies superior\nalphas compared to traditional single-metric screening approaches. All\nimplementations and evaluation tools are open-sourced to promote\nreproducibility and community engagement.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "correlation", "consistency"], "score": 3}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13358", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13358", "abs": "https://arxiv.org/abs/2508.13358", "authors": ["Zeeshan Ahmed", "Frank Seide", "Niko Moritz", "Ju Lin", "Ruiming Xie", "Simone Merello", "Zhe Liu", "Christian Fuegen"], "title": "Overcoming Latency Bottlenecks in On-Device Speech Translation: A Cascaded Approach with Alignment-Based Streaming MT", "comment": null, "summary": "This paper tackles several challenges that arise when integrating Automatic\nSpeech Recognition (ASR) and Machine Translation (MT) for real-time, on-device\nstreaming speech translation. Although state-of-the-art ASR systems based on\nRecurrent Neural Network Transducers (RNN-T) can perform real-time\ntranscription, achieving streaming translation in real-time remains a\nsignificant challenge. To address this issue, we propose a simultaneous\ntranslation approach that effectively balances translation quality and latency.\nWe also investigate efficient integration of ASR and MT, leveraging linguistic\ncues generated by the ASR system to manage context and utilizing efficient\nbeam-search pruning techniques such as time-out and forced finalization to\nmaintain system's real-time factor. We apply our approach to an on-device\nbilingual conversational speech translation and demonstrate that our techniques\noutperform baselines in terms of latency and quality. Notably, our technique\nnarrows the quality gap with non-streaming translation systems, paving the way\nfor more accurate and efficient real-time speech translation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13204", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13204", "abs": "https://arxiv.org/abs/2508.13204", "authors": ["Dong Liu", "Yanxuan Yu"], "title": "QuickMerge++: Fast Token Merging with Autoregressive Prior", "comment": "The paper has been accepted to ICML Tokshop at\n  https://openreview.net/forum?id=dMdxHd0tRf", "summary": "As generative models scale to larger inputs across language, vision, and\nvideo domains, the cost of token-level computation has become a key bottleneck.\nWhile prior work suggests that only a subset of tokens significantly influence\ndownstream predictions, most token selection methods are static,\nmodality-specific, or incompatible with autoregressive generation. In this\npaper, we propose QuickMerge, a lightweight token merging framework designed\nfor efficient next-token prediction.\n  QuickMerge dynamically selects a reduced number of tokens based on attention\nnorm magnitude, guided by an entropy-based budget estimator. To preserve\nautoregressive compatibility, we introduce a lightweight transformer prior\ntrained over the merged token sequence. By combining semantic salience\nestimation, flexible token budgets, and AR alignment, QuickMerge enables\naccurate generation with fewer tokens.\n  We evaluate QuickMerge across multi-modality domains, demonstrating\nconsistent improvements in compute-accuracy tradeoffs. Specifically, QuickMerge\nreduces token counts sustantially while matching as well as exceeding the\nperformance of learned tokenizers and fixed-patch baselines.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13533", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.13533", "abs": "https://arxiv.org/abs/2508.13533", "authors": ["Rohit Raj Rai", "Chirag Kothari", "Siddhesh Shelke", "Amit Awekar"], "title": "Compressed Models are NOT Trust-equivalent to Their Large Counterparts", "comment": null, "summary": "Large Deep Learning models are often compressed before being deployed in a\nresource-constrained environment. Can we trust the prediction of compressed\nmodels just as we trust the prediction of the original large model? Existing\nwork has keenly studied the effect of compression on accuracy and related\nperformance measures. However, performance parity does not guarantee\ntrust-equivalence. We propose a two-dimensional framework for trust-equivalence\nevaluation. First, interpretability alignment measures whether the models base\ntheir predictions on the same input features. We use LIME and SHAP tests to\nmeasure the interpretability alignment. Second, calibration similarity measures\nwhether the models exhibit comparable reliability in their predicted\nprobabilities. It is assessed via ECE, MCE, Brier Score, and reliability\ndiagrams. We conducted experiments using BERT-base as the large model and its\nmultiple compressed variants. We focused on two text classification tasks:\nnatural language inference and paraphrase identification. Our results reveal\nlow interpretability alignment and significant mismatch in calibration\nsimilarity. It happens even when the accuracies are nearly identical between\nmodels. These findings show that compressed models are not trust-equivalent to\ntheir large counterparts. Deploying compressed models as a drop-in replacement\nfor large models requires careful assessment, going beyond performance parity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "reliability", "accuracy"], "score": 3}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13460", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13460", "abs": "https://arxiv.org/abs/2508.13460", "authors": ["Jinming Liu", "Junyan Lin", "Yuntao Wei", "Kele Shao", "Keda Tao", "Jianguo Huang", "Xudong Yang", "Zhibo Chen", "Huan Wang", "Xin Jin"], "title": "Revisiting MLLM Token Technology through the Lens of Classical Visual Coding", "comment": null, "summary": "Classical visual coding and Multimodal Large Language Model (MLLM) token\ntechnology share the core objective - maximizing information fidelity while\nminimizing computational cost. Therefore, this paper reexamines MLLM token\ntechnology, including tokenization, token compression, and token reasoning,\nthrough the established principles of long-developed visual coding area. From\nthis perspective, we (1) establish a unified formulation bridging token\ntechnology and visual coding, enabling a systematic, module-by-module\ncomparative analysis; (2) synthesize bidirectional insights, exploring how\nvisual coding principles can enhance MLLM token techniques' efficiency and\nrobustness, and conversely, how token technology paradigms can inform the\ndesign of next-generation semantic visual codecs; (3) prospect for promising\nfuture research directions and critical unsolved challenges. In summary, this\nstudy presents the first comprehensive and structured technology comparison of\nMLLM token and visual coding, paving the way for more efficient multimodal\nmodels and more powerful visual codecs simultaneously.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13433", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13433", "abs": "https://arxiv.org/abs/2508.13433", "authors": ["Jiayu Fang", "Zhiqi Shao", "S T Boris Choy", "Junbin Gao"], "title": "STPFormer: A State-of-the-Art Pattern-Aware Spatio-Temporal Transformer for Traffic Forecasting", "comment": null, "summary": "Spatio-temporal traffic forecasting is challenging due to complex temporal\npatterns, dynamic spatial structures, and diverse input formats. Although\nTransformer-based models offer strong global modeling, they often struggle with\nrigid temporal encoding and weak space-time fusion. We propose STPFormer, a\nSpatio-Temporal Pattern-Aware Transformer that achieves state-of-the-art\nperformance via unified and interpretable representation learning. It\nintegrates four modules: Temporal Position Aggregator (TPA) for pattern-aware\ntemporal encoding, Spatial Sequence Aggregator (SSA) for sequential spatial\nlearning, Spatial-Temporal Graph Matching (STGM) for cross-domain alignment,\nand an Attention Mixer for multi-scale fusion. Experiments on five real-world\ndatasets show that STPFormer consistently sets new SOTA results, with ablation\nand visualizations confirming its effectiveness and generalizability.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13768", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13768", "abs": "https://arxiv.org/abs/2508.13768", "authors": ["Shengchao Liu", "Xiaoming Liu", "Chengzhengxu Li", "Zhaohan Zhang", "Guoxin Ma", "Yu Lan", "Shuai Xiao"], "title": "MGT-Prism: Enhancing Domain Generalization for Machine-Generated Text Detection via Spectral Alignment", "comment": null, "summary": "Large Language Models have shown growing ability to generate fluent and\ncoherent texts that are highly similar to the writing style of humans. Current\ndetectors for Machine-Generated Text (MGT) perform well when they are trained\nand tested in the same domain but generalize poorly to unseen domains, due to\ndomain shift between data from different sources. In this work, we propose\nMGT-Prism, an MGT detection method from the perspective of the frequency domain\nfor better domain generalization. Our key insight stems from analyzing text\nrepresentations in the frequency domain, where we observe consistent spectral\npatterns across diverse domains, while significant discrepancies in magnitude\nemerge between MGT and human-written texts (HWTs). The observation initiates\nthe design of a low frequency domain filtering module for filtering out the\ndocument-level features that are sensitive to domain shift, and a dynamic\nspectrum alignment strategy to extract the task-specific and domain-invariant\nfeatures for improving the detector's performance in domain generalization.\nExtensive experiments demonstrate that MGT-Prism outperforms state-of-the-art\nbaselines by an average of 0.90% in accuracy and 0.92% in F1 score on 11 test\ndatasets across three domain-generalization scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13579", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13579", "abs": "https://arxiv.org/abs/2508.13579", "authors": ["Yue Fang", "Yuxin Guo", "Jiaran Gao", "Hongxin Ding", "Xinke Jiang", "Weibin Liao", "Yongxin Xu", "Yinghao Zhu", "Zhibang Yang", "Liantao Ma", "Junfeng Zhao", "Yasha Wang"], "title": "Toward Better EHR Reasoning in LLMs: Reinforcement Learning with Expert Attention Guidance", "comment": null, "summary": "Improving large language models (LLMs) for electronic health record (EHR)\nreasoning is essential for enabling accurate and generalizable clinical\npredictions. While LLMs excel at medical text understanding, they underperform\non EHR-based prediction tasks due to challenges in modeling temporally\nstructured, high-dimensional data. Existing approaches often rely on hybrid\nparadigms, where LLMs serve merely as frozen prior retrievers while downstream\ndeep learning (DL) models handle prediction, failing to improve the LLM's\nintrinsic reasoning capacity and inheriting the generalization limitations of\nDL models. To this end, we propose EAG-RL, a novel two-stage training framework\ndesigned to intrinsically enhance LLMs' EHR reasoning ability through expert\nattention guidance, where expert EHR models refer to task-specific DL models\ntrained on EHR data. Concretely, EAG-RL first constructs high-quality, stepwise\nreasoning trajectories using expert-guided Monte Carlo Tree Search to\neffectively initialize the LLM's policy. Then, EAG-RL further optimizes the\npolicy via reinforcement learning by aligning the LLM's attention with\nclinically salient features identified by expert EHR models. Extensive\nexperiments on two real-world EHR datasets show that EAG-RL improves the\nintrinsic EHR reasoning ability of LLMs by an average of 14.62%, while also\nenhancing robustness to feature perturbations and generalization to unseen\nclinical domains. These results demonstrate the practical potential of EAG-RL\nfor real-world deployment in clinical prediction tasks. Our code have been\navailable at https://github.com/devilran6/EAG-RL.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["monte carlo tree search"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13798", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13798", "abs": "https://arxiv.org/abs/2508.13798", "authors": ["Bohao Chu", "Meijie Li", "Sameh Frihat", "Chengyu Gu", "Georg Lodde", "Elisabeth Livingstone", "Norbert Fuhr"], "title": "TracSum: A New Benchmark for Aspect-Based Summarization with Sentence-Level Traceability in Medical Domain", "comment": "8 main pages, 12 appendix pages", "summary": "While document summarization with LLMs has enhanced access to textual\ninformation, concerns about the factual accuracy of these summaries persist,\nespecially in the medical domain. Tracing evidence from which summaries are\nderived enables users to assess their accuracy, thereby alleviating this\nconcern. In this paper, we introduce TracSum, a novel benchmark for traceable,\naspect-based summarization, in which generated summaries are paired with\nsentence-level citations, enabling users to trace back to the original context.\nFirst, we annotate 500 medical abstracts for seven key medical aspects,\nyielding 3.5K summary-citation pairs. We then propose a fine-grained evaluation\nframework for this new task, designed to assess the completeness and\nconsistency of generated content using four metrics. Finally, we introduce a\nsummarization pipeline, Track-Then-Sum, which serves as a baseline method for\ncomparison. In experiments, we evaluate both this baseline and a set of LLMs on\nTracSum, and conduct a human evaluation to assess the evaluation results. The\nfindings demonstrate that TracSum can serve as an effective benchmark for\ntraceable, aspect-based summarization tasks. We also observe that explicitly\nperforming sentence-level tracking prior to summarization enhances generation\naccuracy, while incorporating the full context further improves completeness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "accuracy", "summarization", "aspect-based", "fine-grained"], "score": 7}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13587", "categories": ["cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13587", "abs": "https://arxiv.org/abs/2508.13587", "authors": ["Lei Chen", "Xuanle Zhao", "Zhixiong Zeng", "Jing Huang", "Liming Zheng", "Yufeng Zhong", "Lin Ma"], "title": "Breaking the SFT Plateau: Multimodal Structured Reinforcement Learning for Chart-to-Code Generation", "comment": "technical report", "summary": "While reinforcement learning (RL) has proven highly effective for general\nreasoning in vision-language models, its application to tasks requiring\nin-depth understanding of information-rich images and generation of structured\noutputs remains underexplored. Chart-to-code generation exemplifies this\nchallenge, demanding complex reasoning over visual charts to generate\nstructured code. Supervised fine-tuning (SFT) alone is often insufficient,\nhighlighting the need for effective RL strategies that appropriately reward\nstructured outputs. We systematically investigate the performance plateau in\nSFT through large-scale experiments and propose Multimodal Structured\nReinforcement Learning (MSRL) for chart-to-code generation, which substantially\nbreaks through this plateau. We construct the largest training corpus to date,\ncontaining 3 million chart-code pairs from real-world arXiv tables to mitigate\nsimplistic patterns of prior synthetic data. Despite reaching state-of-the-art\nperformance, our experiments show that scaling SFT data eventually hits a\nplateau where further increases yield negligible improvements. Our MSRL method\nleverages a multi-granularity structured reward system using multimodal textual\nand visual feedback. At the textual level, rule-based rewards validate\nfine-grained code details. At the visual level, model-based rewards assess\nstructural similarity by rendering generated code into images and employing an\nevaluator model. We implement this within a two-stage curriculum for training\nstability. Results demonstrate that MSRL significantly breaks the SFT plateau,\nimproving high-level metrics by 6.2% and 9.9% on ChartMimic and ReachQA\nbenchmarks respectively, achieving competitive performance with advanced\nclosed-source models.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["code generation", "fine-grained"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13503", "categories": ["cs.CV", "eess.IV"], "pdf": "https://arxiv.org/pdf/2508.13503", "abs": "https://arxiv.org/abs/2508.13503", "authors": ["Tianyi Xu", "Fan Zhang", "Boxin Shi", "Tianfan Xue", "Yujin Wang"], "title": "AdaptiveAE: An Adaptive Exposure Strategy for HDR Capturing in Dynamic Scenes", "comment": "Accepted to ICCV 2025", "summary": "Mainstream high dynamic range imaging techniques typically rely on fusing\nmultiple images captured with different exposure setups (shutter speed and\nISO). A good balance between shutter speed and ISO is crucial for achieving\nhigh-quality HDR, as high ISO values introduce significant noise, while long\nshutter speeds can lead to noticeable motion blur. However, existing methods\noften overlook the complex interaction between shutter speed and ISO and fail\nto account for motion blur effects in dynamic scenes.\n  In this work, we propose AdaptiveAE, a reinforcement learning-based method\nthat optimizes the selection of shutter speed and ISO combinations to maximize\nHDR reconstruction quality in dynamic environments. AdaptiveAE integrates an\nimage synthesis pipeline that incorporates motion blur and noise simulation\ninto our training procedure, leveraging semantic information and exposure\nhistograms. It can adaptively select optimal ISO and shutter speed sequences\nbased on a user-defined exposure time budget, and find a better exposure\nschedule than traditional solutions. Experimental results across multiple\ndatasets demonstrate that it achieves the state-of-the-art performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13524", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13524", "abs": "https://arxiv.org/abs/2508.13524", "authors": ["Vamsi Krishna Mulukutla", "Sai Supriya Pavarala", "Srinivasa Raju Rudraraju", "Sridevi Bonthu"], "title": "Evaluating Open-Source Vision Language Models for Facial Emotion Recognition against Traditional Deep Learning Models", "comment": null, "summary": "Facial Emotion Recognition (FER) is crucial for applications such as\nhuman-computer interaction and mental health diagnostics. This study presents\nthe first empirical comparison of open-source Vision-Language Models (VLMs),\nincluding Phi-3.5 Vision and CLIP, against traditional deep learning models\nVGG19, ResNet-50, and EfficientNet-B0 on the challenging FER-2013 dataset,\nwhich contains 35,887 low-resolution grayscale images across seven emotion\nclasses. To address the mismatch between VLM training assumptions and the noisy\nnature of FER data, we introduce a novel pipeline that integrates GFPGAN-based\nimage restoration with FER evaluation. Results show that traditional models,\nparticularly EfficientNet-B0 (86.44%) and ResNet-50 (85.72%), significantly\noutperform VLMs like CLIP (64.07%) and Phi-3.5 Vision (51.66%), highlighting\nthe limitations of VLMs in low-quality visual tasks. In addition to performance\nevaluation using precision, recall, F1-score, and accuracy, we provide a\ndetailed computational cost analysis covering preprocessing, training,\ninference, and evaluation phases, offering practical insights for deployment.\nThis work underscores the need for adapting VLMs to noisy environments and\nprovides a reproducible benchmark for future research in emotion recognition.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "accuracy"], "score": 4}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13953", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13953", "abs": "https://arxiv.org/abs/2508.13953", "authors": ["A. J. W. de Vink", "Natalia Amat-Lefort", "Lifeng Han"], "title": "ReviewGraph: A Knowledge Graph Embedding Based Framework for Review Rating Prediction with Sentiment Features", "comment": null, "summary": "In the hospitality industry, understanding the factors that drive customer\nreview ratings is critical for improving guest satisfaction and business\nperformance. This work proposes ReviewGraph for Review Rating Prediction (RRP),\na novel framework that transforms textual customer reviews into knowledge\ngraphs by extracting (subject, predicate, object) triples and associating\nsentiment scores. Using graph embeddings (Node2Vec) and sentiment features, the\nframework predicts review rating scores through machine learning classifiers.\nWe compare ReviewGraph performance with traditional NLP baselines (such as Bag\nof Words, TF-IDF, and Word2Vec) and large language models (LLMs), evaluating\nthem in the HotelRec dataset. In comparison to the state of the art literature,\nour proposed model performs similar to their best performing model but with\nlower computational cost (without ensemble).\n  While ReviewGraph achieves comparable predictive performance to LLMs and\noutperforms baselines on agreement-based metrics such as Cohen's Kappa, it\noffers additional advantages in interpretability, visual exploration, and\npotential integration into Retrieval-Augmented Generation (RAG) systems. This\nwork highlights the potential of graph-based representations for enhancing\nreview analytics and lays the groundwork for future research integrating\nadvanced graph neural networks and fine-tuned LLM-based extraction methods. We\nwill share ReviewGraph output and platform open-sourced on our GitHub page\nhttps://github.com/aaronlifenghan/ReviewGraph", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "agreement", "kappa"], "score": 3}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13697", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13697", "abs": "https://arxiv.org/abs/2508.13697", "authors": ["Vincent Derkinderen", "Robin Manhaeve", "Rik Adriaensen", "Lucas Van Praet", "Lennert De Smet", "Giuseppe Marra", "Luc De Raedt"], "title": "The DeepLog Neurosymbolic Machine", "comment": null, "summary": "We contribute a theoretical and operational framework for neurosymbolic AI\ncalled DeepLog. DeepLog introduces building blocks and primitives for\nneurosymbolic AI that make abstraction of commonly used representations and\ncomputational mechanisms used in neurosymbolic AI. DeepLog can represent and\nemulate a wide range of neurosymbolic systems. It consists of two key\ncomponents. The first is the DeepLog language for specifying neurosymbolic\nmodels and inference tasks. This language consists of an annotated neural\nextension of grounded first-order logic, and makes abstraction of the type of\nlogic, e.g. boolean, fuzzy or probabilistic, and whether logic is used in the\narchitecture or in the loss function. The second DeepLog component is situated\nat the computational level and uses extended algebraic circuits as\ncomputational graphs. Together these two components are to be considered as a\nneurosymbolic abstract machine, with the DeepLog language as the intermediate\nlevel of abstraction and the circuits level as the computational one. DeepLog\nis implemented in software, relies on the latest insights in implementing\nalgebraic circuits on GPUs, and is declarative in that it is easy to obtain\ndifferent neurosymbolic models by making different choices for the underlying\nalgebraic structures and logics. The generality and efficiency of the DeepLog\nneurosymbolic machine is demonstrated through an experimental comparison\nbetween 1) different fuzzy and probabilistic logics, 2) between using logic in\nthe architecture or in the loss function, and 3) between a standalone CPU-based\nimplementation of a neurosymbolic AI system and a DeepLog GPU-based one.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13721", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13721", "abs": "https://arxiv.org/abs/2508.13721", "authors": ["Minh Hoang Nguyen", "Van Dai Do", "Dung Nguyen", "Thin Nguyen", "Hung Le"], "title": "CausalPlan: Empowering Efficient LLM Multi-Agent Collaboration Through Causality-Driven Planning", "comment": null, "summary": "Large language model (LLM) agents-especially smaller, open-source\nmodels-often produce causally invalid or incoherent actions in collaborative\ntasks due to their reliance on surface-level correlations rather than grounded\ncausal reasoning. This limitation undermines their performance in terms of\ncoordination and planning in dynamic environments. We address this challenge\nwith CausalPlan, a two-phase framework that integrates explicit structural\ncausal reasoning into the LLM planning process. At the core of CausalPlan is\nthe Structural Causal Action (SCA) model, which learns a causal graph from\nagent trajectories to capture how prior actions and current environment states\ninfluence future decisions. This structure is then used to guide action\nselection by assigning causal scores to LLM-generated proposals, reweighting\nthem accordingly, or falling back to causally grounded alternatives when\nneeded. By embedding this causal knowledge directly into the decision loop,\nCausalPlan constrains planning to intervention-consistent behaviours without\nrequiring fine-tuning of the LLM itself. We evaluate CausalPlan on the\nOvercooked-AI benchmark across five multi-agent coordination tasks and four\nLLMs of varying sizes: Gemma-7B, Llama-8B, Qwen-14B, and Llama-70B.\nExperimental results show that CausalPlan consistently reduces invalid actions\nand improves collaboration in both AI-AI and human-AI settings, outperforming\nstrong reinforcement learning baselines. Our findings highlight the value of\ncausality-driven planning for deploying efficient, interpretable, and\ngeneralisable multi-agent LLM systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14029", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.14029", "abs": "https://arxiv.org/abs/2508.14029", "authors": ["Xiao Liang", "Zhongzhi Li", "Yeyun Gong", "Yelong Shen", "Ying Nian Wu", "Zhijiang Guo", "Weizhu Chen"], "title": "Beyond Pass@1: Self-Play with Variational Problem Synthesis Sustains RLVR", "comment": null, "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has recently emerged as\na key paradigm for post-training Large Language Models (LLMs), particularly for\ncomplex reasoning tasks. However, vanilla RLVR training has been shown to\nimprove Pass@1 performance at the expense of policy entropy, leading to reduced\ngeneration diversity and limiting the Pass@k performance, which typically\nrepresents the upper bound of LLM reasoning capability. In this paper, we\nsystematically analyze the policy's generation diversity from the perspective\nof training problems and find that augmenting and updating training problems\nhelps mitigate entropy collapse during training. Based on these observations,\nwe propose an online Self-play with Variational problem Synthesis (SvS)\nstrategy for RLVR training, which uses the policy's correct solutions to\nsynthesize variational problems while ensuring their reference answers remain\nidentical to the originals. This self-improving strategy effectively maintains\npolicy entropy during training and substantially improves Pass@k compared with\nstandard RLVR, sustaining prolonged improvements and achieving absolute gains\nof 18.3% and 22.8% in Pass@32 performance on the competition-level AIME24 and\nAIME25 benchmarks. Experiments on 12 reasoning benchmarks across varying model\nsizes from 3B to 32B consistently demonstrate the generalizability and\nrobustness of SvS.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13560", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13560", "abs": "https://arxiv.org/abs/2508.13560", "authors": ["Zhen Qu", "Xian Tao", "Xinyi Gong", "ShiChen Qu", "Xiaopei Zhang", "Xingang Wang", "Fei Shen", "Zhengtao Zhang", "Mukesh Prasad", "Guiguang Ding"], "title": "DictAS: A Framework for Class-Generalizable Few-Shot Anomaly Segmentation via Dictionary Lookup", "comment": "Accepted by ICCV 2025, Project: https://github.com/xiaozhen228/DictAS", "summary": "Recent vision-language models (e.g., CLIP) have demonstrated remarkable\nclass-generalizable ability to unseen classes in few-shot anomaly segmentation\n(FSAS), leveraging supervised prompt learning or fine-tuning on seen classes.\nHowever, their cross-category generalization largely depends on prior knowledge\nof real seen anomaly samples. In this paper, we propose a novel framework,\nnamely DictAS, which enables a unified model to detect visual anomalies in\nunseen object categories without any retraining on the target data, only\nemploying a few normal reference images as visual prompts. The insight behind\nDictAS is to transfer dictionary lookup capabilities to the FSAS task for\nunseen classes via self-supervised learning, instead of merely memorizing the\nnormal and abnormal feature patterns from the training set. Specifically,\nDictAS mainly consists of three components: (1) **Dictionary Construction** -\nto simulate the index and content of a real dictionary using features from\nnormal reference images. (2) **Dictionary Lookup** - to retrieve queried region\nfeatures from the dictionary via a sparse lookup strategy. When a query feature\ncannot be retrieved, it is classified as an anomaly. (3) **Query Discrimination\nRegularization**- to enhance anomaly discrimination by making abnormal features\nharder to retrieve from the dictionary. To achieve this, Contrastive Query\nConstraint and Text Alignment Constraint are further proposed. Extensive\nexperiments on seven public industrial and medical datasets demonstrate that\nDictAS consistently outperforms state-of-the-art FSAS methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13167", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.13167", "abs": "https://arxiv.org/abs/2508.13167", "authors": ["Weizhen Li", "Jianbo Lin", "Zhuosong Jiang", "Jingyi Cao", "Xinpeng Liu", "Jiayu Zhang", "Zhenqiang Huang", "Qianben Chen", "Weichen Sun", "Qiexiang Wang", "Hongxuan Lu", "Tianrui Qin", "Chenghao Zhu", "Yi Yao", "Shuying Fan", "Xiaowan Li", "Tiannan Wang", "Pai Liu", "King Zhu", "He Zhu", "Dingfeng Shi", "Piaohong Wang", "Yeyi Guan", "Xiangru Tang", "Minghao Liu", "Yuchen Eleanor Jiang", "Jian Yang", "Jiaheng Liu", "Ge Zhang", "Wangchunshu Zhou"], "title": "Chain-of-Agents: End-to-End Agent Foundation Models via Multi-Agent Distillation and Agentic RL", "comment": "51 pages", "summary": "Recent advances in large language models (LLMs) and multi-agent systems have\ndemonstrated remarkable capabilities in complex problem-solving tasks such as\ndeep research, vibe coding, and mathematical reasoning. However, most existing\nmulti-agent systems are built upon manual prompt/workflow engineering with\nsophisticated agent frameworks, making them computationally inefficient, less\ncapable, and can not benefit from data-centric learning. In this work, we\nintroduce Chain-of-Agents (CoA), a novel paradigm of LLM reasoning that enables\nnative end-to-end complex problem-solving in the same way as a multi-agent\nsystem (i.e., multi-turn problem solving with multiple tools and multiple\nagents) within one model. In chain-of-agents problem-solving, the model\ndynamically activates different tool agents and role-playing agents to simulate\nmulti-agent collaboration in an end-to-end fashion. To elicit end-to-end\nchain-of-agents problem-solving abilities in LLMs, we introduce a multi-agent\ndistillation framework to distill state-of-the-art multi-agent systems into\nchain-of-agents trajectories for agentic supervised fine-tuning. We then use\nagentic reinforcement learning on verifiable agentic tasks to further improve\nthe models' capabilities on chain-of-agents problem solving. We call the\nresulting models Agent Foundation Models (AFMs). Our empirical studies\ndemonstrate that AFM establishes new state-of-the-art performance across\ndiverse benchmarks in both web agent and code agent settings. We make the\nentire research, including the model weights, code for training and evaluation,\nand the training data, fully open-sourced, which offers a solid starting point\nfor future research on agent models and agentic RL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "mathematical reasoning"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14020", "categories": ["cs.AI", "cs.DM", "68T01", "I.2.8"], "pdf": "https://arxiv.org/pdf/2508.14020", "abs": "https://arxiv.org/abs/2508.14020", "authors": ["Christian Blum", "Pedro Pinacho-Davidson"], "title": "A Biased Random Key Genetic Algorithm for Solving the Longest Run Subsequence Problem", "comment": null, "summary": "The longest run subsequence (LRS) problem is an NP-hard combinatorial\noptimization problem belonging to the class of subsequence problems from\nbioinformatics. In particular, the problem plays a role in genome reassembly.\nIn this paper, we present a solution to the LRS problem using a Biased Random\nKey Genetic Algorithm (BRKGA). Our approach places particular focus on the\ncomputational efficiency of evaluating individuals, which involves converting\nvectors of gray values into valid solutions to the problem. For comparison\npurposes, a Max-Min Ant System is developed and implemented. This is in\naddition to the application of the integer linear programming solver CPLEX for\nsolving all considered problem instances. The computation results show that the\nproposed BRKGA is currently a state-of-the-art technique for the LRS problem.\nNevertheless, the results also show that there is room for improvement,\nespecially in the context of input strings based on large alphabet sizes.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14040", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.14040", "abs": "https://arxiv.org/abs/2508.14040", "authors": ["Hanyu Lai", "Xiao Liu", "Yanxiao Zhao", "Han Xu", "Hanchen Zhang", "Bohao Jing", "Yanyu Ren", "Shuntian Yao", "Yuxiao Dong", "Jie Tang"], "title": "ComputerRL: Scaling End-to-End Online Reinforcement Learning for Computer Use Agents", "comment": null, "summary": "We introduce ComputerRL, a framework for autonomous desktop intelligence that\nenables agents to operate complex digital workspaces skillfully. ComputerRL\nfeatures the API-GUI paradigm, which unifies programmatic API calls and direct\nGUI interaction to address the inherent mismatch between machine agents and\nhuman-centric desktop environments. Scaling end-to-end RL training is crucial\nfor improvement and generalization across diverse desktop tasks, yet remains\nchallenging due to environmental inefficiency and instability in extended\ntraining. To support scalable and robust training, we develop a distributed RL\ninfrastructure capable of orchestrating thousands of parallel virtual desktop\nenvironments to accelerate large-scale online RL. Furthermore, we propose\nEntropulse, a training strategy that alternates reinforcement learning with\nsupervised fine-tuning, effectively mitigating entropy collapse during extended\ntraining runs. We employ ComputerRL on open models GLM-4-9B-0414 and\nQwen2.5-14B, and evaluate them on the OSWorld benchmark. The AutoGLM-OS-9B\nbased on GLM-4-9B-0414 achieves a new state-of-the-art accuracy of 48.1%,\ndemonstrating significant improvements for general agents in desktop\nautomation. The algorithm and framework are adopted in building AutoGLM (Liu et\nal., 2024a)", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13223", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13223", "abs": "https://arxiv.org/abs/2508.13223", "authors": ["Cheng Xia", "Manxi Lin", "Jiexiang Tan", "Xiaoxiong Du", "Yang Qiu", "Junjun Zheng", "Xiangheng Kong", "Yuning Jiang", "Bo Zheng"], "title": "MIRAGE: Towards AI-Generated Image Detection in the Wild", "comment": null, "summary": "The spreading of AI-generated images (AIGI), driven by advances in generative\nAI, poses a significant threat to information security and public trust.\nExisting AIGI detectors, while effective against images in clean laboratory\nsettings, fail to generalize to in-the-wild scenarios. These real-world images\nare noisy, varying from ``obviously fake\" images to realistic ones derived from\nmultiple generative models and further edited for quality control. We address\nin-the-wild AIGI detection in this paper. We introduce Mirage, a challenging\nbenchmark designed to emulate the complexity of in-the-wild AIGI. Mirage is\nconstructed from two sources: (1) a large corpus of Internet-sourced AIGI\nverified by human experts, and (2) a synthesized dataset created through the\ncollaboration between multiple expert generators, closely simulating the\nrealistic AIGI in the wild. Building on this benchmark, we propose Mirage-R1, a\nvision-language model with heuristic-to-analytic reasoning, a reflective\nreasoning mechanism for AIGI detection. Mirage-R1 is trained in two stages: a\nsupervised-fine-tuning cold start, followed by a reinforcement learning stage.\nBy further adopting an inference-time adaptive thinking strategy, Mirage-R1 is\nable to provide either a quick judgment or a more robust and accurate\nconclusion, effectively balancing inference speed and performance. Extensive\nexperiments show that our model leads state-of-the-art detectors by 5% and 10%\non Mirage and the public benchmark, respectively. The benchmark and code will\nbe made publicly available.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13358", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13358", "abs": "https://arxiv.org/abs/2508.13358", "authors": ["Zeeshan Ahmed", "Frank Seide", "Niko Moritz", "Ju Lin", "Ruiming Xie", "Simone Merello", "Zhe Liu", "Christian Fuegen"], "title": "Overcoming Latency Bottlenecks in On-Device Speech Translation: A Cascaded Approach with Alignment-Based Streaming MT", "comment": null, "summary": "This paper tackles several challenges that arise when integrating Automatic\nSpeech Recognition (ASR) and Machine Translation (MT) for real-time, on-device\nstreaming speech translation. Although state-of-the-art ASR systems based on\nRecurrent Neural Network Transducers (RNN-T) can perform real-time\ntranscription, achieving streaming translation in real-time remains a\nsignificant challenge. To address this issue, we propose a simultaneous\ntranslation approach that effectively balances translation quality and latency.\nWe also investigate efficient integration of ASR and MT, leveraging linguistic\ncues generated by the ASR system to manage context and utilizing efficient\nbeam-search pruning techniques such as time-out and forced finalization to\nmaintain system's real-time factor. We apply our approach to an on-device\nbilingual conversational speech translation and demonstrate that our techniques\noutperform baselines in terms of latency and quality. Notably, our technique\nnarrows the quality gap with non-streaming translation systems, paving the way\nfor more accurate and efficient real-time speech translation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13739", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13739", "abs": "https://arxiv.org/abs/2508.13739", "authors": ["Yiming Cao", "Yanjie Li", "Kaisheng Liang", "Yuni Lai", "Bin Xiao"], "title": "Enhancing Targeted Adversarial Attacks on Large Vision-Language Models through Intermediate Projector Guidance", "comment": null, "summary": "Targeted adversarial attacks are essential for proactively identifying\nsecurity flaws in Vision-Language Models before real-world deployment. However,\ncurrent methods perturb images to maximize global similarity with the target\ntext or reference image at the encoder level, collapsing rich visual semantics\ninto a single global vector. This limits attack granularity, hindering\nfine-grained manipulations such as modifying a car while preserving its\nbackground. Furthermore, these methods largely overlook the projector module, a\ncritical semantic bridge between the visual encoder and the language model in\nVLMs, thereby failing to disrupt the full vision-language alignment pipeline\nwithin VLMs and limiting attack effectiveness. To address these issues, we\npropose the Intermediate Projector Guided Attack (IPGA), the first method to\nattack using the intermediate stage of the projector module, specifically the\nwidely adopted Q-Former, which transforms global image embeddings into\nfine-grained visual features. This enables more precise control over\nadversarial perturbations by operating on semantically meaningful visual tokens\nrather than a single global representation. Specifically, IPGA leverages the\nQ-Former pretrained solely on the first vision-language alignment stage,\nwithout LLM fine-tuning, which improves both attack effectiveness and\ntransferability across diverse VLMs. Furthermore, we propose Residual Query\nAlignment (RQA) to preserve unrelated visual content, thereby yielding more\ncontrolled and precise adversarial manipulations. Extensive experiments show\nthat our attack method consistently outperforms existing methods in both\nstandard global image captioning tasks and fine-grained visual\nquestion-answering tasks in black-box environment. Additionally, IPGA\nsuccessfully transfers to multiple commercial VLMs, including Google Gemini and\nOpenAI GPT.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13796", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13796", "abs": "https://arxiv.org/abs/2508.13796", "authors": ["Enobong Adahada", "Isabel Sassoon", "Kate Hone", "Yongmin Li"], "title": "A Fully Transformer Based Multimodal Framework for Explainable Cancer Image Segmentation Using Radiology Reports", "comment": null, "summary": "We introduce Med-CTX, a fully transformer based multimodal framework for\nexplainable breast cancer ultrasound segmentation. We integrate clinical\nradiology reports to boost both performance and interpretability. Med-CTX\nachieves exact lesion delineation by using a dual-branch visual encoder that\ncombines ViT and Swin transformers, as well as uncertainty aware fusion.\nClinical language structured with BI-RADS semantics is encoded by\nBioClinicalBERT and combined with visual features utilising cross-modal\nattention, allowing the model to provide clinically grounded, model generated\nexplanations. Our methodology generates segmentation masks, uncertainty maps,\nand diagnostic rationales all at once, increasing confidence and transparency\nin computer assisted diagnosis. On the BUS-BRA dataset, Med-CTX achieves a Dice\nscore of 99% and an IoU of 95%, beating existing baselines U-Net, ViT, and\nSwin. Clinical text plays a key role in segmentation accuracy and explanation\nquality, as evidenced by ablation studies that show a -5.4% decline in Dice\nscore and -31% in CIDEr. Med-CTX achieves good multimodal alignment (CLIP\nscore: 85%) and increased confi dence calibration (ECE: 3.2%), setting a new\nbar for trustworthy, multimodal medical architecture.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13524", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13524", "abs": "https://arxiv.org/abs/2508.13524", "authors": ["Vamsi Krishna Mulukutla", "Sai Supriya Pavarala", "Srinivasa Raju Rudraraju", "Sridevi Bonthu"], "title": "Evaluating Open-Source Vision Language Models for Facial Emotion Recognition against Traditional Deep Learning Models", "comment": null, "summary": "Facial Emotion Recognition (FER) is crucial for applications such as\nhuman-computer interaction and mental health diagnostics. This study presents\nthe first empirical comparison of open-source Vision-Language Models (VLMs),\nincluding Phi-3.5 Vision and CLIP, against traditional deep learning models\nVGG19, ResNet-50, and EfficientNet-B0 on the challenging FER-2013 dataset,\nwhich contains 35,887 low-resolution grayscale images across seven emotion\nclasses. To address the mismatch between VLM training assumptions and the noisy\nnature of FER data, we introduce a novel pipeline that integrates GFPGAN-based\nimage restoration with FER evaluation. Results show that traditional models,\nparticularly EfficientNet-B0 (86.44%) and ResNet-50 (85.72%), significantly\noutperform VLMs like CLIP (64.07%) and Phi-3.5 Vision (51.66%), highlighting\nthe limitations of VLMs in low-quality visual tasks. In addition to performance\nevaluation using precision, recall, F1-score, and accuracy, we provide a\ndetailed computational cost analysis covering preprocessing, training,\ninference, and evaluation phases, offering practical insights for deployment.\nThis work underscores the need for adapting VLMs to noisy environments and\nprovides a reproducible benchmark for future research in emotion recognition.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "accuracy"], "score": 4}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13823", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13823", "abs": "https://arxiv.org/abs/2508.13823", "authors": ["Tong Xiang", "Hongxia Zhao", "Fenghua Zhu", "Yuanyuan Chen", "Yisheng Lv"], "title": "Self-Aware Adaptive Alignment: Enabling Accurate Perception for Intelligent Transportation Systems", "comment": "Domain adaptation, Virtual Reality, Object Detection", "summary": "Achieving top-notch performance in Intelligent Transportation detection is a\ncritical research area. However, many challenges still need to be addressed\nwhen it comes to detecting in a cross-domain scenario. In this paper, we\npropose a Self-Aware Adaptive Alignment (SA3), by leveraging an efficient\nalignment mechanism and recognition strategy. Our proposed method employs a\nspecified attention-based alignment module trained on source and target domain\ndatasets to guide the image-level features alignment process, enabling the\nlocal-global adaptive alignment between the source domain and target domain.\nFeatures from both domains, whose channel importance is re-weighted, are fed\ninto the region proposal network, which facilitates the acquisition of salient\nregion features. Also, we introduce an instance-to-image level alignment module\nspecific to the target domain to adaptively mitigate the domain gap. To\nevaluate the proposed method, extensive experiments have been conducted on\npopular cross-domain object detection benchmarks. Experimental results show\nthat SA3 achieves superior results to the previous state-of-the-art methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13866", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13866", "abs": "https://arxiv.org/abs/2508.13866", "authors": ["Paul Grimal", "Michal Soumm", "Herv Le Borgne", "Olivier Ferret", "Akihiro Sugimoto"], "title": "SAGA: Learning Signal-Aligned Distributions for Improved Text-to-Image Generation", "comment": null, "summary": "State-of-the-art text-to-image models produce visually impressive results but\noften struggle with precise alignment to text prompts, leading to missing\ncritical elements or unintended blending of distinct concepts. We propose a\nnovel approach that learns a high-success-rate distribution conditioned on a\ntarget prompt, ensuring that generated images faithfully reflect the\ncorresponding prompts. Our method explicitly models the signal component during\nthe denoising process, offering fine-grained control that mitigates\nover-optimization and out-of-distribution artifacts. Moreover, our framework is\ntraining-free and seamlessly integrates with both existing diffusion and flow\nmatching architectures. It also supports additional conditioning modalities --\nsuch as bounding boxes -- for enhanced spatial alignment. Extensive experiments\ndemonstrate that our approach outperforms current state-of-the-art methods. The\ncode is available at https://github.com/grimalPaul/gsn-factory.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13796", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.13796", "abs": "https://arxiv.org/abs/2508.13796", "authors": ["Enobong Adahada", "Isabel Sassoon", "Kate Hone", "Yongmin Li"], "title": "A Fully Transformer Based Multimodal Framework for Explainable Cancer Image Segmentation Using Radiology Reports", "comment": null, "summary": "We introduce Med-CTX, a fully transformer based multimodal framework for\nexplainable breast cancer ultrasound segmentation. We integrate clinical\nradiology reports to boost both performance and interpretability. Med-CTX\nachieves exact lesion delineation by using a dual-branch visual encoder that\ncombines ViT and Swin transformers, as well as uncertainty aware fusion.\nClinical language structured with BI-RADS semantics is encoded by\nBioClinicalBERT and combined with visual features utilising cross-modal\nattention, allowing the model to provide clinically grounded, model generated\nexplanations. Our methodology generates segmentation masks, uncertainty maps,\nand diagnostic rationales all at once, increasing confidence and transparency\nin computer assisted diagnosis. On the BUS-BRA dataset, Med-CTX achieves a Dice\nscore of 99% and an IoU of 95%, beating existing baselines U-Net, ViT, and\nSwin. Clinical text plays a key role in segmentation accuracy and explanation\nquality, as evidenced by ablation studies that show a -5.4% decline in Dice\nscore and -31% in CIDEr. Med-CTX achieves good multimodal alignment (CLIP\nscore: 85%) and increased confi dence calibration (ECE: 3.2%), setting a new\nbar for trustworthy, multimodal medical architecture.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14015", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.14015", "abs": "https://arxiv.org/abs/2508.14015", "authors": ["Tuo Chen", "Jie Gui", "Minjing Dong", "Ju Jia", "Lanting Fang", "Jian Liu"], "title": "Backdooring Self-Supervised Contrastive Learning by Noisy Alignment", "comment": "Accepted by ICCV 2025", "summary": "Self-supervised contrastive learning (CL) effectively learns transferable\nrepresentations from unlabeled data containing images or image-text pairs but\nsuffers vulnerability to data poisoning backdoor attacks (DPCLs). An adversary\ncan inject poisoned images into pretraining datasets, causing compromised CL\nencoders to exhibit targeted misbehavior in downstream tasks. Existing DPCLs,\nhowever, achieve limited efficacy due to their dependence on fragile implicit\nco-occurrence between backdoor and target object and inadequate suppression of\ndiscriminative features in backdoored images. We propose Noisy Alignment (NA),\na DPCL method that explicitly suppresses noise components in poisoned images.\nInspired by powerful training-controllable CL attacks, we identify and extract\nthe critical objective of noisy alignment, adapting it effectively into\ndata-poisoning scenarios. Our method implements noisy alignment by\nstrategically manipulating contrastive learning's random cropping mechanism,\nformulating this process as an image layout optimization problem with\ntheoretically derived optimal parameters. The resulting method is simple yet\neffective, achieving state-of-the-art performance compared to existing DPCLs,\nwhile maintaining clean-data accuracy. Furthermore, Noisy Alignment\ndemonstrates robustness against common backdoor defenses. Codes can be found at\nhttps://github.com/jsrdcht/Noisy-Alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.14039", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.14039", "abs": "https://arxiv.org/abs/2508.14039", "authors": ["Omkar Thawakar", "Dmitry Demidov", "Ritesh Thawkar", "Rao Muhammad Anwer", "Mubarak Shah", "Fahad Shahbaz Khan", "Salman Khan"], "title": "Beyond Simple Edits: Composed Video Retrieval with Dense Modifications", "comment": "Accepted to ICCV-2025", "summary": "Composed video retrieval is a challenging task that strives to retrieve a\ntarget video based on a query video and a textual description detailing\nspecific modifications. Standard retrieval frameworks typically struggle to\nhandle the complexity of fine-grained compositional queries and variations in\ntemporal understanding limiting their retrieval ability in the fine-grained\nsetting. To address this issue, we introduce a novel dataset that captures both\nfine-grained and composed actions across diverse video segments, enabling more\ndetailed compositional changes in retrieved video content. The proposed\ndataset, named Dense-WebVid-CoVR, consists of 1.6 million samples with dense\nmodification text that is around seven times more than its existing\ncounterpart. We further develop a new model that integrates visual and textual\ninformation through Cross-Attention (CA) fusion using grounded text encoder,\nenabling precise alignment between dense query modifications and target videos.\nThe proposed model achieves state-of-the-art results surpassing existing\nmethods on all metrics. Notably, it achieves 71.3\\% Recall@1 in visual+text\nsetting and outperforms the state-of-the-art by 3.4\\%, highlighting its\nefficacy in terms of leveraging detailed video descriptions and dense\nmodification texts. Our proposed dataset, code, and model are available at\n:https://github.com/OmkarThawakar/BSE-CoVR", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
{"id": "2508.13587", "categories": ["cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2508.13587", "abs": "https://arxiv.org/abs/2508.13587", "authors": ["Lei Chen", "Xuanle Zhao", "Zhixiong Zeng", "Jing Huang", "Liming Zheng", "Yufeng Zhong", "Lin Ma"], "title": "Breaking the SFT Plateau: Multimodal Structured Reinforcement Learning for Chart-to-Code Generation", "comment": "technical report", "summary": "While reinforcement learning (RL) has proven highly effective for general\nreasoning in vision-language models, its application to tasks requiring\nin-depth understanding of information-rich images and generation of structured\noutputs remains underexplored. Chart-to-code generation exemplifies this\nchallenge, demanding complex reasoning over visual charts to generate\nstructured code. Supervised fine-tuning (SFT) alone is often insufficient,\nhighlighting the need for effective RL strategies that appropriately reward\nstructured outputs. We systematically investigate the performance plateau in\nSFT through large-scale experiments and propose Multimodal Structured\nReinforcement Learning (MSRL) for chart-to-code generation, which substantially\nbreaks through this plateau. We construct the largest training corpus to date,\ncontaining 3 million chart-code pairs from real-world arXiv tables to mitigate\nsimplistic patterns of prior synthetic data. Despite reaching state-of-the-art\nperformance, our experiments show that scaling SFT data eventually hits a\nplateau where further increases yield negligible improvements. Our MSRL method\nleverages a multi-granularity structured reward system using multimodal textual\nand visual feedback. At the textual level, rule-based rewards validate\nfine-grained code details. At the visual level, model-based rewards assess\nstructural similarity by rendering generated code into images and employing an\nevaluator model. We implement this within a two-stage curriculum for training\nstability. Results demonstrate that MSRL significantly breaks the SFT plateau,\nimproving high-level metrics by 6.2% and 9.9% on ChartMimic and ReachQA\nbenchmarks respectively, achieving competitive performance with advanced\nclosed-source models.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["code generation", "fine-grained"], "score": 2}}, "source_file": "2025-08-20.jsonl"}
