{"id": "2508.05613", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05613", "abs": "https://arxiv.org/abs/2508.05613", "authors": ["Haitao Hong", "Yuchen Yan", "Xingyu Wu", "Guiyang Hou", "Wenqi Zhang", "Weiming Lu", "Yongliang Shen", "Jun Xiao"], "title": "Cooper: Co-Optimizing Policy and Reward Models in Reinforcement Learning for Large Language Models", "comment": "Project Page: https://zju-real.github.io/cooper Code:\n  https://github.com/zju-real/cooper", "summary": "Large language models (LLMs) have demonstrated remarkable performance in\nreasoning tasks, where reinforcement learning (RL) serves as a key algorithm\nfor enhancing their reasoning capabilities. Currently, there are two mainstream\nreward paradigms: model-based rewards and rule-based rewards. However, both\napproaches suffer from limitations: rule-based rewards lack robustness, while\nmodel-based rewards are vulnerable to reward hacking. To address these issues,\nwe propose Cooper(Co-optimizing Policy Model and Reward Model), a RL framework\nthat jointly optimizes both the policy model and the reward model. Cooper\nleverages the high precision of rule-based rewards when identifying correct\nresponses, and dynamically constructs and selects positive-negative sample\npairs for continued training the reward model. This design enhances robustness\nand mitigates the risk of reward hacking. To further support Cooper, we\nintroduce a hybrid annotation strategy that efficiently and accurately\ngenerates training data for the reward model. We also propose a reference-based\nreward modeling paradigm, where the reward model takes a reference answer as\ninput. Based on this design, we train a reward model named VerifyRM, which\nachieves higher accuracy on VerifyBench compared to other models of the same\nsize. We conduct reinforcement learning using both VerifyRM and Cooper. Our\nexperiments show that Cooper not only alleviates reward hacking but also\nimproves end-to-end RL performance, for instance, achieving a 0.54% gain in\naverage accuracy on Qwen2.5-1.5B-Instruct. Our findings demonstrate that\ndynamically updating reward model is an effective way to combat reward hacking,\nproviding a reference for better integrating reward models into RL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "reinforcement learning", "reward hacking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation", "accuracy"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05618", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05618", "abs": "https://arxiv.org/abs/2508.05618", "authors": ["Xilun Chen", "Ilia Kulikov", "Vincent-Pierre Berges", "Barlas Oğuz", "Rulin Shao", "Gargi Ghosh", "Jason Weston", "Wen-tau Yih"], "title": "Learning to Reason for Factuality", "comment": null, "summary": "Reasoning Large Language Models (R-LLMs) have significantly advanced complex\nreasoning tasks but often struggle with factuality, generating substantially\nmore hallucinations than their non-reasoning counterparts on long-form\nfactuality benchmarks. However, extending online Reinforcement Learning (RL), a\nkey component in recent R-LLM advancements, to the long-form factuality setting\nposes several unique challenges due to the lack of reliable verification\nmethods. Previous work has utilized automatic factuality evaluation frameworks\nsuch as FActScore to curate preference data in the offline RL setting, yet we\nfind that directly leveraging such methods as the reward in online RL leads to\nreward hacking in multiple ways, such as producing less detailed or relevant\nresponses. We propose a novel reward function that simultaneously considers the\nfactual precision, response detail level, and answer relevance, and applies\nonline RL to learn high quality factual reasoning. Evaluated on six long-form\nfactuality benchmarks, our factual reasoning model achieves an average\nreduction of 23.1 percentage points in hallucination rate, a 23% increase in\nanswer detail level, and no degradation in the overall response helpfulness.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["reasoning model"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning", "preference", "reward hacking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "helpfulness", "factuality"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05613", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05613", "abs": "https://arxiv.org/abs/2508.05613", "authors": ["Haitao Hong", "Yuchen Yan", "Xingyu Wu", "Guiyang Hou", "Wenqi Zhang", "Weiming Lu", "Yongliang Shen", "Jun Xiao"], "title": "Cooper: Co-Optimizing Policy and Reward Models in Reinforcement Learning for Large Language Models", "comment": "Project Page: https://zju-real.github.io/cooper Code:\n  https://github.com/zju-real/cooper", "summary": "Large language models (LLMs) have demonstrated remarkable performance in\nreasoning tasks, where reinforcement learning (RL) serves as a key algorithm\nfor enhancing their reasoning capabilities. Currently, there are two mainstream\nreward paradigms: model-based rewards and rule-based rewards. However, both\napproaches suffer from limitations: rule-based rewards lack robustness, while\nmodel-based rewards are vulnerable to reward hacking. To address these issues,\nwe propose Cooper(Co-optimizing Policy Model and Reward Model), a RL framework\nthat jointly optimizes both the policy model and the reward model. Cooper\nleverages the high precision of rule-based rewards when identifying correct\nresponses, and dynamically constructs and selects positive-negative sample\npairs for continued training the reward model. This design enhances robustness\nand mitigates the risk of reward hacking. To further support Cooper, we\nintroduce a hybrid annotation strategy that efficiently and accurately\ngenerates training data for the reward model. We also propose a reference-based\nreward modeling paradigm, where the reward model takes a reference answer as\ninput. Based on this design, we train a reward model named VerifyRM, which\nachieves higher accuracy on VerifyBench compared to other models of the same\nsize. We conduct reinforcement learning using both VerifyRM and Cooper. Our\nexperiments show that Cooper not only alleviates reward hacking but also\nimproves end-to-end RL performance, for instance, achieving a 0.54% gain in\naverage accuracy on Qwen2.5-1.5B-Instruct. Our findings demonstrate that\ndynamically updating reward model is an effective way to combat reward hacking,\nproviding a reference for better integrating reward models into RL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "reinforcement learning", "reward hacking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation", "accuracy"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05496", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05496", "abs": "https://arxiv.org/abs/2508.05496", "authors": ["Shuo Cai", "Su Lu", "Qi Zhou", "Kejing Yang", "Zhijie Sang", "Congkai Xie", "Hongxia Yang"], "title": "InfiAlign: A Scalable and Sample-Efficient Framework for Aligning LLMs to Enhance Reasoning Capabilities", "comment": null, "summary": "Large language models (LLMs) have exhibited impressive reasoning abilities on\na wide range of complex tasks. However, enhancing these capabilities through\npost-training remains resource intensive, particularly in terms of data and\ncomputational cost. Although recent efforts have sought to improve sample\nefficiency through selective data curation, existing methods often rely on\nheuristic or task-specific strategies that hinder scalability. In this work, we\nintroduce InfiAlign, a scalable and sample-efficient post-training framework\nthat integrates supervised fine-tuning (SFT) with Direct Preference\nOptimization (DPO) to align LLMs for enhanced reasoning. At the core of\nInfiAlign is a robust data selection pipeline that automatically curates\nhigh-quality alignment data from open-source reasoning datasets using\nmultidimensional quality metrics. This pipeline enables significant performance\ngains while drastically reducing data requirements and remains extensible to\nnew data sources. When applied to the Qwen2.5-Math-7B-Base model, our SFT model\nachieves performance on par with DeepSeek-R1-Distill-Qwen-7B, while using only\napproximately 12% of the training data, and demonstrates strong generalization\nacross diverse reasoning tasks. Additional improvements are obtained through\nthe application of DPO, with particularly notable gains in mathematical\nreasoning tasks. The model achieves an average improvement of 3.89% on AIME\n24/25 benchmarks. Our results highlight the effectiveness of combining\nprincipled data selection with full-stage post-training, offering a practical\nsolution for aligning large reasoning models in a scalable and data-efficient\nmanner. The model checkpoints are available at\nhttps://huggingface.co/InfiX-ai/InfiAlign-Qwen-7B-SFT.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05553", "categories": ["cs.CL", "cs.CY", "I.2.7; J.4"], "pdf": "https://arxiv.org/pdf/2508.05553", "abs": "https://arxiv.org/abs/2508.05553", "authors": ["Franziska Weeber", "Tanise Ceron", "Sebastian Padó"], "title": "Do Political Opinions Transfer Between Western Languages? An Analysis of Unaligned and Aligned Multilingual LLMs", "comment": null, "summary": "Public opinion surveys show cross-cultural differences in political opinions\nbetween socio-cultural contexts. However, there is no clear evidence whether\nthese differences translate to cross-lingual differences in multilingual large\nlanguage models (MLLMs). We analyze whether opinions transfer between languages\nor whether there are separate opinions for each language in MLLMs of various\nsizes across five Western languages. We evaluate MLLMs' opinions by prompting\nthem to report their (dis)agreement with political statements from voting\nadvice applications. To better understand the interaction between languages in\nthe models, we evaluate them both before and after aligning them with more left\nor right views using direct preference optimization and English alignment data\nonly. Our findings reveal that unaligned models show only very few significant\ncross-lingual differences in the political opinions they reflect. The political\nalignment shifts opinions almost uniformly across all five languages. We\nconclude that in Western language contexts, political opinions transfer between\nlanguages, demonstrating the challenges in achieving explicit socio-linguistic,\ncultural, and political alignment of MLLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["agreement"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04945", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2508.04945", "abs": "https://arxiv.org/abs/2508.04945", "authors": ["Louie Hong Yao", "Nicholas Jarvis", "Tianyu Jiang"], "title": "Towards Robust Evaluation of Visual Activity Recognition: Resolving Verb Ambiguity with Sense Clustering", "comment": "18 pages, 5 figures", "summary": "Evaluating visual activity recognition systems is challenging due to inherent\nambiguities in verb semantics and image interpretation. When describing actions\nin images, synonymous verbs can refer to the same event (e.g., brushing vs.\ngrooming), while different perspectives can lead to equally valid but distinct\nverb choices (e.g., piloting vs. operating). Standard exact-match evaluation,\nwhich relies on a single gold answer, fails to capture these ambiguities,\nresulting in an incomplete assessment of model performance. To address this, we\npropose a vision-language clustering framework that constructs verb sense\nclusters, providing a more robust evaluation. Our analysis of the imSitu\ndataset shows that each image maps to an average of 2.8 sense clusters, with\neach cluster representing a distinct perspective of the image. We evaluate\nmultiple activity recognition models and compare our cluster-based evaluation\nwith standard evaluation methods. Additionally, our human alignment analysis\nsuggests that the cluster-based evaluation better aligns with human judgements,\noffering a more nuanced assessment of model performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "human alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05452", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05452", "abs": "https://arxiv.org/abs/2508.05452", "authors": ["Ming Zhang", "Yujiong Shen", "Jingyi Deng", "Yuhui Wang", "Yue Zhang", "Junzhe Wang", "Shichun Liu", "Shihan Dou", "Huayu Sha", "Qiyuan Peng", "Changhao Jiang", "Jingqi Tong", "Yilong Wu", "Zhihao Zhang", "Mingqi Wu", "Zhiheng Xi", "Mingxu Chai", "Tao Liang", "Zhihui Fei", "Zhen Wang", "Mingyang Wan", "Guojun Ma", "Tao Gui", "Qi Zhang", "Xuanjing Huang"], "title": "LLMEval-3: A Large-Scale Longitudinal Study on Robust and Fair Evaluation of Large Language Models", "comment": null, "summary": "Existing evaluation of Large Language Models (LLMs) on static benchmarks is\nvulnerable to data contamination and leaderboard overfitting, critical issues\nthat obscure true model capabilities. To address this, we introduce LLMEval-3,\na framework for dynamic evaluation of LLMs. LLMEval-3 is built on a proprietary\nbank of 220k graduate-level questions, from which it dynamically samples unseen\ntest sets for each evaluation run. Its automated pipeline ensures integrity via\ncontamination-resistant data curation, a novel anti-cheating architecture, and\na calibrated LLM-as-a-judge process achieving 90% agreement with human experts,\ncomplemented by a relative ranking system for fair comparison. An 20-month\nlongitudinal study of nearly 50 leading models reveals a performance ceiling on\nknowledge memorization and exposes data contamination vulnerabilities\nundetectable by static benchmarks. The framework demonstrates exceptional\nrobustness in ranking stability and consistency, providing strong empirical\nvalidation for the dynamic evaluation paradigm. LLMEval-3 offers a robust and\ncredible methodology for assessing the true capabilities of LLMs beyond\nleaderboard scores, promoting the development of more trustworthy evaluation\nstandards.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "ranking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement", "consistency"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04945", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2508.04945", "abs": "https://arxiv.org/abs/2508.04945", "authors": ["Louie Hong Yao", "Nicholas Jarvis", "Tianyu Jiang"], "title": "Towards Robust Evaluation of Visual Activity Recognition: Resolving Verb Ambiguity with Sense Clustering", "comment": "18 pages, 5 figures", "summary": "Evaluating visual activity recognition systems is challenging due to inherent\nambiguities in verb semantics and image interpretation. When describing actions\nin images, synonymous verbs can refer to the same event (e.g., brushing vs.\ngrooming), while different perspectives can lead to equally valid but distinct\nverb choices (e.g., piloting vs. operating). Standard exact-match evaluation,\nwhich relies on a single gold answer, fails to capture these ambiguities,\nresulting in an incomplete assessment of model performance. To address this, we\npropose a vision-language clustering framework that constructs verb sense\nclusters, providing a more robust evaluation. Our analysis of the imSitu\ndataset shows that each image maps to an average of 2.8 sense clusters, with\neach cluster representing a distinct perspective of the image. We evaluate\nmultiple activity recognition models and compare our cluster-based evaluation\nwith standard evaluation methods. Additionally, our human alignment analysis\nsuggests that the cluster-based evaluation better aligns with human judgements,\noffering a more nuanced assessment of model performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "human alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05213", "categories": ["cs.CV", "I.2.10"], "pdf": "https://arxiv.org/pdf/2508.05213", "abs": "https://arxiv.org/abs/2508.05213", "authors": ["Jianming Liu", "Wenlong Qiu", "Haitao Wei"], "title": "Textual and Visual Guided Task Adaptation for Source-Free Cross-Domain Few-Shot Segmentation", "comment": "10 pages,Accepted at ACMMM2025", "summary": "Few-Shot Segmentation(FSS) aims to efficient segmentation of new objects with\nfew labeled samples. However, its performance significantly degrades when\ndomain discrepancies exist between training and deployment. Cross-Domain\nFew-Shot Segmentation(CD-FSS) is proposed to mitigate such performance\ndegradation. Current CD-FSS methods primarily sought to develop segmentation\nmodels on a source domain capable of cross-domain generalization. However,\ndriven by escalating concerns over data privacy and the imperative to minimize\ndata transfer and training expenses, the development of source-free CD-FSS\napproaches has become essential. In this work, we propose a source-free CD-FSS\nmethod that leverages both textual and visual information to facilitate target\ndomain task adaptation without requiring source domain data. Specifically, we\nfirst append Task-Specific Attention Adapters (TSAA) to the feature pyramid of\na pretrained backbone, which adapt multi-level features extracted from the\nshared pre-trained backbone to the target task. Then, the parameters of the\nTSAA are trained through a Visual-Visual Embedding Alignment (VVEA) module and\na Text-Visual Embedding Alignment (TVEA) module. The VVEA module utilizes\nglobal-local visual features to align image features across different views,\nwhile the TVEA module leverages textual priors from pre-aligned multi-modal\nfeatures (e.g., from CLIP) to guide cross-modal adaptation. By combining the\noutputs of these modules through dense comparison operations and subsequent\nfusion via skip connections, our method produces refined prediction masks.\nUnder both 1-shot and 5-shot settings, the proposed approach achieves average\nsegmentation accuracy improvements of 2.18\\% and 4.11\\%, respectively, across\nfour cross-domain datasets, significantly outperforming state-of-the-art CD-FSS\nmethods. Code are available at https://github.com/ljm198134/TVGTANet.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05609", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.05609", "abs": "https://arxiv.org/abs/2508.05609", "authors": ["Yuhan Zhang", "Long Zhuo", "Ziyang Chu", "Tong Wu", "Zhibing Li", "Liang Pan", "Dahua Lin", "Ziwei Liu"], "title": "Hi3DEval: Advancing 3D Generation Evaluation with Hierarchical Validity", "comment": "Page: https://zyh482.github.io/Hi3DEval/", "summary": "Despite rapid advances in 3D content generation, quality assessment for the\ngenerated 3D assets remains challenging. Existing methods mainly rely on\nimage-based metrics and operate solely at the object level, limiting their\nability to capture spatial coherence, material authenticity, and high-fidelity\nlocal details. 1) To address these challenges, we introduce Hi3DEval, a\nhierarchical evaluation framework tailored for 3D generative content. It\ncombines both object-level and part-level evaluation, enabling holistic\nassessments across multiple dimensions as well as fine-grained quality\nanalysis. Additionally, we extend texture evaluation beyond aesthetic\nappearance by explicitly assessing material realism, focusing on attributes\nsuch as albedo, saturation, and metallicness. 2) To support this framework, we\nconstruct Hi3DBench, a large-scale dataset comprising diverse 3D assets and\nhigh-quality annotations, accompanied by a reliable multi-agent annotation\npipeline. We further propose a 3D-aware automated scoring system based on\nhybrid 3D representations. Specifically, we leverage video-based\nrepresentations for object-level and material-subject evaluations to enhance\nmodeling of spatio-temporal consistency and employ pretrained 3D features for\npart-level perception. Extensive experiments demonstrate that our approach\noutperforms existing image-based metrics in modeling 3D characteristics and\nachieves superior alignment with human preference, providing a scalable\nalternative to manual evaluations. The project page is available at\nhttps://zyh482.github.io/Hi3DEval/.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "human preference", "annotation", "consistency", "fine-grained"], "score": 6}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04945", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2508.04945", "abs": "https://arxiv.org/abs/2508.04945", "authors": ["Louie Hong Yao", "Nicholas Jarvis", "Tianyu Jiang"], "title": "Towards Robust Evaluation of Visual Activity Recognition: Resolving Verb Ambiguity with Sense Clustering", "comment": "18 pages, 5 figures", "summary": "Evaluating visual activity recognition systems is challenging due to inherent\nambiguities in verb semantics and image interpretation. When describing actions\nin images, synonymous verbs can refer to the same event (e.g., brushing vs.\ngrooming), while different perspectives can lead to equally valid but distinct\nverb choices (e.g., piloting vs. operating). Standard exact-match evaluation,\nwhich relies on a single gold answer, fails to capture these ambiguities,\nresulting in an incomplete assessment of model performance. To address this, we\npropose a vision-language clustering framework that constructs verb sense\nclusters, providing a more robust evaluation. Our analysis of the imSitu\ndataset shows that each image maps to an average of 2.8 sense clusters, with\neach cluster representing a distinct perspective of the image. We evaluate\nmultiple activity recognition models and compare our cluster-based evaluation\nwith standard evaluation methods. Additionally, our human alignment analysis\nsuggests that the cluster-based evaluation better aligns with human judgements,\noffering a more nuanced assessment of model performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "human alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04826", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.04826", "abs": "https://arxiv.org/abs/2508.04826", "authors": ["Tommaso Tosato", "Saskia Helbling", "Yorguin-Jose Mantilla-Ramos", "Mahmood Hegazy", "Alberto Tosato", "David John Lemay", "Irina Rish", "Guillaume Dumas"], "title": "Persistent Instability in LLM's Personality Measurements: Effects of Scale, Reasoning, and Conversation History", "comment": null, "summary": "Large language models require consistent behavioral patterns for safe\ndeployment, yet their personality-like traits remain poorly understood. We\npresent PERSIST (PERsonality Stability in Synthetic Text), a comprehensive\nevaluation framework testing 25+ open-source models (1B-671B parameters) across\n500,000+ responses. Using traditional (BFI-44, SD3) and novel LLM-adapted\npersonality instruments, we systematically vary question order, paraphrasing,\npersonas, and reasoning modes. Our findings challenge fundamental deployment\nassumptions: (1) Even 400B+ models exhibit substantial response variability (SD\n> 0.4); (2) Minor prompt reordering alone shifts personality measurements by up\nto 20%; (3) Interventions expected to stabilize behavior, such as\nchain-of-thought reasoning, detailed personas instruction, inclusion of\nconversation history, can paradoxically increase variability; (4) LLM-adapted\ninstruments show equal instability to human-centric versions, confirming\narchitectural rather than translational limitations. This persistent\ninstability across scales and mitigation strategies suggests current LLMs lack\nthe foundations for genuine behavioral consistency. For safety-critical\napplications requiring predictable behavior, these findings indicate that\npersonality-based alignment strategies may be fundamentally inadequate.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety", "consistency"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04825", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.04825", "abs": "https://arxiv.org/abs/2508.04825", "authors": ["Seungyong Lee", "Jeong-gi Kwak"], "title": "Voost: A Unified and Scalable Diffusion Transformer for Bidirectional Virtual Try-On and Try-Off", "comment": "Project page: https://nxnai.github.io/Voost/", "summary": "Virtual try-on aims to synthesize a realistic image of a person wearing a\ntarget garment, but accurately modeling garment-body correspondence remains a\npersistent challenge, especially under pose and appearance variation. In this\npaper, we propose Voost - a unified and scalable framework that jointly learns\nvirtual try-on and try-off with a single diffusion transformer. By modeling\nboth tasks jointly, Voost enables each garment-person pair to supervise both\ndirections and supports flexible conditioning over generation direction and\ngarment category, enhancing garment-body relational reasoning without\ntask-specific networks, auxiliary losses, or additional labels. In addition, we\nintroduce two inference-time techniques: attention temperature scaling for\nrobustness to resolution or mask variation, and self-corrective sampling that\nleverages bidirectional consistency between tasks. Extensive experiments\ndemonstrate that Voost achieves state-of-the-art results on both try-on and\ntry-off benchmarks, consistently outperforming strong baselines in alignment\naccuracy, visual fidelity, and generalization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04720", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.04720", "abs": "https://arxiv.org/abs/2508.04720", "authors": ["Yingjie Zhou", "Jiezhang Cao", "Farong Wen", "Li Xu", "Yanwei Jiang", "Jun Jia", "Ronghui Li", "Xiaohong Liu", "Yu Zhou", "Xiongkuo Min", "Jie Guo", "Zicheng Zhang", "Guangtao Zhai"], "title": "Who is a Better Player: LLM against LLM", "comment": null, "summary": "Adversarial board games, as a paradigmatic domain of strategic reasoning and\nintelligence, have long served as both a popular competitive activity and a\nbenchmark for evaluating artificial intelligence (AI) systems. Building on this\nfoundation, we propose an adversarial benchmarking framework to assess the\ncomprehensive performance of Large Language Models (LLMs) through board games\ncompetition, compensating the limitation of data dependency of the mainstream\nQuestion-and-Answer (Q&A) based benchmark method. We introduce Qi Town, a\nspecialized evaluation platform that supports 5 widely played games and\ninvolves 20 LLM-driven players. The platform employs both the Elo rating system\nand a novel Performance Loop Graph (PLG) to quantitatively evaluate the\ntechnical capabilities of LLMs, while also capturing Positive Sentiment Score\n(PSS) throughout gameplay to assess mental fitness. The evaluation is\nstructured as a round-robin tournament, enabling systematic comparison across\nplayers. Experimental results indicate that, despite technical differences,\nmost LLMs remain optimistic about winning and losing, demonstrating greater\nadaptability to high-stress adversarial environments than humans. On the other\nhand, the complex relationship between cyclic wins and losses in PLGs exposes\nthe instability of LLMs' skill play during games, warranting further\nexplanation and exploration.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04848", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.04848", "abs": "https://arxiv.org/abs/2508.04848", "authors": ["Chang Tian", "Matthew B. Blaschko", "Mingzhe Xing", "Xiuxing Li", "Yinliang Yue", "Marie-Francine Moens"], "title": "Large Language Models Reasoning Abilities Under Non-Ideal Conditions After RL-Fine-Tuning", "comment": "large language models, large vision-language model, reasoning,\n  non-ideal conditions, reinforcement learning", "summary": "Reinforcement learning (RL) has become a key technique for enhancing the\nreasoning abilities of large language models (LLMs), with policy-gradient\nalgorithms dominating the post-training stage because of their efficiency and\neffectiveness. However, most existing benchmarks evaluate large-language-model\nreasoning under idealized settings, overlooking performance in realistic,\nnon-ideal scenarios. We identify three representative non-ideal scenarios with\npractical relevance: summary inference, fine-grained noise suppression, and\ncontextual filtering. We introduce a new research direction guided by\nbrain-science findings that human reasoning remains reliable under imperfect\ninputs. We formally define and evaluate these challenging scenarios. We\nfine-tune three LLMs and a state-of-the-art large vision-language model (LVLM)\nusing RL with a representative policy-gradient algorithm and then test their\nperformance on eight public datasets. Our results reveal that while RL\nfine-tuning improves baseline reasoning under idealized settings, performance\ndeclines significantly across all three non-ideal scenarios, exposing critical\nlimitations in advanced reasoning capabilities. Although we propose a\nscenario-specific remediation method, our results suggest current methods leave\nthese reasoning deficits largely unresolved. This work highlights that the\nreasoning abilities of large models are often overstated and underscores the\nimportance of evaluating models under non-ideal scenarios. The code and data\nwill be released at XXXX.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05097", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05097", "abs": "https://arxiv.org/abs/2508.05097", "authors": ["Aditya Kishore", "Gaurav Kumar", "Jasabanta Patro"], "title": "Multimodal Fact Checking with Unified Visual, Textual, and Contextual Representations", "comment": null, "summary": "The growing rate of multimodal misinformation, where claims are supported by\nboth text and images, poses significant challenges to fact-checking systems\nthat rely primarily on textual evidence. In this work, we have proposed a\nunified framework for fine-grained multimodal fact verification called\n\"MultiCheck\", designed to reason over structured textual and visual signals.\nOur architecture combines dedicated encoders for text and images with a fusion\nmodule that captures cross-modal relationships using element-wise interactions.\nA classification head then predicts the veracity of a claim, supported by a\ncontrastive learning objective that encourages semantic alignment between\nclaim-evidence pairs in a shared latent space. We evaluate our approach on the\nFactify 2 dataset, achieving a weighted F1 score of 0.84, substantially\noutperforming the baseline. These results highlight the effectiveness of\nexplicit multimodal reasoning and demonstrate the potential of our approach for\nscalable and interpretable fact-checking in complex, real-world scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04928", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.04928", "abs": "https://arxiv.org/abs/2508.04928", "authors": ["Suchisrit Gangopadhyay", "Jung-Hee Kim", "Xien Chen", "Patrick Rim", "Hyoungseob Park", "Alex Wong"], "title": "Extending Foundational Monocular Depth Estimators to Fisheye Cameras with Calibration Tokens", "comment": null, "summary": "We propose a method to extend foundational monocular depth estimators\n(FMDEs), trained on perspective images, to fisheye images. Despite being\ntrained on tens of millions of images, FMDEs are susceptible to the covariate\nshift introduced by changes in camera calibration (intrinsic, distortion)\nparameters, leading to erroneous depth estimates. Our method aligns the\ndistribution of latent embeddings encoding fisheye images to those of\nperspective images, enabling the reuse of FMDEs for fisheye cameras without\nretraining or finetuning. To this end, we introduce a set of Calibration Tokens\nas a light-weight adaptation mechanism that modulates the latent embeddings for\nalignment. By exploiting the already expressive latent space of FMDEs, we posit\nthat modulating their embeddings avoids the negative impact of artifacts and\nloss introduced in conventional recalibration or map projection to a canonical\nreference frame in the image space. Our method is self-supervised and does not\nrequire fisheye images but leverages publicly available large-scale perspective\nimage datasets. This is done by recalibrating perspective images to fisheye\nimages, and enforcing consistency between their estimates during training. We\nevaluate our approach with several FMDEs, on both indoors and outdoors, where\nwe consistently improve over state-of-the-art methods using a single set of\ntokens for both. Code available at:\nhttps://github.com/JungHeeKim29/calibration-token.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05113", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05113", "abs": "https://arxiv.org/abs/2508.05113", "authors": ["Xinyue Wu", "Fan Hu", "Shaik Jani Babu", "Yi Zhao", "Xinfei Guo"], "title": "EasySize: Elastic Analog Circuit Sizing via LLM-Guided Heuristic Search", "comment": null, "summary": "Analog circuit design is a time-consuming, experience-driven task in chip\ndevelopment. Despite advances in AI, developing universal, fast, and stable\ngate sizing methods for analog circuits remains a significant challenge. Recent\napproaches combine Large Language Models (LLMs) with heuristic search\ntechniques to enhance generalizability, but they often depend on large model\nsizes and lack portability across different technology nodes. To overcome these\nlimitations, we propose EasySize, the first lightweight gate sizing framework\nbased on a finetuned Qwen3-8B model, designed for universal applicability\nacross process nodes, design specifications, and circuit topologies. EasySize\nexploits the varying Ease of Attainability (EOA) of performance metrics to\ndynamically construct task-specific loss functions, enabling efficient\nheuristic search through global Differential Evolution (DE) and local Particle\nSwarm Optimization (PSO) within a feedback-enhanced flow. Although finetuned\nsolely on 350nm node data, EasySize achieves strong performance on 5\noperational amplifier (Op-Amp) netlists across 180nm, 45nm, and 22nm technology\nnodes without additional targeted training, and outperforms AutoCkt, a\nwidely-used Reinforcement Learning based sizing framework, on 86.67\\% of tasks\nwith more than 96.67\\% of simulation resources reduction. We argue that\nEasySize can significantly reduce the reliance on human expertise and\ncomputational resources in gate sizing, thereby accelerating and simplifying\nthe analog circuit design process. EasySize will be open-sourced at a later\ndate.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05132", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05132", "abs": "https://arxiv.org/abs/2508.05132", "authors": ["Chang Hong", "Minghao Wu", "Qingying Xiao", "Yuchi Wang", "Xiang Wan", "Guangjun Yu", "Benyou Wang", "Yan Hu"], "title": "Towards Assessing Medical Ethics from Knowledge to Practice", "comment": null, "summary": "The integration of large language models into healthcare necessitates a\nrigorous evaluation of their ethical reasoning, an area current benchmarks\noften overlook. We introduce PrinciplismQA, a comprehensive benchmark with\n3,648 questions designed to systematically assess LLMs' alignment with core\nmedical ethics. Grounded in Principlism, our benchmark features a high-quality\ndataset. This includes multiple-choice questions curated from authoritative\ntextbooks and open-ended questions sourced from authoritative medical ethics\ncase study literature, all validated by medical experts. Our experiments reveal\na significant gap between models' ethical knowledge and their practical\napplication, especially in dynamically applying ethical principles to\nreal-world scenarios. Most LLMs struggle with dilemmas concerning Beneficence,\noften over-emphasizing other principles. Frontier closed-source models, driven\nby strong general capabilities, currently lead the benchmark. Notably, medical\ndomain fine-tuning can enhance models' overall ethical competence, but further\nprogress requires better alignment with medical ethical knowledge.\nPrinciplismQA offers a scalable framework to diagnose these specific ethical\nweaknesses, paving the way for more balanced and responsible medical AI.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05116", "categories": ["cs.AI", "cs.MA"], "pdf": "https://arxiv.org/pdf/2508.05116", "abs": "https://arxiv.org/abs/2508.05116", "authors": ["Peer-Benedikt Degen", "Igor Asanov"], "title": "Beyond Automation: Socratic AI, Epistemic Agency, and the Implications of the Emergence of Orchestrated Multi-Agent Learning Architectures", "comment": null, "summary": "Generative AI is no longer a peripheral tool in higher education. It is\nrapidly evolving into a general-purpose infrastructure that reshapes how\nknowledge is generated, mediated, and validated. This paper presents findings\nfrom a controlled experiment evaluating a Socratic AI Tutor, a large language\nmodel designed to scaffold student research question development through\nstructured dialogue grounded in constructivist theory. Conducted with 65\npre-service teacher students in Germany, the study compares interaction with\nthe Socratic Tutor to engagement with an uninstructed AI chatbot. Students\nusing the Socratic Tutor reported significantly greater support for critical,\nindependent, and reflective thinking, suggesting that dialogic AI can stimulate\nmetacognitive engagement and challenging recent narratives of de-skilling due\nto generative AI usage. These findings serve as a proof of concept for a\nbroader pedagogical shift: the use of multi-agent systems (MAS) composed of\nspecialised AI agents. To conceptualise this, we introduce the notion of\norchestrated MAS, modular, pedagogically aligned agent constellations, curated\nby educators, that support diverse learning trajectories through differentiated\nroles and coordinated interaction. To anchor this shift, we propose an adapted\noffer-and-use model, in which students appropriate instructional offers from\nthese agents. Beyond technical feasibility, we examine system-level\nimplications for higher education institutions and students, including funding\nnecessities, changes to faculty roles, curriculars, competencies and assessment\npractices. We conclude with a comparative cost-effectiveness analysis\nhighlighting the scalability of such systems. In sum, this study contributes\nboth empirical evidence and a conceptual roadmap for hybrid learning ecosystems\nthat embed human-AI co-agency and pedagogical alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05242", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05242", "abs": "https://arxiv.org/abs/2508.05242", "authors": ["Sijie Wang", "Quanjiang Guo", "Kai Zhao", "Yawei Zhang", "Xin Li", "Xiang Li", "Siqi Li", "Rui She", "Shangshu Yu", "Wee Peng Tay"], "title": "CodeBoost: Boosting Code LLMs by Squeezing Knowledge from Code Snippets with RL", "comment": "Technical report. Project page: https://github.com/sijieaaa/CodeBoost", "summary": "Code large language models (LLMs) have become indispensable tools for\nbuilding efficient and automated coding pipelines. Existing models are\ntypically post-trained using reinforcement learning (RL) from general-purpose\nLLMs using \"human instruction-final answer\" pairs, where the instructions are\nusually from manual annotations. However, collecting high-quality coding\ninstructions is both labor-intensive and difficult to scale. On the other hand,\ncode snippets are abundantly available from various sources. This imbalance\npresents a major bottleneck in instruction-based post-training. We propose\nCodeBoost, a post-training framework that enhances code LLMs purely from code\nsnippets, without relying on human-annotated instructions. CodeBoost introduces\nthe following key components: (1) maximum-clique curation, which selects a\nrepresentative and diverse training corpus from code; (2) bi-directional\nprediction, which enables the model to learn from both forward and backward\nprediction objectives; (3) error-aware prediction, which incorporates learning\nsignals from both correct and incorrect outputs; (4) heterogeneous\naugmentation, which diversifies the training distribution to enrich code\nsemantics; and (5) heterogeneous rewarding, which guides model learning through\nmultiple reward types including format correctness and execution feedback from\nboth successes and failures. Extensive experiments across several code LLMs and\nbenchmarks verify that CodeBoost consistently improves performance,\ndemonstrating its effectiveness as a scalable and effective training pipeline.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05358", "categories": ["cs.CL", "cs.HC"], "pdf": "https://arxiv.org/pdf/2508.05358", "abs": "https://arxiv.org/abs/2508.05358", "authors": ["Fenya Wasserroth", "Eleftherios Avramidis", "Vera Czehmann", "Tanja Kojic", "Fabrizio Nunnari", "Sebastian Möller"], "title": "Evaluation of a Sign Language Avatar on Comprehensibility, User Experience \\& Acceptability", "comment": null, "summary": "This paper presents an investigation into the impact of adding adjustment\nfeatures to an existing sign language (SL) avatar on a Microsoft Hololens 2\ndevice. Through a detailed analysis of interactions of expert German Sign\nLanguage (DGS) users with both adjustable and non-adjustable avatars in a\nspecific use case, this study identifies the key factors influencing the\ncomprehensibility, the user experience (UX), and the acceptability of such a\nsystem. Despite user preference for adjustable settings, no significant\nimprovements in UX or comprehensibility were observed, which remained at low\nlevels, amid missing SL elements (mouthings and facial expressions) and\nimplementation issues (indistinct hand shapes, lack of feedback and menu\npositioning). Hedonic quality was rated higher than pragmatic quality,\nindicating that users found the system more emotionally or aesthetically\npleasing than functionally useful. Stress levels were higher for the adjustable\navatar, reflecting lower performance, greater effort and more frustration.\nAdditionally, concerns were raised about whether the Hololens adjustment\ngestures are intuitive and easy to familiarise oneself with. While\nacceptability of the concept of adjustability was generally positive, it was\nstrongly dependent on usability and animation quality. This study highlights\nthat personalisation alone is insufficient, and that SL avatars must be\ncomprehensible by default. Key recommendations include enhancing mouthing and\nfacial animation, improving interaction interfaces, and applying participatory\ndesign.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04987", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.04987", "abs": "https://arxiv.org/abs/2508.04987", "authors": ["Xinyao Li", "Jingjing Li", "Zhekai Du", "Lei Zhu", "Heng Tao Shen"], "title": "Unified modality separation: A vision-language framework for unsupervised domain adaptation", "comment": "Accepted to TPAMI", "summary": "Unsupervised domain adaptation (UDA) enables models trained on a labeled\nsource domain to handle new unlabeled domains. Recently, pre-trained\nvision-language models (VLMs) have demonstrated promising zero-shot performance\nby leveraging semantic information to facilitate target tasks. By aligning\nvision and text embeddings, VLMs have shown notable success in bridging domain\ngaps. However, inherent differences naturally exist between modalities, which\nis known as modality gap. Our findings reveal that direct UDA with the presence\nof modality gap only transfers modality-invariant knowledge, leading to\nsuboptimal target performance. To address this limitation, we propose a unified\nmodality separation framework that accommodates both modality-specific and\nmodality-invariant components. During training, different modality components\nare disentangled from VLM features then handled separately in a unified manner.\nAt test time, modality-adaptive ensemble weights are automatically determined\nto maximize the synergy of different components. To evaluate instance-level\nmodality characteristics, we design a modality discrepancy metric to categorize\nsamples into modality-invariant, modality-specific, and uncertain ones. The\nmodality-invariant samples are exploited to facilitate cross-modal alignment,\nwhile uncertain ones are annotated to enhance model capabilities. Building upon\nprompt tuning techniques, our methods achieve up to 9% performance gain with 9\ntimes of computational efficiencies. Extensive experiments and analysis across\nvarious backbones, baselines, datasets and adaptation settings demonstrate the\nefficacy of our design.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05432", "categories": ["cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2508.05432", "abs": "https://arxiv.org/abs/2508.05432", "authors": ["Krzysztof Janowicz", "Zilong Liu", "Gengchen Mai", "Zhangyu Wang", "Ivan Majic", "Alexandra Fortacz", "Grant McKenzie", "Song Gao"], "title": "Whose Truth? Pluralistic Geo-Alignment for (Agentic) AI", "comment": null, "summary": "AI (super) alignment describes the challenge of ensuring (future) AI systems\nbehave in accordance with societal norms and goals. While a quickly evolving\nliterature is addressing biases and inequalities, the geographic variability of\nalignment remains underexplored. Simply put, what is considered appropriate,\ntruthful, or legal can differ widely across regions due to cultural norms,\npolitical realities, and legislation. Alignment measures applied to AI/ML\nworkflows can sometimes produce outcomes that diverge from statistical\nrealities, such as text-to-image models depicting balanced gender ratios in\ncompany leadership despite existing imbalances. Crucially, some model outputs\nare globally acceptable, while others, e.g., questions about Kashmir, depend on\nknowing the user's location and their context. This geographic sensitivity is\nnot new. For instance, Google Maps renders Kashmir's borders differently based\non user location. What is new is the unprecedented scale and automation with\nwhich AI now mediates knowledge, expresses opinions, and represents geographic\nreality to millions of users worldwide, often with little transparency about\nhow context is managed. As we approach Agentic AI, the need for\nspatio-temporally aware alignment, rather than one-size-fits-all approaches, is\nincreasingly urgent. This paper reviews key geographic research problems,\nsuggests topics for future work, and outlines methods for assessing alignment\nsensitivity.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05468", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05468", "abs": "https://arxiv.org/abs/2508.05468", "authors": ["Chenzhuo Zhao", "Xinda Wang", "Yue Huang", "Junting Lu", "Ziqian Liu"], "title": "TASE: Token Awareness and Structured Evaluation for Multilingual Language Models", "comment": null, "summary": "While large language models (LLMs) have demonstrated remarkable performance\non high-level semantic tasks, they often struggle with fine-grained,\ntoken-level understanding and structural reasoning--capabilities that are\nessential for applications requiring precision and control. We introduce TASE,\na comprehensive benchmark designed to evaluate LLMs' ability to perceive and\nreason about token-level information across languages. TASE covers 10 tasks\nunder two core categories: token awareness and structural understanding,\nspanning Chinese, English, and Korean, with a 35,927-instance evaluation set\nand a scalable synthetic data generation pipeline for training. Tasks include\ncharacter counting, token alignment, syntactic structure parsing, and length\nconstraint satisfaction. We evaluate over 30 leading commercial and open-source\nLLMs, including O3, Claude 4, Gemini 2.5 Pro, and DeepSeek-R1, and train a\ncustom Qwen2.5-14B model using the GRPO training method. Results show that\nhuman performance significantly outpaces current LLMs, revealing persistent\nweaknesses in token-level reasoning. TASE sheds light on these limitations and\nprovides a new diagnostic lens for future improvements in low-level language\nunderstanding and cross-lingual generalization. Our code and dataset are\npublicly available at https://github.com/cyzcz/Tase .", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "fine-grained"], "score": 4}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05019", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05019", "abs": "https://arxiv.org/abs/2508.05019", "authors": ["Sadia Kamal", "Tim Oates", "Joy Wan"], "title": "Skin-SOAP: A Weakly Supervised Framework for Generating Structured SOAP Notes", "comment": "Accepted to IJCAI 2025 Workshops. arXiv admin note: substantial text\n  overlap with arXiv:2506.10328", "summary": "Skin carcinoma is the most prevalent form of cancer globally, accounting for\nover $8 billion in annual healthcare expenditures. Early diagnosis, accurate\nand timely treatment are critical to improving patient survival rates. In\nclinical settings, physicians document patient visits using detailed SOAP\n(Subjective, Objective, Assessment, and Plan) notes. However, manually\ngenerating these notes is labor-intensive and contributes to clinician burnout.\nIn this work, we propose skin-SOAP, a weakly supervised multimodal framework to\ngenerate clinically structured SOAP notes from limited inputs, including lesion\nimages and sparse clinical text. Our approach reduces reliance on manual\nannotations, enabling scalable, clinically grounded documentation while\nalleviating clinician burden and reducing the need for large annotated data.\nOur method achieves performance comparable to GPT-4o, Claude, and DeepSeek\nJanus Pro across key clinical relevance metrics. To evaluate this clinical\nrelevance, we introduce two novel metrics MedConceptEval and Clinical Coherence\nScore (CCS) which assess semantic alignment with expert medical concepts and\ninput features, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05508", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05508", "abs": "https://arxiv.org/abs/2508.05508", "authors": ["Roshita Bhonsle", "Rishav Dutta", "Sneha Vavilapalli", "Harsh Seth", "Abubakarr Jaye", "Yapei Chang", "Mukund Rungta", "Emmanuel Aboah Boateng", "Sadid Hasan", "Ehi Nosakhare", "Soundar Srinivasan"], "title": "Auto-Eval Judge: Towards a General Agentic Framework for Task Completion Evaluation", "comment": null, "summary": "The increasing adoption of foundation models as agents across diverse domains\nnecessitates a robust evaluation framework. Current methods, such as\nLLM-as-a-Judge, focus only on final outputs, overlooking the step-by-step\nreasoning that drives agentic decision-making. Meanwhile, existing\nAgent-as-a-Judge systems, where one agent evaluates another's task completion,\nare typically designed for narrow, domain-specific settings. To address this\ngap, we propose a generalizable, modular framework for evaluating agent task\ncompletion independent of the task domain. The framework emulates human-like\nevaluation by decomposing tasks into sub-tasks and validating each step using\navailable information, such as the agent's output and reasoning. Each module\ncontributes to a specific aspect of the evaluation process, and their outputs\nare aggregated to produce a final verdict on task completion. We validate our\nframework by evaluating the Magentic-One Actor Agent on two benchmarks, GAIA\nand BigCodeBench. Our Judge Agent predicts task success with closer agreement\nto human evaluations, achieving 4.76% and 10.52% higher alignment accuracy,\nrespectively, compared to the GPT-4o based LLM-as-a-Judge baseline. This\ndemonstrates the potential of our proposed general-purpose evaluation\nframework.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement", "accuracy"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05592", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05592", "abs": "https://arxiv.org/abs/2508.05592", "authors": ["Shaoxiong Zhan", "Yanlin Lai", "Ziyu Lu", "Dahua Lin", "Ziqing Yang", "Fei Tang"], "title": "MathSmith: Towards Extremely Hard Mathematical Reasoning by Forging Synthetic Problems with a Reinforced Policy", "comment": null, "summary": "Large language models have achieved substantial progress in mathematical\nreasoning, yet their advancement is limited by the scarcity of high-quality,\nhigh-difficulty training data. Existing synthesis methods largely rely on\ntransforming human-written templates, limiting both diversity and scalability.\nWe propose MathSmith, a novel framework for synthesizing challenging\nmathematical problems to enhance LLM reasoning. Rather than modifying existing\nproblems, MathSmith constructs new ones from scratch by randomly sampling\nconcept-explanation pairs from PlanetMath, ensuring data independence and\navoiding contamination. To increase difficulty, we design nine predefined\nstrategies as soft constraints during rationales. We further adopts\nreinforcement learning to jointly optimize structural validity, reasoning\ncomplexity, and answer consistency. The length of the reasoning trace generated\nunder autoregressive prompting is used to reflect cognitive complexity,\nencouraging the creation of more demanding problems aligned with\nlong-chain-of-thought reasoning. Experiments across five benchmarks,\ncategorized as easy & medium (GSM8K, MATH-500) and hard (AIME2024, AIME2025,\nOlympiadBench), show that MathSmith consistently outperforms existing baselines\nunder both short and long CoT settings. Additionally, a weakness-focused\nvariant generation module enables targeted improvement on specific concepts.\nOverall, MathSmith exhibits strong scalability, generalization, and\ntransferability, highlighting the promise of high-difficulty synthetic data in\nadvancing LLM reasoning capabilities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "mathematical reasoning"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04825", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.04825", "abs": "https://arxiv.org/abs/2508.04825", "authors": ["Seungyong Lee", "Jeong-gi Kwak"], "title": "Voost: A Unified and Scalable Diffusion Transformer for Bidirectional Virtual Try-On and Try-Off", "comment": "Project page: https://nxnai.github.io/Voost/", "summary": "Virtual try-on aims to synthesize a realistic image of a person wearing a\ntarget garment, but accurately modeling garment-body correspondence remains a\npersistent challenge, especially under pose and appearance variation. In this\npaper, we propose Voost - a unified and scalable framework that jointly learns\nvirtual try-on and try-off with a single diffusion transformer. By modeling\nboth tasks jointly, Voost enables each garment-person pair to supervise both\ndirections and supports flexible conditioning over generation direction and\ngarment category, enhancing garment-body relational reasoning without\ntask-specific networks, auxiliary losses, or additional labels. In addition, we\nintroduce two inference-time techniques: attention temperature scaling for\nrobustness to resolution or mask variation, and self-corrective sampling that\nleverages bidirectional consistency between tasks. Extensive experiments\ndemonstrate that Voost achieves state-of-the-art results on both try-on and\ntry-off benchmarks, consistently outperforming strong baselines in alignment\naccuracy, visual fidelity, and generalization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04826", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.04826", "abs": "https://arxiv.org/abs/2508.04826", "authors": ["Tommaso Tosato", "Saskia Helbling", "Yorguin-Jose Mantilla-Ramos", "Mahmood Hegazy", "Alberto Tosato", "David John Lemay", "Irina Rish", "Guillaume Dumas"], "title": "Persistent Instability in LLM's Personality Measurements: Effects of Scale, Reasoning, and Conversation History", "comment": null, "summary": "Large language models require consistent behavioral patterns for safe\ndeployment, yet their personality-like traits remain poorly understood. We\npresent PERSIST (PERsonality Stability in Synthetic Text), a comprehensive\nevaluation framework testing 25+ open-source models (1B-671B parameters) across\n500,000+ responses. Using traditional (BFI-44, SD3) and novel LLM-adapted\npersonality instruments, we systematically vary question order, paraphrasing,\npersonas, and reasoning modes. Our findings challenge fundamental deployment\nassumptions: (1) Even 400B+ models exhibit substantial response variability (SD\n> 0.4); (2) Minor prompt reordering alone shifts personality measurements by up\nto 20%; (3) Interventions expected to stabilize behavior, such as\nchain-of-thought reasoning, detailed personas instruction, inclusion of\nconversation history, can paradoxically increase variability; (4) LLM-adapted\ninstruments show equal instability to human-centric versions, confirming\narchitectural rather than translational limitations. This persistent\ninstability across scales and mitigation strategies suggests current LLMs lack\nthe foundations for genuine behavioral consistency. For safety-critical\napplications requiring predictable behavior, these findings indicate that\npersonality-based alignment strategies may be fundamentally inadequate.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety", "consistency"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04928", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.04928", "abs": "https://arxiv.org/abs/2508.04928", "authors": ["Suchisrit Gangopadhyay", "Jung-Hee Kim", "Xien Chen", "Patrick Rim", "Hyoungseob Park", "Alex Wong"], "title": "Extending Foundational Monocular Depth Estimators to Fisheye Cameras with Calibration Tokens", "comment": null, "summary": "We propose a method to extend foundational monocular depth estimators\n(FMDEs), trained on perspective images, to fisheye images. Despite being\ntrained on tens of millions of images, FMDEs are susceptible to the covariate\nshift introduced by changes in camera calibration (intrinsic, distortion)\nparameters, leading to erroneous depth estimates. Our method aligns the\ndistribution of latent embeddings encoding fisheye images to those of\nperspective images, enabling the reuse of FMDEs for fisheye cameras without\nretraining or finetuning. To this end, we introduce a set of Calibration Tokens\nas a light-weight adaptation mechanism that modulates the latent embeddings for\nalignment. By exploiting the already expressive latent space of FMDEs, we posit\nthat modulating their embeddings avoids the negative impact of artifacts and\nloss introduced in conventional recalibration or map projection to a canonical\nreference frame in the image space. Our method is self-supervised and does not\nrequire fisheye images but leverages publicly available large-scale perspective\nimage datasets. This is done by recalibrating perspective images to fisheye\nimages, and enforcing consistency between their estimates during training. We\nevaluate our approach with several FMDEs, on both indoors and outdoors, where\nwe consistently improve over state-of-the-art methods using a single set of\ntokens for both. Code available at:\nhttps://github.com/JungHeeKim29/calibration-token.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05167", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.05167", "abs": "https://arxiv.org/abs/2508.05167", "authors": ["Qi Guo", "Xiaojun Jia", "Shanmin Pang", "Simeng Qin", "Lin Wang", "Ju Jia", "Yang Liu", "Qing Guo"], "title": "PhysPatch: A Physically Realizable and Transferable Adversarial Patch Attack for Multimodal Large Language Models-based Autonomous Driving Systems", "comment": null, "summary": "Multimodal Large Language Models (MLLMs) are becoming integral to autonomous\ndriving (AD) systems due to their strong vision-language reasoning\ncapabilities. However, MLLMs are vulnerable to adversarial attacks,\nparticularly adversarial patch attacks, which can pose serious threats in\nreal-world scenarios. Existing patch-based attack methods are primarily\ndesigned for object detection models and perform poorly when transferred to\nMLLM-based systems due to the latter's complex architectures and reasoning\nabilities. To address these limitations, we propose PhysPatch, a physically\nrealizable and transferable adversarial patch framework tailored for MLLM-based\nAD systems. PhysPatch jointly optimizes patch location, shape, and content to\nenhance attack effectiveness and real-world applicability. It introduces a\nsemantic-based mask initialization strategy for realistic placement, an\nSVD-based local alignment loss with patch-guided crop-resize to improve\ntransferability, and a potential field-based mask refinement method. Extensive\nexperiments across open-source, commercial, and reasoning-capable MLLMs\ndemonstrate that PhysPatch significantly outperforms prior methods in steering\nMLLM-based AD systems toward target-aligned perception and planning outputs.\nMoreover, PhysPatch consistently places adversarial patches in physically\nfeasible regions of AD scenes, ensuring strong real-world applicability and\ndeployability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05182", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05182", "abs": "https://arxiv.org/abs/2508.05182", "authors": ["Zhiqing Xiao", "Haobo Wang", "Xu Lu", "Wentao Ye", "Gang Chen", "Junbo Zhao"], "title": "SPA++: Generalized Graph Spectral Alignment for Versatile Domain Adaptation", "comment": "The article has been accepted by Frontiers of Computer Science (FCS),\n  with the DOI: {10.1007/s11704-025-50328-w}. arXiv admin note: text overlap\n  with arXiv:2310.17594", "summary": "Domain Adaptation (DA) aims to transfer knowledge from a labeled source\ndomain to an unlabeled or sparsely labeled target domain under domain shifts.\nMost prior works focus on capturing the inter-domain transferability but\nlargely overlook rich intra-domain structures, which empirically results in\neven worse discriminability. To tackle this tradeoff, we propose a generalized\ngraph SPectral Alignment framework, SPA++. Its core is briefly condensed as\nfollows: (1)-by casting the DA problem to graph primitives, it composes a\ncoarse graph alignment mechanism with a novel spectral regularizer toward\naligning the domain graphs in eigenspaces; (2)-we further develop a\nfine-grained neighbor-aware propagation mechanism for enhanced discriminability\nin the target domain; (3)-by incorporating data augmentation and consistency\nregularization, SPA++ can adapt to complex scenarios including most DA settings\nand even challenging distribution scenarios. Furthermore, we also provide\ntheoretical analysis to support our method, including the generalization bound\nof graph-based DA and the role of spectral alignment and smoothing consistency.\nExtensive experiments on benchmark datasets demonstrate that SPA++ consistently\noutperforms existing cutting-edge methods, achieving superior robustness and\nadaptability across various challenging adaptation scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency", "fine-grained"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05019", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05019", "abs": "https://arxiv.org/abs/2508.05019", "authors": ["Sadia Kamal", "Tim Oates", "Joy Wan"], "title": "Skin-SOAP: A Weakly Supervised Framework for Generating Structured SOAP Notes", "comment": "Accepted to IJCAI 2025 Workshops. arXiv admin note: substantial text\n  overlap with arXiv:2506.10328", "summary": "Skin carcinoma is the most prevalent form of cancer globally, accounting for\nover $8 billion in annual healthcare expenditures. Early diagnosis, accurate\nand timely treatment are critical to improving patient survival rates. In\nclinical settings, physicians document patient visits using detailed SOAP\n(Subjective, Objective, Assessment, and Plan) notes. However, manually\ngenerating these notes is labor-intensive and contributes to clinician burnout.\nIn this work, we propose skin-SOAP, a weakly supervised multimodal framework to\ngenerate clinically structured SOAP notes from limited inputs, including lesion\nimages and sparse clinical text. Our approach reduces reliance on manual\nannotations, enabling scalable, clinically grounded documentation while\nalleviating clinician burden and reducing the need for large annotated data.\nOur method achieves performance comparable to GPT-4o, Claude, and DeepSeek\nJanus Pro across key clinical relevance metrics. To evaluate this clinical\nrelevance, we introduce two novel metrics MedConceptEval and Clinical Coherence\nScore (CCS) which assess semantic alignment with expert medical concepts and\ninput features, respectively.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05615", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05615", "abs": "https://arxiv.org/abs/2508.05615", "authors": ["Yong Du", "Yuchen Yan", "Fei Tang", "Zhengxi Lu", "Chang Zong", "Weiming Lu", "Shengpei Jiang", "Yongliang Shen"], "title": "Test-Time Reinforcement Learning for GUI Grounding via Region Consistency", "comment": "Project Page: https://zju-real.github.io/gui-rcpo Code:\n  https://github.com/zju-real/gui-rcpo", "summary": "Graphical User Interface (GUI) grounding, the task of mapping natural\nlanguage instructions to precise screen coordinates, is fundamental to\nautonomous GUI agents. While existing methods achieve strong performance\nthrough extensive supervised training or reinforcement learning with labeled\nrewards, they remain constrained by the cost and availability of pixel-level\nannotations. We observe that when models generate multiple predictions for the\nsame GUI element, the spatial overlap patterns reveal implicit confidence\nsignals that can guide more accurate localization. Leveraging this insight, we\npropose GUI-RC (Region Consistency), a test-time scaling method that constructs\nspatial voting grids from multiple sampled predictions to identify consensus\nregions where models show highest agreement. Without any training, GUI-RC\nimproves accuracy by 2-3% across various architectures on ScreenSpot\nbenchmarks. We further introduce GUI-RCPO (Region Consistency Policy\nOptimization), which transforms these consistency patterns into rewards for\ntest-time reinforcement learning. By computing how well each prediction aligns\nwith the collective consensus, GUI-RCPO enables models to iteratively refine\ntheir outputs on unlabeled data during inference. Extensive experiments\ndemonstrate the generality of our approach: GUI-RC boosts\nQwen2.5-VL-3B-Instruct from 80.11% to 83.57% on ScreenSpot-v2, while GUI-RCPO\nfurther improves it to 85.14% through self-supervised optimization. Our\napproach reveals the untapped potential of test-time scaling and test-time\nreinforcement learning for GUI grounding, offering a promising path toward more\nrobust and data-efficient GUI agents.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["agreement", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05221", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05221", "abs": "https://arxiv.org/abs/2508.05221", "authors": ["Xiao Wang", "Liye Jin", "Xufeng Lou", "Shiao Wang", "Lan Chen", "Bo Jiang", "Zhipeng Zhang"], "title": "ReasoningTrack: Chain-of-Thought Reasoning for Long-term Vision-Language Tracking", "comment": null, "summary": "Vision-language tracking has received increasing attention in recent years,\nas textual information can effectively address the inflexibility and inaccuracy\nassociated with specifying the target object to be tracked. Existing works\neither directly fuse the fixed language with vision features or simply modify\nusing attention, however, their performance is still limited. Recently, some\nresearchers have explored using text generation to adapt to the variations in\nthe target during tracking, however, these works fail to provide insights into\nthe model's reasoning process and do not fully leverage the advantages of large\nmodels, which further limits their overall performance. To address the\naforementioned issues, this paper proposes a novel reasoning-based\nvision-language tracking framework, named ReasoningTrack, based on a\npre-trained vision-language model Qwen2.5-VL. Both SFT (Supervised Fine-Tuning)\nand reinforcement learning GRPO are used for the optimization of reasoning and\nlanguage generation. We embed the updated language descriptions and feed them\ninto a unified tracking backbone network together with vision features. Then,\nwe adopt a tracking head to predict the specific location of the target object.\nIn addition, we propose a large-scale long-term vision-language tracking\nbenchmark dataset, termed TNLLT, which contains 200 video sequences. 20\nbaseline visual trackers are re-trained and evaluated on this dataset, which\nbuilds a solid foundation for the vision-language visual tracking task.\nExtensive experiments on multiple vision-language tracking benchmark datasets\nfully validated the effectiveness of our proposed reasoning-based natural\nlanguage generation strategy. The source code of this paper will be released on\nhttps://github.com/Event-AHU/Open_VLTrack", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05236", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.05236", "abs": "https://arxiv.org/abs/2508.05236", "authors": ["Yatong Lan", "Jingfeng Chen", "Yiru Wang", "Lei He"], "title": "ArbiViewGen: Controllable Arbitrary Viewpoint Camera Data Generation for Autonomous Driving via Stable Diffusion Models", "comment": "11 pages, 6 figures", "summary": "Arbitrary viewpoint image generation holds significant potential for\nautonomous driving, yet remains a challenging task due to the lack of\nground-truth data for extrapolated views, which hampers the training of\nhigh-fidelity generative models. In this work, we propose Arbiviewgen, a novel\ndiffusion-based framework for the generation of controllable camera images from\narbitrary points of view. To address the absence of ground-truth data in unseen\nviews, we introduce two key components: Feature-Aware Adaptive View Stitching\n(FAVS) and Cross-View Consistency Self-Supervised Learning (CVC-SSL). FAVS\nemploys a hierarchical matching strategy that first establishes coarse\ngeometric correspondences using camera poses, then performs fine-grained\nalignment through improved feature matching algorithms, and identifies\nhigh-confidence matching regions via clustering analysis. Building upon this,\nCVC-SSL adopts a self-supervised training paradigm where the model reconstructs\nthe original camera views from the synthesized stitched images using a\ndiffusion model, enforcing cross-view consistency without requiring supervision\nfrom extrapolated data. Our framework requires only multi-camera images and\ntheir associated poses for training, eliminating the need for additional\nsensors or depth maps. To our knowledge, Arbiviewgen is the first method\ncapable of controllable arbitrary view camera image generation in multiple\nvehicle configurations.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "fine-grained"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05237", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05237", "abs": "https://arxiv.org/abs/2508.05237", "authors": ["Zane Xu", "Jason Sun"], "title": "Navigating the Trade-off: A Synthesis of Defensive Strategies for Zero-Shot Adversarial Robustness in Vision-Language Models", "comment": null, "summary": "This report synthesizes eight seminal papers on the zero-shot adversarial\nrobustness of vision-language models (VLMs) like CLIP. A central challenge in\nthis domain is the inherent trade-off between enhancing adversarial robustness\nand preserving the model's zero-shot generalization capabilities. We analyze\ntwo primary defense paradigms: Adversarial Fine-Tuning (AFT), which modifies\nmodel parameters, and Training-Free/Test-Time Defenses, which preserve them. We\ntrace the evolution from alignment-preserving methods (TeCoA) to embedding\nspace re-engineering (LAAT, TIMA), and from input heuristics (AOM, TTC) to\nlatent-space purification (CLIPure). Finally, we identify key challenges and\nfuture directions including hybrid defense strategies and adversarial\npre-training.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05132", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05132", "abs": "https://arxiv.org/abs/2508.05132", "authors": ["Chang Hong", "Minghao Wu", "Qingying Xiao", "Yuchi Wang", "Xiang Wan", "Guangjun Yu", "Benyou Wang", "Yan Hu"], "title": "Towards Assessing Medical Ethics from Knowledge to Practice", "comment": null, "summary": "The integration of large language models into healthcare necessitates a\nrigorous evaluation of their ethical reasoning, an area current benchmarks\noften overlook. We introduce PrinciplismQA, a comprehensive benchmark with\n3,648 questions designed to systematically assess LLMs' alignment with core\nmedical ethics. Grounded in Principlism, our benchmark features a high-quality\ndataset. This includes multiple-choice questions curated from authoritative\ntextbooks and open-ended questions sourced from authoritative medical ethics\ncase study literature, all validated by medical experts. Our experiments reveal\na significant gap between models' ethical knowledge and their practical\napplication, especially in dynamically applying ethical principles to\nreal-world scenarios. Most LLMs struggle with dilemmas concerning Beneficence,\noften over-emphasizing other principles. Frontier closed-source models, driven\nby strong general capabilities, currently lead the benchmark. Notably, medical\ndomain fine-tuning can enhance models' overall ethical competence, but further\nprogress requires better alignment with medical ethical knowledge.\nPrinciplismQA offers a scalable framework to diagnose these specific ethical\nweaknesses, paving the way for more balanced and responsible medical AI.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05244", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05244", "abs": "https://arxiv.org/abs/2508.05244", "authors": ["Tianchen Fang", "Guiru Liu"], "title": "RegionMed-CLIP: A Region-Aware Multimodal Contrastive Learning Pre-trained Model for Medical Image Understanding", "comment": null, "summary": "Medical image understanding plays a crucial role in enabling automated\ndiagnosis and data-driven clinical decision support. However, its progress is\nimpeded by two primary challenges: the limited availability of high-quality\nannotated medical data and an overreliance on global image features, which\noften miss subtle but clinically significant pathological regions. To address\nthese issues, we introduce RegionMed-CLIP, a region-aware multimodal\ncontrastive learning framework that explicitly incorporates localized\npathological signals along with holistic semantic representations. The core of\nour method is an innovative region-of-interest (ROI) processor that adaptively\nintegrates fine-grained regional features with the global context, supported by\na progressive training strategy that enhances hierarchical multimodal\nalignment. To enable large-scale region-level representation learning, we\nconstruct MedRegion-500k, a comprehensive medical image-text corpus that\nfeatures extensive regional annotations and multilevel clinical descriptions.\nExtensive experiments on image-text retrieval, zero-shot classification, and\nvisual question answering tasks demonstrate that RegionMed-CLIP consistently\nexceeds state-of-the-art vision language models by a wide margin. Our results\nhighlight the critical importance of region-aware contrastive pre-training and\nposition RegionMed-CLIP as a robust foundation for advancing multimodal medical\nimage understanding.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering", "fine-grained"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05221", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05221", "abs": "https://arxiv.org/abs/2508.05221", "authors": ["Xiao Wang", "Liye Jin", "Xufeng Lou", "Shiao Wang", "Lan Chen", "Bo Jiang", "Zhipeng Zhang"], "title": "ReasoningTrack: Chain-of-Thought Reasoning for Long-term Vision-Language Tracking", "comment": null, "summary": "Vision-language tracking has received increasing attention in recent years,\nas textual information can effectively address the inflexibility and inaccuracy\nassociated with specifying the target object to be tracked. Existing works\neither directly fuse the fixed language with vision features or simply modify\nusing attention, however, their performance is still limited. Recently, some\nresearchers have explored using text generation to adapt to the variations in\nthe target during tracking, however, these works fail to provide insights into\nthe model's reasoning process and do not fully leverage the advantages of large\nmodels, which further limits their overall performance. To address the\naforementioned issues, this paper proposes a novel reasoning-based\nvision-language tracking framework, named ReasoningTrack, based on a\npre-trained vision-language model Qwen2.5-VL. Both SFT (Supervised Fine-Tuning)\nand reinforcement learning GRPO are used for the optimization of reasoning and\nlanguage generation. We embed the updated language descriptions and feed them\ninto a unified tracking backbone network together with vision features. Then,\nwe adopt a tracking head to predict the specific location of the target object.\nIn addition, we propose a large-scale long-term vision-language tracking\nbenchmark dataset, termed TNLLT, which contains 200 video sequences. 20\nbaseline visual trackers are re-trained and evaluated on this dataset, which\nbuilds a solid foundation for the vision-language visual tracking task.\nExtensive experiments on multiple vision-language tracking benchmark datasets\nfully validated the effectiveness of our proposed reasoning-based natural\nlanguage generation strategy. The source code of this paper will be released on\nhttps://github.com/Event-AHU/Open_VLTrack", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05237", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05237", "abs": "https://arxiv.org/abs/2508.05237", "authors": ["Zane Xu", "Jason Sun"], "title": "Navigating the Trade-off: A Synthesis of Defensive Strategies for Zero-Shot Adversarial Robustness in Vision-Language Models", "comment": null, "summary": "This report synthesizes eight seminal papers on the zero-shot adversarial\nrobustness of vision-language models (VLMs) like CLIP. A central challenge in\nthis domain is the inherent trade-off between enhancing adversarial robustness\nand preserving the model's zero-shot generalization capabilities. We analyze\ntwo primary defense paradigms: Adversarial Fine-Tuning (AFT), which modifies\nmodel parameters, and Training-Free/Test-Time Defenses, which preserve them. We\ntrace the evolution from alignment-preserving methods (TeCoA) to embedding\nspace re-engineering (LAAT, TIMA), and from input heuristics (AOM, TTC) to\nlatent-space purification (CLIPure). Finally, we identify key challenges and\nfuture directions including hybrid defense strategies and adversarial\npre-training.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05244", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2508.05244", "abs": "https://arxiv.org/abs/2508.05244", "authors": ["Tianchen Fang", "Guiru Liu"], "title": "RegionMed-CLIP: A Region-Aware Multimodal Contrastive Learning Pre-trained Model for Medical Image Understanding", "comment": null, "summary": "Medical image understanding plays a crucial role in enabling automated\ndiagnosis and data-driven clinical decision support. However, its progress is\nimpeded by two primary challenges: the limited availability of high-quality\nannotated medical data and an overreliance on global image features, which\noften miss subtle but clinically significant pathological regions. To address\nthese issues, we introduce RegionMed-CLIP, a region-aware multimodal\ncontrastive learning framework that explicitly incorporates localized\npathological signals along with holistic semantic representations. The core of\nour method is an innovative region-of-interest (ROI) processor that adaptively\nintegrates fine-grained regional features with the global context, supported by\na progressive training strategy that enhances hierarchical multimodal\nalignment. To enable large-scale region-level representation learning, we\nconstruct MedRegion-500k, a comprehensive medical image-text corpus that\nfeatures extensive regional annotations and multilevel clinical descriptions.\nExtensive experiments on image-text retrieval, zero-shot classification, and\nvisual question answering tasks demonstrate that RegionMed-CLIP consistently\nexceeds state-of-the-art vision language models by a wide margin. Our results\nhighlight the critical importance of region-aware contrastive pre-training and\nposition RegionMed-CLIP as a robust foundation for advancing multimodal medical\nimage understanding.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering", "fine-grained"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05399", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05399", "abs": "https://arxiv.org/abs/2508.05399", "authors": ["Wonjun Kang", "Byeongkeun Ahn", "Minjae Lee", "Kevin Galim", "Seunghyuk Oh", "Hyung Il Koo", "Nam Ik Cho"], "title": "UNCAGE: Contrastive Attention Guidance for Masked Generative Transformers in Text-to-Image Generation", "comment": "Code is available at https://github.com/furiosa-ai/uncage", "summary": "Text-to-image (T2I) generation has been actively studied using Diffusion\nModels and Autoregressive Models. Recently, Masked Generative Transformers have\ngained attention as an alternative to Autoregressive Models to overcome the\ninherent limitations of causal attention and autoregressive decoding through\nbidirectional attention and parallel decoding, enabling efficient and\nhigh-quality image generation. However, compositional T2I generation remains\nchallenging, as even state-of-the-art Diffusion Models often fail to accurately\nbind attributes and achieve proper text-image alignment. While Diffusion Models\nhave been extensively studied for this issue, Masked Generative Transformers\nexhibit similar limitations but have not been explored in this context. To\naddress this, we propose Unmasking with Contrastive Attention Guidance\n(UNCAGE), a novel training-free method that improves compositional fidelity by\nleveraging attention maps to prioritize the unmasking of tokens that clearly\nrepresent individual objects. UNCAGE consistently improves performance in both\nquantitative and qualitative evaluations across multiple benchmarks and\nmetrics, with negligible inference overhead. Our code is available at\nhttps://github.com/furiosa-ai/uncage.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05399", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.05399", "abs": "https://arxiv.org/abs/2508.05399", "authors": ["Wonjun Kang", "Byeongkeun Ahn", "Minjae Lee", "Kevin Galim", "Seunghyuk Oh", "Hyung Il Koo", "Nam Ik Cho"], "title": "UNCAGE: Contrastive Attention Guidance for Masked Generative Transformers in Text-to-Image Generation", "comment": "Code is available at https://github.com/furiosa-ai/uncage", "summary": "Text-to-image (T2I) generation has been actively studied using Diffusion\nModels and Autoregressive Models. Recently, Masked Generative Transformers have\ngained attention as an alternative to Autoregressive Models to overcome the\ninherent limitations of causal attention and autoregressive decoding through\nbidirectional attention and parallel decoding, enabling efficient and\nhigh-quality image generation. However, compositional T2I generation remains\nchallenging, as even state-of-the-art Diffusion Models often fail to accurately\nbind attributes and achieve proper text-image alignment. While Diffusion Models\nhave been extensively studied for this issue, Masked Generative Transformers\nexhibit similar limitations but have not been explored in this context. To\naddress this, we propose Unmasking with Contrastive Attention Guidance\n(UNCAGE), a novel training-free method that improves compositional fidelity by\nleveraging attention maps to prioritize the unmasking of tokens that clearly\nrepresent individual objects. UNCAGE consistently improves performance in both\nquantitative and qualitative evaluations across multiple benchmarks and\nmetrics, with negligible inference overhead. Our code is available at\nhttps://github.com/furiosa-ai/uncage.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05489", "categories": ["cs.CV", "cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2508.05489", "abs": "https://arxiv.org/abs/2508.05489", "authors": ["Samuel Räber", "Till Aczel", "Andreas Plesner", "Roger Wattenhofer"], "title": "Keep It Real: Challenges in Attacking Compression-Based Adversarial Purification", "comment": null, "summary": "Previous work has suggested that preprocessing images through lossy\ncompression can defend against adversarial perturbations, but comprehensive\nattack evaluations have been lacking. In this paper, we construct strong\nwhite-box and adaptive attacks against various compression models and identify\na critical challenge for attackers: high realism in reconstructed images\nsignificantly increases attack difficulty. Through rigorous evaluation across\nmultiple attack scenarios, we demonstrate that compression models capable of\nproducing realistic, high-fidelity reconstructions are substantially more\nresistant to our attacks. In contrast, low-realism compression models can be\nbroken. Our analysis reveals that this is not due to gradient masking. Rather,\nrealistic reconstructions maintaining distributional alignment with natural\nimages seem to offer inherent robustness. This work highlights a significant\nobstacle for future adversarial attacks and suggests that developing more\neffective techniques to overcome realism represents an essential challenge for\ncomprehensive security evaluation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05615", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05615", "abs": "https://arxiv.org/abs/2508.05615", "authors": ["Yong Du", "Yuchen Yan", "Fei Tang", "Zhengxi Lu", "Chang Zong", "Weiming Lu", "Shengpei Jiang", "Yongliang Shen"], "title": "Test-Time Reinforcement Learning for GUI Grounding via Region Consistency", "comment": "Project Page: https://zju-real.github.io/gui-rcpo Code:\n  https://github.com/zju-real/gui-rcpo", "summary": "Graphical User Interface (GUI) grounding, the task of mapping natural\nlanguage instructions to precise screen coordinates, is fundamental to\nautonomous GUI agents. While existing methods achieve strong performance\nthrough extensive supervised training or reinforcement learning with labeled\nrewards, they remain constrained by the cost and availability of pixel-level\nannotations. We observe that when models generate multiple predictions for the\nsame GUI element, the spatial overlap patterns reveal implicit confidence\nsignals that can guide more accurate localization. Leveraging this insight, we\npropose GUI-RC (Region Consistency), a test-time scaling method that constructs\nspatial voting grids from multiple sampled predictions to identify consensus\nregions where models show highest agreement. Without any training, GUI-RC\nimproves accuracy by 2-3% across various architectures on ScreenSpot\nbenchmarks. We further introduce GUI-RCPO (Region Consistency Policy\nOptimization), which transforms these consistency patterns into rewards for\ntest-time reinforcement learning. By computing how well each prediction aligns\nwith the collective consensus, GUI-RCPO enables models to iteratively refine\ntheir outputs on unlabeled data during inference. Extensive experiments\ndemonstrate the generality of our approach: GUI-RC boosts\nQwen2.5-VL-3B-Instruct from 80.11% to 83.57% on ScreenSpot-v2, while GUI-RCPO\nfurther improves it to 85.14% through self-supervised optimization. Our\napproach reveals the untapped potential of test-time scaling and test-time\nreinforcement learning for GUI grounding, offering a promising path toward more\nrobust and data-efficient GUI agents.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["agreement", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05602", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2508.05602", "abs": "https://arxiv.org/abs/2508.05602", "authors": ["Tao Sun", "Oliver Liu", "JinJin Li", "Lan Ma"], "title": "LLaVA-RE: Binary Image-Text Relevancy Evaluation with Multimodal Large Language Model", "comment": "Published in the First Workshop of Evaluation of Multi-Modal\n  Generation 2025", "summary": "Multimodal generative AI usually involves generating image or text responses\ngiven inputs in another modality. The evaluation of image-text relevancy is\nessential for measuring response quality or ranking candidate responses. In\nparticular, binary relevancy evaluation, i.e., ``Relevant'' vs. ``Not\nRelevant'', is a fundamental problem. However, this is a challenging task\nconsidering that texts have diverse formats and the definition of relevancy\nvaries in different scenarios. We find that Multimodal Large Language Models\n(MLLMs) are an ideal choice to build such evaluators, as they can flexibly\nhandle complex text formats and take in additional task information. In this\npaper, we present LLaVA-RE, a first attempt for binary image-text relevancy\nevaluation with MLLM. It follows the LLaVA architecture and adopts detailed\ntask instructions and multimodal in-context samples. In addition, we propose a\nnovel binary relevancy data set that covers various tasks. Experimental results\nvalidate the effectiveness of our framework.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.05615", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2508.05615", "abs": "https://arxiv.org/abs/2508.05615", "authors": ["Yong Du", "Yuchen Yan", "Fei Tang", "Zhengxi Lu", "Chang Zong", "Weiming Lu", "Shengpei Jiang", "Yongliang Shen"], "title": "Test-Time Reinforcement Learning for GUI Grounding via Region Consistency", "comment": "Project Page: https://zju-real.github.io/gui-rcpo Code:\n  https://github.com/zju-real/gui-rcpo", "summary": "Graphical User Interface (GUI) grounding, the task of mapping natural\nlanguage instructions to precise screen coordinates, is fundamental to\nautonomous GUI agents. While existing methods achieve strong performance\nthrough extensive supervised training or reinforcement learning with labeled\nrewards, they remain constrained by the cost and availability of pixel-level\nannotations. We observe that when models generate multiple predictions for the\nsame GUI element, the spatial overlap patterns reveal implicit confidence\nsignals that can guide more accurate localization. Leveraging this insight, we\npropose GUI-RC (Region Consistency), a test-time scaling method that constructs\nspatial voting grids from multiple sampled predictions to identify consensus\nregions where models show highest agreement. Without any training, GUI-RC\nimproves accuracy by 2-3% across various architectures on ScreenSpot\nbenchmarks. We further introduce GUI-RCPO (Region Consistency Policy\nOptimization), which transforms these consistency patterns into rewards for\ntest-time reinforcement learning. By computing how well each prediction aligns\nwith the collective consensus, GUI-RCPO enables models to iteratively refine\ntheir outputs on unlabeled data during inference. Extensive experiments\ndemonstrate the generality of our approach: GUI-RC boosts\nQwen2.5-VL-3B-Instruct from 80.11% to 83.57% on ScreenSpot-v2, while GUI-RCPO\nfurther improves it to 85.14% through self-supervised optimization. Our\napproach reveals the untapped potential of test-time scaling and test-time\nreinforcement learning for GUI grounding, offering a promising path toward more\nrobust and data-efficient GUI agents.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["agreement", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-08-08.jsonl"}
{"id": "2508.04825", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2508.04825", "abs": "https://arxiv.org/abs/2508.04825", "authors": ["Seungyong Lee", "Jeong-gi Kwak"], "title": "Voost: A Unified and Scalable Diffusion Transformer for Bidirectional Virtual Try-On and Try-Off", "comment": "Project page: https://nxnai.github.io/Voost/", "summary": "Virtual try-on aims to synthesize a realistic image of a person wearing a\ntarget garment, but accurately modeling garment-body correspondence remains a\npersistent challenge, especially under pose and appearance variation. In this\npaper, we propose Voost - a unified and scalable framework that jointly learns\nvirtual try-on and try-off with a single diffusion transformer. By modeling\nboth tasks jointly, Voost enables each garment-person pair to supervise both\ndirections and supports flexible conditioning over generation direction and\ngarment category, enhancing garment-body relational reasoning without\ntask-specific networks, auxiliary losses, or additional labels. In addition, we\nintroduce two inference-time techniques: attention temperature scaling for\nrobustness to resolution or mask variation, and self-corrective sampling that\nleverages bidirectional consistency between tasks. Extensive experiments\ndemonstrate that Voost achieves state-of-the-art results on both try-on and\ntry-off benchmarks, consistently outperforming strong baselines in alignment\naccuracy, visual fidelity, and generalization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-08-08.jsonl"}
