{"id": "2505.01706", "pdf": "https://arxiv.org/pdf/2505.01706", "abs": "https://arxiv.org/abs/2505.01706", "authors": ["Sarvesh Shashidhar", "Ritik", "Nachiketa Patil", "Suraj Racha", "Ganesh Ramakrishnan"], "title": "Inducing Robustness in a 2 Dimensional Direct Preference Optimization Paradigm", "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": "Updated abstract, algorithm and experimental results", "summary": "Direct Preference Optimisation (DPO) has emerged as a powerful method for\naligning Large Language Models (LLMs) with human preferences, offering a stable\nand efficient alternative to approaches that use Reinforcement learning via\nHuman Feedback. In this work, we investigate the performance of DPO using\nopen-source preference datasets. One of the major drawbacks of DPO is that it\ndoesn't induce granular scoring and treats all the segments of the responses\nwith equal propensity. However, this is not practically true for human\npreferences since even \"good\" responses have segments that may not be preferred\nby the annotator. To resolve this, a 2-dimensional scoring for DPO alignment\ncalled 2D-DPO was proposed. We explore the 2D-DPO alignment paradigm and the\nadvantages it provides over the standard DPO by comparing their win rates. It\nis observed that these methods, even though effective, are not robust to\nlabel/score noise. To counter this, we propose an approach of incorporating\nsegment-level score noise robustness to the 2D-DPO algorithm. Along with\ntheoretical backing, we also provide empirical verification in favour of the\nalgorithm and introduce other noise models that can be present.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["human feedback", "reinforcement learning", "preference", "alignment", "DPO", "direct preference optimization"], "score": 6}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02363", "pdf": "https://arxiv.org/pdf/2505.02363", "abs": "https://arxiv.org/abs/2505.02363", "authors": ["Tianjian Li", "Daniel Khashabi"], "title": "SIMPLEMIX: Frustratingly Simple Mixing of Off- and On-policy Data in Language Model Preference Learning", "categories": ["cs.CL"], "comment": "To appear in ICML 2025", "summary": "Aligning language models with human preferences relies on pairwise preference\ndatasets. While some studies suggest that on-policy data consistently\noutperforms off -policy data for preference learning, others indicate that the\nadvantages of on-policy data may be task-dependent, highlighting the need for a\nsystematic exploration of their interplay.\n  In this work, we show that on-policy and off-policy data offer complementary\nstrengths in preference optimization: on-policy data is particularly effective\nfor reasoning tasks like math and coding, while off-policy data performs better\non open-ended tasks such as creative writing and making personal\nrecommendations. Guided by these findings, we introduce SIMPLEMIX, an approach\nto combine the complementary strengths of on-policy and off-policy preference\nlearning by simply mixing these two data sources. Our empirical results across\ndiverse tasks and benchmarks demonstrate that SIMPLEMIX substantially improves\nlanguage model alignment. Specifically, SIMPLEMIX improves upon on-policy DPO\nand off-policy DPO by an average of 6.03% on Alpaca Eval 2.0. Moreover, it\noutperforms prior approaches that are much more complex in combining on- and\noff-policy data, such as HyPO and DPO-Mix-P, by an average of 3.05%.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference learning", "preference", "pairwise", "alignment", "DPO"], "score": 5}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["Alpaca"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02142", "pdf": "https://arxiv.org/pdf/2505.02142", "abs": "https://arxiv.org/abs/2505.02142", "authors": ["Xiaoyu Tian", "Sitong Zhao", "Haotian Wang", "Shuaiting Chen", "Yiping Peng", "Yunjie Ji", "Han Zhao", "Xiangang Li"], "title": "Exploring the Potential of Offline RL for Reasoning in LLMs: A Preliminary Study", "categories": ["cs.CL"], "comment": null, "summary": "Despite significant advances in long-context reasoning by large language\nmodels (LLMs), primarily through Online Reinforcement Learning (RL) methods,\nthese approaches incur substantial computational costs and complexity. In\ncontrast, simpler and more economical Offline RL methods remain underexplored.\nTo address this gap, we investigate the effectiveness of Offline RL methods,\nspecifically Direct Preference Optimization (DPO) and its length-desensitized\nvariant LD-DPO, in enhancing the reasoning capabilities of LLMs. Extensive\nexperiments across multiple reasoning benchmarks demonstrate that these simpler\nOffline RL methods substantially improve model performance, achieving an\naverage enhancement of 3.3\\%, with a particularly notable increase of 10.1\\% on\nthe challenging Arena-Hard benchmark. Furthermore, we analyze DPO's sensitivity\nto output length, emphasizing that increasing reasoning length should align\nwith semantic richness, as indiscriminate lengthening may adversely affect\nmodel performance. We provide comprehensive descriptions of our data processing\nand training methodologies, offering empirical evidence and practical insights\nfor developing more cost-effective Offline RL approaches.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "preference", "DPO", "direct preference optimization"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02387", "pdf": "https://arxiv.org/pdf/2505.02387", "abs": "https://arxiv.org/abs/2505.02387", "authors": ["Xiusi Chen", "Gaotang Li", "Ziqi Wang", "Bowen Jin", "Cheng Qian", "Yu Wang", "Hongru Wang", "Yu Zhang", "Denghui Zhang", "Tong Zhang", "Hanghang Tong", "Heng Ji"], "title": "RM-R1: Reward Modeling as Reasoning", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "23 pages, 7 figures", "summary": "Reward modeling is essential for aligning large language models (LLMs) with\nhuman preferences, especially through reinforcement learning from human\nfeedback (RLHF). To provide accurate reward signals, a reward model (RM) should\nstimulate deep thinking and conduct interpretable reasoning before assigning a\nscore or a judgment. However, existing RMs either produce opaque scalar scores\nor directly generate the prediction of a preferred answer, making them struggle\nto integrate natural language critiques, thus lacking interpretability.\nInspired by recent advances of long chain-of-thought (CoT) on\nreasoning-intensive tasks, we hypothesize and validate that integrating\nreasoning capabilities into reward modeling significantly enhances RM's\ninterpretability and performance. In this work, we introduce a new class of\ngenerative reward models -- Reasoning Reward Models (ReasRMs) -- which\nformulate reward modeling as a reasoning task. We propose a reasoning-oriented\ntraining pipeline and train a family of ReasRMs, RM-R1. The training consists\nof two key stages: (1) distillation of high-quality reasoning chains and (2)\nreinforcement learning with verifiable rewards. RM-R1 improves LLM rollouts by\nself-generating reasoning traces or chat-specific rubrics and evaluating\ncandidate responses against them. Empirically, our models achieve\nstate-of-the-art or near state-of-the-art performance of generative RMs across\nmultiple comprehensive reward model benchmarks, outperforming much larger\nopen-weight models (e.g., Llama3.1-405B) and proprietary ones (e.g., GPT-4o) by\nup to 13.8%. Beyond final performance, we perform thorough empirical analysis\nto understand the key ingredients of successful ReasRM training. To facilitate\nfuture research, we release six ReasRM models along with code and data at\nhttps://github.com/RM-R1-UIUC/RM-R1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "RLHF", "reinforcement learning"], "score": 4}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02835", "pdf": "https://arxiv.org/pdf/2505.02835", "abs": "https://arxiv.org/abs/2505.02835", "authors": ["Yi-Fan Zhang", "Xingyu Lu", "Xiao Hu", "Chaoyou Fu", "Bin Wen", "Tianke Zhang", "Changyi Liu", "Kaiyu Jiang", "Kaibing Chen", "Kaiyu Tang", "Haojie Ding", "Jiankang Chen", "Fan Yang", "Zhang Zhang", "Tingting Gao", "Liang Wang"], "title": "R1-Reward: Training Multimodal Reward Model Through Stable Reinforcement Learning", "categories": ["cs.CV", "cs.CL"], "comment": "Home page: https://github.com/yfzhang114/r1_reward", "summary": "Multimodal Reward Models (MRMs) play a crucial role in enhancing the\nperformance of Multimodal Large Language Models (MLLMs). While recent\nadvancements have primarily focused on improving the model structure and\ntraining data of MRMs, there has been limited exploration into the\neffectiveness of long-term reasoning capabilities for reward modeling and how\nto activate these capabilities in MRMs. In this paper, we explore how\nReinforcement Learning (RL) can be used to improve reward modeling.\nSpecifically, we reformulate the reward modeling problem as a rule-based RL\ntask. However, we observe that directly applying existing RL algorithms, such\nas Reinforce++, to reward modeling often leads to training instability or even\ncollapse due to the inherent limitations of these algorithms. To address this\nissue, we propose the StableReinforce algorithm, which refines the training\nloss, advantage estimation strategy, and reward design of existing RL methods.\nThese refinements result in more stable training dynamics and superior\nperformance. To facilitate MRM training, we collect 200K preference data from\ndiverse datasets. Our reward model, R1-Reward, trained using the\nStableReinforce algorithm on this dataset, significantly improves performance\non multimodal reward modeling benchmarks. Compared to previous SOTA models,\nR1-Reward achieves a $8.4\\%$ improvement on the VL Reward-Bench and a $14.3\\%$\nimprovement on the Multimodal Reward Bench. Moreover, with more inference\ncompute, R1-Reward's performance is further enhanced, highlighting the\npotential of RL algorithms in optimizing MRMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "reinforcement learning", "preference"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02835", "pdf": "https://arxiv.org/pdf/2505.02835", "abs": "https://arxiv.org/abs/2505.02835", "authors": ["Yi-Fan Zhang", "Xingyu Lu", "Xiao Hu", "Chaoyou Fu", "Bin Wen", "Tianke Zhang", "Changyi Liu", "Kaiyu Jiang", "Kaibing Chen", "Kaiyu Tang", "Haojie Ding", "Jiankang Chen", "Fan Yang", "Zhang Zhang", "Tingting Gao", "Liang Wang"], "title": "R1-Reward: Training Multimodal Reward Model Through Stable Reinforcement Learning", "categories": ["cs.CV", "cs.CL"], "comment": "Home page: https://github.com/yfzhang114/r1_reward", "summary": "Multimodal Reward Models (MRMs) play a crucial role in enhancing the\nperformance of Multimodal Large Language Models (MLLMs). While recent\nadvancements have primarily focused on improving the model structure and\ntraining data of MRMs, there has been limited exploration into the\neffectiveness of long-term reasoning capabilities for reward modeling and how\nto activate these capabilities in MRMs. In this paper, we explore how\nReinforcement Learning (RL) can be used to improve reward modeling.\nSpecifically, we reformulate the reward modeling problem as a rule-based RL\ntask. However, we observe that directly applying existing RL algorithms, such\nas Reinforce++, to reward modeling often leads to training instability or even\ncollapse due to the inherent limitations of these algorithms. To address this\nissue, we propose the StableReinforce algorithm, which refines the training\nloss, advantage estimation strategy, and reward design of existing RL methods.\nThese refinements result in more stable training dynamics and superior\nperformance. To facilitate MRM training, we collect 200K preference data from\ndiverse datasets. Our reward model, R1-Reward, trained using the\nStableReinforce algorithm on this dataset, significantly improves performance\non multimodal reward modeling benchmarks. Compared to previous SOTA models,\nR1-Reward achieves a $8.4\\%$ improvement on the VL Reward-Bench and a $14.3\\%$\nimprovement on the Multimodal Reward Bench. Moreover, with more inference\ncompute, R1-Reward's performance is further enhanced, highlighting the\npotential of RL algorithms in optimizing MRMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "reinforcement learning", "preference"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02666", "pdf": "https://arxiv.org/pdf/2505.02666", "abs": "https://arxiv.org/abs/2505.02666", "authors": ["Miaomiao Ji", "Yanqiu Wu", "Zhibin Wu", "Shoujin Wang", "Jian Yang", "Mark Dras", "Usman Naseem"], "title": "A Survey on Progress in LLM Alignment from the Perspective of Reward Design", "categories": ["cs.CL"], "comment": "Preprint", "summary": "The alignment of large language models (LLMs) with human values and\nintentions represents a core challenge in current AI research, where reward\nmechanism design has become a critical factor in shaping model behavior. This\nstudy conducts a comprehensive investigation of reward mechanisms in LLM\nalignment through a systematic theoretical framework, categorizing their\ndevelopment into three key phases: (1) feedback (diagnosis), (2) reward design\n(prescription), and (3) optimization (treatment). Through a four-dimensional\nanalysis encompassing construction basis, format, expression, and granularity,\nthis research establishes a systematic classification framework that reveals\nevolutionary trends in reward modeling. The field of LLM alignment faces\nseveral persistent challenges, while recent advances in reward design are\ndriving significant paradigm shifts. Notable developments include the\ntransition from reinforcement learning-based frameworks to novel optimization\nparadigms, as well as enhanced capabilities to address complex alignment\nscenarios involving multimodal integration and concurrent task coordination.\nFinally, this survey outlines promising future research directions for LLM\nalignment through innovative reward design strategies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward modeling", "reinforcement learning", "alignment"], "score": 3}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01435", "pdf": "https://arxiv.org/pdf/2505.01435", "abs": "https://arxiv.org/abs/2505.01435", "authors": ["Carlo Siebenschuh", "Kyle Hippe", "Ozan Gokdemir", "Alexander Brace", "Arham Khan", "Khalid Hossain", "Yadu Babuji", "Nicholas Chia", "Venkatram Vishwanath", "Rick Stevens", "Arvind Ramanathan", "Ian Foster", "Robert Underwood"], "title": "AdaParse: An Adaptive Parallel PDF Parsing and Resource Scaling Engine", "categories": ["cs.IR", "cs.CL", "cs.DC", "cs.LG"], "comment": "This paper has been accepted at the The Eighth Annual Conference on\n  Machine Learning and Systems (MLSys 2025)", "summary": "Language models for scientific tasks are trained on text from scientific\npublications, most distributed as PDFs that require parsing. PDF parsing\napproaches range from inexpensive heuristics (for simple documents) to\ncomputationally intensive ML-driven systems (for complex or degraded ones). The\nchoice of the \"best\" parser for a particular document depends on its\ncomputational cost and the accuracy of its output. To address these issues, we\nintroduce an Adaptive Parallel PDF Parsing and Resource Scaling Engine\n(AdaParse), a data-driven strategy for assigning an appropriate parser to each\ndocument. We enlist scientists to select preferred parser outputs and\nincorporate this information through direct preference optimization (DPO) into\nAdaParse, thereby aligning its selection process with human judgment. AdaParse\nthen incorporates hardware requirements and predicted accuracy of each parser\nto orchestrate computational resources efficiently for large-scale parsing\ncampaigns. We demonstrate that AdaParse, when compared to state-of-the-art\nparsers, improves throughput by $17\\times$ while still achieving comparable\naccuracy (0.2 percent better) on a benchmark set of 1000 scientific documents.\nAdaParse's combination of high accuracy and parallel scalability makes it\nfeasible to parse large-scale scientific document corpora to support the\ndevelopment of high-quality, trillion-token-scale text datasets. The\nimplementation is available at https://github.com/7shoe/AdaParse/", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01479", "pdf": "https://arxiv.org/pdf/2505.01479", "abs": "https://arxiv.org/abs/2505.01479", "authors": ["Siheng Xiong", "Jieyu Zhou", "Zhangding Liu", "Yusen Su"], "title": "SymPlanner: Deliberate Planning in Language Models with Symbolic Representation", "categories": ["cs.CL"], "comment": null, "summary": "Planning remains a core challenge for language models (LMs), particularly in\ndomains that require coherent multi-step action sequences grounded in external\nconstraints. We introduce SymPlanner, a novel framework that equips LMs with\nstructured planning capabilities by interfacing them with a symbolic\nenvironment that serves as an explicit world model. Rather than relying purely\non natural language reasoning, SymPlanner grounds the planning process in a\nsymbolic state space, where a policy model proposes actions and a symbolic\nenvironment deterministically executes and verifies their effects. To enhance\nexploration and improve robustness, we introduce Iterative Correction (IC),\nwhich refines previously proposed actions by leveraging feedback from the\nsymbolic environment to eliminate invalid decisions and guide the model toward\nvalid alternatives. Additionally, Contrastive Ranking (CR) enables fine-grained\ncomparison of candidate plans by evaluating them jointly. We evaluate\nSymPlanner on PlanBench, demonstrating that it produces more coherent, diverse,\nand verifiable plans than pure natural language baselines.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "ranking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02072", "pdf": "https://arxiv.org/pdf/2505.02072", "abs": "https://arxiv.org/abs/2505.02072", "authors": ["Eitan Wagner", "Omri Abend"], "title": "What do Language Model Probabilities Represent? From Distribution Estimation to Response Prediction", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "The notion of language modeling has gradually shifted in recent years from a\ndistribution over finite-length strings to general-purpose prediction models\nfor textual inputs and outputs, following appropriate alignment phases. This\npaper analyzes the distinction between distribution estimation and response\nprediction in the context of LLMs, and their often conflicting goals. We\nexamine the training phases of LLMs, which include pretraining, in-context\nlearning, and preference tuning, and also the common use cases for their output\nprobabilities, which include completion probabilities and explicit\nprobabilities as output. We argue that the different settings lead to three\ndistinct intended output distributions. We demonstrate that NLP works often\nassume that these distributions should be similar, which leads to\nmisinterpretations of their experimental findings. Our work sets firmer formal\nfoundations for the interpretation of LLMs, which will inform ongoing work on\nthe interpretation and use of LLMs' induced distributions.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02686", "pdf": "https://arxiv.org/pdf/2505.02686", "abs": "https://arxiv.org/abs/2505.02686", "authors": ["Xiaobao Wu"], "title": "Sailing AI by the Stars: A Survey of Learning from Rewards in Post-Training and Test-Time Scaling of Large Language Models", "categories": ["cs.CL"], "comment": "35 Pages", "summary": "Recent developments in Large Language Models (LLMs) have shifted from\npre-training scaling to post-training and test-time scaling. Across these\ndevelopments, a key unified paradigm has arisen: Learning from Rewards, where\nreward signals act as the guiding stars to steer LLM behavior. It has\nunderpinned a wide range of prevalent techniques, such as reinforcement\nlearning (in RLHF, DPO, and GRPO), reward-guided decoding, and post-hoc\ncorrection. Crucially, this paradigm enables the transition from passive\nlearning from static data to active learning from dynamic feedback. This endows\nLLMs with aligned preferences and deep reasoning capabilities. In this survey,\nwe present a comprehensive overview of the paradigm of learning from rewards.\nWe categorize and analyze the strategies under this paradigm across training,\ninference, and post-inference stages. We further discuss the benchmarks for\nreward models and the primary applications. Finally we highlight the challenges\nand future directions. We maintain a paper collection at\nhttps://github.com/bobxwu/learning-from-rewards-llm-papers.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "DPO"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02134", "pdf": "https://arxiv.org/pdf/2505.02134", "abs": "https://arxiv.org/abs/2505.02134", "authors": ["Xiaorui Zhao", "Xinyue Zhou", "Peibei Cao", "Junyu Lou", "Shuhang Gu"], "title": "HiLLIE: Human-in-the-Loop Training for Low-Light Image Enhancement", "categories": ["cs.CV"], "comment": null, "summary": "Developing effective approaches to generate enhanced results that align well\nwith human visual preferences for high-quality well-lit images remains a\nchallenge in low-light image enhancement (LLIE). In this paper, we propose a\nhuman-in-the-loop LLIE training framework that improves the visual quality of\nunsupervised LLIE model outputs through iterative training stages, named\nHiLLIE. At each stage, we introduce human guidance into the training process\nthrough efficient visual quality annotations of enhanced outputs. Subsequently,\nwe employ a tailored image quality assessment (IQA) model to learn human visual\npreferences encoded in the acquired labels, which is then utilized to guide the\ntraining process of an enhancement model. With only a small amount of pairwise\nranking annotations required at each stage, our approach continually improves\nthe IQA model's capability to simulate human visual assessment of enhanced\noutputs, thus leading to visually appealing LLIE results. Extensive experiments\ndemonstrate that our approach significantly improves unsupervised LLIE model\nperformance in terms of both quantitative and qualitative performance. The code\nand collected ranking dataset will be available at\nhttps://github.com/LabShuHangGU/HiLLIE.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking", "pairwise"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02820", "pdf": "https://arxiv.org/pdf/2505.02820", "abs": "https://arxiv.org/abs/2505.02820", "authors": ["Hao Zhu", "Phil Cuvin", "Xinkai Yu", "Charlotte Ka Yee Yan", "Jason Zhang", "Diyi Yang"], "title": "AutoLibra: Agent Metric Induction from Open-Ended Feedback", "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": "https://opensocial.world/", "summary": "Agents are predominantly evaluated and optimized via task success metrics,\nwhich are coarse, rely on manual design from experts, and fail to reward\nintermediate emergent behaviors. We propose AutoLibra, a framework for agent\nevaluation, that transforms open-ended human feedback, e.g., \"If you find that\nthe button is disabled, don't click it again\", or \"This agent has too much\nautonomy to decide what to do on its own\", into metrics for evaluating\nfine-grained behaviors in agent trajectories. AutoLibra accomplishes this by\ngrounding feedback to an agent's behavior, clustering similar positive and\nnegative behaviors, and creating concrete metrics with clear definitions and\nconcrete examples, which can be used for prompting LLM-as-a-Judge as\nevaluators. We further propose two meta-metrics to evaluate the alignment of a\nset of (induced) metrics with open feedback: \"coverage\" and \"redundancy\".\nThrough optimizing these meta-metrics, we experimentally demonstrate\nAutoLibra's ability to induce more concrete agent evaluation metrics than the\nones proposed in previous agent evaluation benchmarks and discover new metrics\nto analyze agents. We also present two applications of AutoLibra in agent\nimprovement: First, we show that AutoLibra-induced metrics serve as better\nprompt-engineering targets than the task success rate on a wide range of text\ngame tasks, improving agent performance over baseline by a mean of 20%. Second,\nwe show that AutoLibra can iteratively select high-quality fine-tuning data for\nweb navigation agents. Our results suggest that AutoLibra is a powerful\ntask-agnostic tool for evaluating and improving language agents.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["human feedback", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01481", "pdf": "https://arxiv.org/pdf/2505.01481", "abs": "https://arxiv.org/abs/2505.01481", "authors": ["Zongxia Li", "Xiyang Wu", "Yubin Qin", "Guangyao Shi", "Hongyang Du", "Dinesh Manocha", "Tianyi Zhou", "Jordan Lee Boyd-Graber"], "title": "VideoHallu: Evaluating and Mitigating Multi-modal Hallucinations for Synthetic Videos", "categories": ["cs.CV", "cs.LG"], "comment": null, "summary": "Synthetic video generation with foundation models has gained attention for\nits realism and wide applications. While these models produce high-quality\nframes, they often fail to respect common sense and physical laws, resulting in\nabnormal content. Existing metrics like VideoScore emphasize general quality\nbut ignore such violations and lack interpretability. A more insightful\napproach is using multi-modal large language models (MLLMs) as interpretable\nevaluators, as seen in FactScore. Yet, MLLMs' ability to detect abnormalities\nin synthetic videos remains underexplored. To address this, we introduce\nVideoHallu, a benchmark featuring synthetic videos from models like Veo2, Sora,\nand Kling, paired with expert-designed QA tasks solvable via human-level\nreasoning across various categories. We assess several SoTA MLLMs, including\nGPT-4o, Gemini-2.5-Pro, Qwen-2.5-VL, and newer models like Video-R1 and\nVideoChat-R1. Despite strong real-world performance on MVBench and MovieChat,\nthese models still hallucinate on basic commonsense and physics tasks in\nsynthetic settings, underscoring the challenge of hallucination. We further\nfine-tune SoTA MLLMs using Group Relative Policy Optimization (GRPO) on real\nand synthetic commonsense/physics data. Results show notable accuracy gains,\nespecially with counterexample integration, advancing MLLMs' reasoning\ncapabilities. Our data is available at https://github.com/zli12321/VideoHallu.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01932", "pdf": "https://arxiv.org/pdf/2505.01932", "abs": "https://arxiv.org/abs/2505.01932", "authors": ["Xinmu Wang", "Xiang Gao", "Xiyun Song", "Heather Yu", "Zongfang Lin", "Liang Peng", "Xianfeng Gu"], "title": "OT-Talk: Animating 3D Talking Head with Optimal Transportation", "categories": ["cs.GR", "cs.CV"], "comment": null, "summary": "Animating 3D head meshes using audio inputs has significant applications in\nAR/VR, gaming, and entertainment through 3D avatars. However, bridging the\nmodality gap between speech signals and facial dynamics remains a challenge,\noften resulting in incorrect lip syncing and unnatural facial movements. To\naddress this, we propose OT-Talk, the first approach to leverage optimal\ntransportation to optimize the learning model in talking head animation.\nBuilding on existing learning frameworks, we utilize a pre-trained Hubert model\nto extract audio features and a transformer model to process temporal\nsequences. Unlike previous methods that focus solely on vertex coordinates or\ndisplacements, we introduce Chebyshev Graph Convolution to extract geometric\nfeatures from triangulated meshes. To measure mesh dissimilarities, we go\nbeyond traditional mesh reconstruction errors and velocity differences between\nadjacent frames. Instead, we represent meshes as probability measures and\napproximate their surfaces. This allows us to leverage the sliced Wasserstein\ndistance for modeling mesh variations. This approach facilitates the learning\nof smooth and accurate facial motions, resulting in coherent and natural facial\nanimations. Our experiments on two public audio-mesh datasets demonstrate that\nour method outperforms state-of-the-art techniques both quantitatively and\nqualitatively in terms of mesh reconstruction accuracy and temporal alignment.\nIn addition, we conducted a user perception study with 20 volunteers to further\nassess the effectiveness of our approach.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01558", "pdf": "https://arxiv.org/pdf/2505.01558", "abs": "https://arxiv.org/abs/2505.01558", "authors": ["Anan Yaghmour", "Melba M. Crawford", "Saurabh Prasad"], "title": "A Sensor Agnostic Domain Generalization Framework for Leveraging Geospatial Foundation Models: Enhancing Semantic Segmentation viaSynergistic Pseudo-Labeling and Generative Learning", "categories": ["cs.CV"], "comment": "Accepted in the 2025 CVPR Workshop on Foundation and Large Vision\n  Models in Remote Sensing, to appear in CVPR 2025 Workshop Proceedings", "summary": "Remote sensing enables a wide range of critical applications such as land\ncover and land use mapping, crop yield prediction, and environmental\nmonitoring. Advances in satellite technology have expanded remote sensing\ndatasets, yet high-performance segmentation models remain dependent on\nextensive labeled data, challenged by annotation scarcity and variability\nacross sensors, illumination, and geography. Domain adaptation offers a\npromising solution to improve model generalization. This paper introduces a\ndomain generalization approach to leveraging emerging geospatial foundation\nmodels by combining soft-alignment pseudo-labeling with source-to-target\ngenerative pre-training. We further provide new mathematical insights into\nMAE-based generative learning for domain-invariant feature learning.\nExperiments with hyperspectral and multispectral remote sensing datasets\nconfirm our method's effectiveness in enhancing adaptability and segmentation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01761", "pdf": "https://arxiv.org/pdf/2505.01761", "abs": "https://arxiv.org/abs/2505.01761", "authors": ["Tobias Domhan", "Dawei Zhu"], "title": "Same evaluation, more tokens: On the effect of input length for machine translation evaluation using Large Language Models", "categories": ["cs.CL"], "comment": null, "summary": "Accurately evaluating machine-translated text remains a long-standing\nchallenge, particularly for long documents. Recent work has shown that large\nlanguage models (LLMs) can serve as reliable and interpretable sentence-level\ntranslation evaluators via MQM error span annotations. With modern LLMs\nsupporting larger context windows, a natural question arises: can we feed\nentire document translations into an LLM for quality assessment? Ideally,\nevaluation should be invariant to text length, producing consistent error spans\nregardless of input granularity. However, our analysis shows that text length\nsignificantly impacts evaluation: longer texts lead to fewer error spans and\nreduced system ranking accuracy. To address this limitation, we evaluate\nseveral strategies, including granularity-aligned prompting, Focus Sentence\nPrompting (FSP), and a fine-tuning approach to better align LLMs with the\nevaluation task. The latter two methods largely mitigate this length bias,\nmaking LLMs more reliable for long-form translation evaluation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01694", "pdf": "https://arxiv.org/pdf/2505.01694", "abs": "https://arxiv.org/abs/2505.01694", "authors": ["Dazhi Huang"], "title": "Topology-Aware CLIP Few-Shot Learning", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "Efficiently adapting large Vision-Language Models (VLMs) like CLIP for\nfew-shot learning poses challenges in balancing pre-trained knowledge retention\nand task-specific adaptation. Existing methods often overlook valuable\nstructural information within the VLM's latent space. We introduce a\ntopology-aware tuning approach integrating Representation Topology Divergence\n(RTD) into the Task Residual (TR) framework. By explicitly aligning the\ntopological structures of visual and text representations using a combined RTD\nand Cross-Entropy loss, while freezing base VLM encoders, our method enhances\nfew-shot performance. We optimize only lightweight Task Residual parameters,\neffectively leveraging topological information. Across 6 diverse benchmark\ndatasets, our approach demonstrates significant gains, achieving an average\naccuracy improvement of 1-2\\% over relevant baseline methods in few-shot\nsettings. This work presents an effective strategy to boost VLM few-shot\ncapabilities by incorporating topological alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01711", "pdf": "https://arxiv.org/pdf/2505.01711", "abs": "https://arxiv.org/abs/2505.01711", "authors": ["Alexander Davis", "Rafael Souza", "Jia-Hao Lim"], "title": "Knowledge-Augmented Language Models Interpreting Structured Chest X-Ray Findings", "categories": ["cs.CV"], "comment": null, "summary": "Automated interpretation of chest X-rays (CXR) is a critical task with the\npotential to significantly improve clinical workflow and patient care. While\nrecent advances in multimodal foundation models have shown promise, effectively\nleveraging the full power of large language models (LLMs) for this visual task\nremains an underexplored area. This paper introduces CXR-TextInter, a novel\nframework that repurposes powerful text-centric LLMs for CXR interpretation by\noperating solely on a rich, structured textual representation of the image\ncontent, generated by an upstream image analysis pipeline. We augment this\nLLM-centric approach with an integrated medical knowledge module to enhance\nclinical reasoning. To facilitate training and evaluation, we developed the\nMediInstruct-CXR dataset, containing structured image representations paired\nwith diverse, clinically relevant instruction-response examples, and the\nCXR-ClinEval benchmark for comprehensive assessment across various\ninterpretation tasks. Extensive experiments on CXR-ClinEval demonstrate that\nCXR-TextInter achieves state-of-the-art quantitative performance across\npathology detection, report generation, and visual question answering,\nsurpassing existing multimodal foundation models. Ablation studies confirm the\ncritical contribution of the knowledge integration module. Furthermore, blinded\nhuman evaluation by board-certified radiologists shows a significant preference\nfor the clinical quality of outputs generated by CXR-TextInter. Our work\nvalidates an alternative paradigm for medical image AI, showcasing the\npotential of harnessing advanced LLM capabilities when visual information is\neffectively structured and domain knowledge is integrated.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "question answering"], "score": 4}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01900", "pdf": "https://arxiv.org/pdf/2505.01900", "abs": "https://arxiv.org/abs/2505.01900", "authors": ["Mazal Bethany", "Nishant Vishwamitra", "Cho-Yu Jason Chiang", "Peyman Najafirad"], "title": "CAMOUFLAGE: Exploiting Misinformation Detection Systems Through LLM-driven Adversarial Claim Transformation", "categories": ["cs.CL"], "comment": null, "summary": "Automated evidence-based misinformation detection systems, which evaluate the\nveracity of short claims against evidence, lack comprehensive analysis of their\nadversarial vulnerabilities. Existing black-box text-based adversarial attacks\nare ill-suited for evidence-based misinformation detection systems, as these\nattacks primarily focus on token-level substitutions involving gradient or\nlogit-based optimization strategies, which are incapable of fooling the\nmulti-component nature of these detection systems. These systems incorporate\nboth retrieval and claim-evidence comparison modules, which requires attacks to\nbreak the retrieval of evidence and/or the comparison module so that it draws\nincorrect inferences. We present CAMOUFLAGE, an iterative, LLM-driven approach\nthat employs a two-agent system, a Prompt Optimization Agent and an Attacker\nAgent, to create adversarial claim rewritings that manipulate evidence\nretrieval and mislead claim-evidence comparison, effectively bypassing the\nsystem without altering the meaning of the claim. The Attacker Agent produces\nsemantically equivalent rewrites that attempt to mislead detectors, while the\nPrompt Optimization Agent analyzes failed attack attempts and refines the\nprompt of the Attacker to guide subsequent rewrites. This enables larger\nstructural and stylistic transformations of the text rather than token-level\nsubstitutions, adapting the magnitude of changes based on previous outcomes.\nUnlike existing approaches, CAMOUFLAGE optimizes its attack solely based on\nbinary model decisions to guide its rewriting process, eliminating the need for\nclassifier logits or extensive querying. We evaluate CAMOUFLAGE on four\nsystems, including two recent academic systems and two real-world APIs, with an\naverage attack success rate of 46.92\\% while preserving textual coherence and\nsemantic equivalence to the original claims.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02156", "pdf": "https://arxiv.org/pdf/2505.02156", "abs": "https://arxiv.org/abs/2505.02156", "authors": ["Minzheng Wang", "Yongbin Li", "Haobo Wang", "Xinghua Zhang", "Nan Xu", "Bingli Wu", "Fei Huang", "Haiyang Yu", "Wenji Mao"], "title": "Think on your Feet: Adaptive Thinking via Reinforcement Learning for Social Agents", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "The code and data are available, see\n  https://github.com/MozerWang/AMPO. arXiv admin note: text overlap with\n  arXiv:2502.15538 by other authors", "summary": "Effective social intelligence simulation requires language agents to\ndynamically adjust reasoning depth, a capability notably absent in current\napproaches. While existing methods either lack this kind of reasoning\ncapability or enforce uniform long chain-of-thought reasoning across all\nscenarios, resulting in excessive token usage and inappropriate social\nsimulation. In this paper, we propose $\\textbf{A}$daptive $\\textbf{M}$ode\n$\\textbf{L}$earning ($\\textbf{AML}$) that strategically selects from four\nthinking modes (intuitive reaction $\\rightarrow$ deep contemplation) based on\nreal-time context. Our framework's core innovation, the $\\textbf{A}$daptive\n$\\textbf{M}$ode $\\textbf{P}$olicy $\\textbf{O}$ptimization ($\\textbf{AMPO}$)\nalgorithm, introduces three key advancements over existing methods: (1)\nMulti-granular thinking mode design, (2) Context-aware mode switching across\nsocial interaction, and (3) Token-efficient reasoning via depth-adaptive\nprocessing. Extensive experiments on social intelligence tasks confirm that AML\nachieves 15.6% higher task performance than state-of-the-art methods. Notably,\nour method outperforms GRPO by 7.0% with 32.8% shorter reasoning chains. These\nresults demonstrate that context-sensitive thinking mode selection, as\nimplemented in AMPO, enables more human-like adaptive reasoning than GRPO's\nfixed-depth approach", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01809", "pdf": "https://arxiv.org/pdf/2505.01809", "abs": "https://arxiv.org/abs/2505.01809", "authors": ["Xiaoqi Li", "Jiaming Liu", "Nuowei Han", "Liang Heng", "Yandong Guo", "Hao Dong", "Yang Liu"], "title": "3DWG: 3D Weakly Supervised Visual Grounding via Category and Instance-Level Alignment", "categories": ["cs.CV"], "comment": "ICRA 2025", "summary": "The 3D weakly-supervised visual grounding task aims to localize oriented 3D\nboxes in point clouds based on natural language descriptions without requiring\nannotations to guide model learning. This setting presents two primary\nchallenges: category-level ambiguity and instance-level complexity.\nCategory-level ambiguity arises from representing objects of fine-grained\ncategories in a highly sparse point cloud format, making category distinction\nchallenging. Instance-level complexity stems from multiple instances of the\nsame category coexisting in a scene, leading to distractions during grounding.\nTo address these challenges, we propose a novel weakly-supervised grounding\napproach that explicitly differentiates between categories and instances. In\nthe category-level branch, we utilize extensive category knowledge from a\npre-trained external detector to align object proposal features with\nsentence-level category features, thereby enhancing category awareness. In the\ninstance-level branch, we utilize spatial relationship descriptions from\nlanguage queries to refine object proposal features, ensuring clear\ndifferentiation among objects. These designs enable our model to accurately\nidentify target-category objects while distinguishing instances within the same\ncategory. Compared to previous methods, our approach achieves state-of-the-art\nperformance on three widely used benchmarks: Nr3D, Sr3D, and ScanRef.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02304", "pdf": "https://arxiv.org/pdf/2505.02304", "abs": "https://arxiv.org/abs/2505.02304", "authors": ["Siyu Liang", "Yunan Li", "Wentian Xin", "Huizhou Chen", "Xujie Liu", "Kang Liu", "Qiguang Miao"], "title": "Generative Sign-description Prompts with Multi-positive Contrastive Learning for Sign Language Recognition", "categories": ["cs.CL", "cs.CV"], "comment": "9 pages, 6 figures", "summary": "Sign language recognition (SLR) faces fundamental challenges in creating\naccurate annotations due to the inherent complexity of simultaneous manual and\nnon-manual signals. To the best of our knowledge, this is the first work to\nintegrate generative large language models (LLMs) into SLR tasks. We propose a\nnovel Generative Sign-description Prompts Multi-positive Contrastive learning\n(GSP-MC) method that leverages retrieval-augmented generation (RAG) with\ndomain-specific LLMs, incorporating multi-step prompt engineering and\nexpert-validated sign language corpora to produce precise multipart\ndescriptions. The GSP-MC method also employs a dual-encoder architecture to\nbidirectionally align hierarchical skeleton features with multiple text\ndescriptions (global, synonym, and part level) through probabilistic matching.\nOur approach combines global and part-level losses, optimizing KL divergence to\nensure robust alignment across all relevant text-skeleton pairs while capturing\nboth sign-level semantics and detailed part dynamics. Experiments demonstrate\nstate-of-the-art performance against existing methods on the Chinese SLR500\n(reaching 97.1%) and Turkish AUTSL datasets (97.07% accuracy). The method's\ncross-lingual effectiveness highlight its potential for developing inclusive\ncommunication technologies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02366", "pdf": "https://arxiv.org/pdf/2505.02366", "abs": "https://arxiv.org/abs/2505.02366", "authors": ["Tianyu Zong", "Hongzhu Yi", "Bingkang Shi", "Yuanxiang Wang", "Jungang Xu"], "title": "JTCSE: Joint Tensor-Modulus Constraints and Cross-Attention for Unsupervised Contrastive Learning of Sentence Embeddings", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Unsupervised contrastive learning has become a hot research topic in natural\nlanguage processing. Existing works usually aim at constraining the orientation\ndistribution of the representations of positive and negative samples in the\nhigh-dimensional semantic space in contrastive learning, but the semantic\nrepresentation tensor possesses both modulus and orientation features, and the\nexisting works ignore the modulus feature of the representations and cause\ninsufficient contrastive learning. % Therefore, we firstly propose a training\nobjective that aims at modulus constraints on the semantic representation\ntensor, to strengthen the alignment between the positive samples in contrastive\nlearning. Therefore, we first propose a training objective that is designed to\nimpose modulus constraints on the semantic representation tensor, to strengthen\nthe alignment between positive samples in contrastive learning. Then, the\nBERT-like model suffers from the phenomenon of sinking attention, leading to a\nlack of attention to CLS tokens that aggregate semantic information. In\nresponse, we propose a cross-attention structure among the twin-tower ensemble\nmodels to enhance the model's attention to CLS token and optimize the quality\nof CLS Pooling. Combining the above two motivations, we propose a new\n\\textbf{J}oint \\textbf{T}ensor representation modulus constraint and\n\\textbf{C}ross-attention unsupervised contrastive learning \\textbf{S}entence\n\\textbf{E}mbedding representation framework JTCSE, which we evaluate in seven\nsemantic text similarity computation tasks, and the experimental results show\nthat JTCSE's twin-tower ensemble model and single-tower distillation model\noutperform the other baselines and become the current SOTA. In addition, we\nhave conducted an extensive zero-shot downstream task evaluation, which shows\nthat JTCSE outperforms other baselines overall on more than 130 tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02579", "pdf": "https://arxiv.org/pdf/2505.02579", "abs": "https://arxiv.org/abs/2505.02579", "authors": ["Lingxiao Kong", "Cong Yang", "Susanne Neufang", "Oya Deniz Beyan", "Zeyd Boukhers"], "title": "EMORL: Ensemble Multi-Objective Reinforcement Learning for Efficient and Flexible LLM Fine-Tuning", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "13 pages, 9 figures, submitted to SIGDIAL 2025 conference", "summary": "Recent advances in reinforcement learning (RL) for large language model (LLM)\nfine-tuning show promise in addressing multi-objective tasks but still face\nsignificant challenges, including complex objective balancing, low training\nefficiency, poor scalability, and limited explainability. Leveraging ensemble\nlearning principles, we introduce an Ensemble Multi-Objective RL (EMORL)\nframework that fine-tunes multiple models with individual objectives while\noptimizing their aggregation after the training to improve efficiency and\nflexibility. Our method is the first to aggregate the last hidden states of\nindividual models, incorporating contextual information from multiple\nobjectives. This approach is supported by a hierarchical grid search algorithm\nthat identifies optimal weighted combinations. We evaluate EMORL on counselor\nreflection generation tasks, using text-scoring LLMs to evaluate the\ngenerations and provide rewards during RL fine-tuning. Through comprehensive\nexperiments on the PAIR and Psych8k datasets, we demonstrate the advantages of\nEMORL against existing baselines: significantly lower and more stable training\nconsumption ($17,529\\pm 1,650$ data points and $6,573\\pm 147.43$ seconds),\nimproved scalability and explainability, and comparable performance across\nmultiple objectives.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02018", "pdf": "https://arxiv.org/pdf/2505.02018", "abs": "https://arxiv.org/abs/2505.02018", "authors": ["Meng-Hao Guo", "Jiajun Xu", "Yi Zhang", "Jiaxi Song", "Haoyang Peng", "Yi-Xuan Deng", "Xinzhi Dong", "Kiyohiro Nakayama", "Zhengyang Geng", "Chen Wang", "Bolin Ni", "Guo-Wei Yang", "Yongming Rao", "Houwen Peng", "Han Hu", "Gordon Wetzstein", "Shi-min Hu"], "title": "R-Bench: Graduate-level Multi-disciplinary Benchmarks for LLM & MLLM Complex Reasoning Evaluation", "categories": ["cs.CV"], "comment": "18pages", "summary": "Reasoning stands as a cornerstone of intelligence, enabling the synthesis of\nexisting knowledge to solve complex problems. Despite remarkable progress,\nexisting reasoning benchmarks often fail to rigorously evaluate the nuanced\nreasoning capabilities required for complex, real-world problemsolving,\nparticularly in multi-disciplinary and multimodal contexts. In this paper, we\nintroduce a graduate-level, multi-disciplinary, EnglishChinese benchmark,\ndubbed as Reasoning Bench (R-Bench), for assessing the reasoning capability of\nboth language and multimodal models. RBench spans 1,094 questions across 108\nsubjects for language model evaluation and 665 questions across 83 subjects for\nmultimodal model testing in both English and Chinese. These questions are\nmeticulously curated to ensure rigorous difficulty calibration, subject\nbalance, and crosslinguistic alignment, enabling the assessment to be an\nOlympiad-level multi-disciplinary benchmark. We evaluate widely used models,\nincluding OpenAI o1, GPT-4o, DeepSeek-R1, etc. Experimental results indicate\nthat advanced models perform poorly on complex reasoning, especially multimodal\nreasoning. Even the top-performing model OpenAI o1 achieves only 53.2% accuracy\non our multimodal evaluation. Data and code are made publicly available at\nhere.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["o1"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy"], "score": 3}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02056", "pdf": "https://arxiv.org/pdf/2505.02056", "abs": "https://arxiv.org/abs/2505.02056", "authors": ["Yuchen Wang", "Xuefeng Bai", "Xiucheng Li", "Weili Guan", "Liqiang Nie", "Xinyang Chen"], "title": "Handling Imbalanced Pseudolabels for Vision-Language Models with Concept Alignment and Confusion-Aware Calibrated Margin", "categories": ["cs.CV", "cs.LG"], "comment": "Accepted to ICML 2025", "summary": "Adapting vision-language models (VLMs) to downstream tasks with pseudolabels\nhas gained increasing attention. A major obstacle is that the pseudolabels\ngenerated by VLMs tend to be imbalanced, leading to inferior performance. While\nexisting methods have explored various strategies to address this, the\nunderlying causes of imbalance remain insufficiently investigated. To fill this\ngap, we delve into imbalanced pseudolabels and identify two primary\ncontributing factors: concept mismatch and concept confusion. To mitigate these\ntwo issues, we propose a novel framework incorporating concept alignment and\nconfusion-aware calibrated margin mechanisms. The core of our approach lies in\nenhancing underperforming classes and promoting balanced predictions across\ncategories, thus mitigating imbalance. Extensive experiments on six benchmark\ndatasets with three learning paradigms demonstrate that the proposed method\neffectively enhances the accuracy and balance of pseudolabels, achieving a\nrelative improvement of 6.29% over the SoTA method. Our code is avaliable at\nhttps://anonymous.4open.science/r/CAP-C642/", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01636", "pdf": "https://arxiv.org/pdf/2505.01636", "abs": "https://arxiv.org/abs/2505.01636", "authors": ["Amit Rath"], "title": "Structured Prompting and Feedback-Guided Reasoning with LLMs for Data Interpretation", "categories": ["cs.AI", "cs.CL", "cs.LG", "I.2.7; H.2.8; D.2.13"], "comment": "21 pages, 2 figures", "summary": "Large language models (LLMs) have demonstrated remarkable capabilities in\nnatural language understanding and task generalization. However, their\napplication to structured data analysis remains fragile due to inconsistencies\nin schema interpretation, misalignment between user intent and model output,\nand limited mechanisms for self-correction when failures occur. This paper\nintroduces the STROT Framework (Structured Task Reasoning and Output\nTransformation), a method for structured prompting and feedback-driven\ntransformation logic generation aimed at improving the reliability and semantic\nalignment of LLM-based analytical workflows. STROT begins with lightweight\nschema introspection and sample-based field classification, enabling dynamic\ncontext construction that captures both the structure and statistical profile\nof the input data. This contextual information is embedded in structured\nprompts that guide the model toward generating task-specific, interpretable\noutputs. To address common failure modes in complex queries, STROT incorporates\na refinement mechanism in which the model iteratively revises its outputs based\non execution feedback and validation signals. Unlike conventional approaches\nthat rely on static prompts or single-shot inference, STROT treats the LLM as a\nreasoning agent embedded within a controlled analysis loop -- capable of\nadjusting its output trajectory through planning and correction. The result is\na robust and reproducible framework for reasoning over structured data with\nLLMs, applicable to diverse data exploration and analysis tasks where\ninterpretability, stability, and correctness are essential.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["self-correction"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02109", "pdf": "https://arxiv.org/pdf/2505.02109", "abs": "https://arxiv.org/abs/2505.02109", "authors": ["Yingkai Zhang", "Zeqiang Lai", "Tao Zhang", "Ying Fu", "Chenghu Zhou"], "title": "Unaligned RGB Guided Hyperspectral Image Super-Resolution with Spatial-Spectral Concordance", "categories": ["cs.CV"], "comment": null, "summary": "Hyperspectral images super-resolution aims to improve the spatial resolution,\nyet its performance is often limited at high-resolution ratios. The recent\nadoption of high-resolution reference images for super-resolution is driven by\nthe poor spatial detail found in low-resolution HSIs, presenting it as a\nfavorable method. However, these approaches cannot effectively utilize\ninformation from the reference image, due to the inaccuracy of alignment and\nits inadequate interaction between alignment and fusion modules. In this paper,\nwe introduce a Spatial-Spectral Concordance Hyperspectral Super-Resolution\n(SSC-HSR) framework for unaligned reference RGB guided HSI SR to address the\nissues of inaccurate alignment and poor interactivity of the previous\napproaches. Specifically, to ensure spatial concordance, i.e., align images\nmore accurately across resolutions and refine textures, we construct a\nTwo-Stage Image Alignment with a synthetic generation pipeline in the image\nalignment module, where the fine-tuned optical flow model can produce a more\naccurate optical flow in the first stage and warp model can refine damaged\ntextures in the second stage. To enhance the interaction between alignment and\nfusion modules and ensure spectral concordance during reconstruction, we\npropose a Feature Aggregation module and an Attention Fusion module. In the\nfeature aggregation module, we introduce an Iterative Deformable Feature\nAggregation block to achieve significant feature matching and texture\naggregation with the fusion multi-scale results guidance, iteratively\ngenerating learnable offset. Besides, we introduce two basic spectral-wise\nattention blocks in the attention fusion module to model the inter-spectra\ninteractions. Extensive experiments on three natural or remote-sensing datasets\nshow that our method outperforms state-of-the-art approaches on both\nquantitative and qualitative evaluations.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02148", "pdf": "https://arxiv.org/pdf/2505.02148", "abs": "https://arxiv.org/abs/2505.02148", "authors": ["Alexey Nekrasov", "Malcolm Burdorf", "Stewart Worrall", "Bastian Leibe", "Julie Stephany Berrio Perez"], "title": "Spotting the Unexpected (STU): A 3D LiDAR Dataset for Anomaly Segmentation in Autonomous Driving", "categories": ["cs.CV"], "comment": "Accepted for publication at CVPR 2025. Project page:\n  https://www.vision.rwth-aachen.de/stu-dataset", "summary": "To operate safely, autonomous vehicles (AVs) need to detect and handle\nunexpected objects or anomalies on the road. While significant research exists\nfor anomaly detection and segmentation in 2D, research progress in 3D is\nunderexplored. Existing datasets lack high-quality multimodal data that are\ntypically found in AVs. This paper presents a novel dataset for anomaly\nsegmentation in driving scenarios. To the best of our knowledge, it is the\nfirst publicly available dataset focused on road anomaly segmentation with\ndense 3D semantic labeling, incorporating both LiDAR and camera data, as well\nas sequential information to enable anomaly detection across various ranges.\nThis capability is critical for the safe navigation of autonomous vehicles. We\nadapted and evaluated several baseline models for 3D segmentation, highlighting\nthe challenges of 3D anomaly detection in driving environments. Our dataset and\nevaluation code will be openly available, facilitating the testing and\nperformance comparison of different approaches.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02199", "pdf": "https://arxiv.org/pdf/2505.02199", "abs": "https://arxiv.org/abs/2505.02199", "authors": ["Manak Raj", "Nidhi Mishra"], "title": "Exploring new Approaches for Information Retrieval through Natural Language Processing", "categories": ["cs.IR", "cs.CL", "68T50", "H.3.3; I.2.7"], "comment": "12 pages, 4 figures, comprehensive literature review covering six key\n  IR-NLP papers, plus keywords and full reference list", "summary": "This review paper explores recent advancements and emerging approaches in\nInformation Retrieval (IR) applied to Natural Language Processing (NLP). We\nexamine traditional IR models such as Boolean, vector space, probabilistic, and\ninference network models, and highlight modern techniques including deep\nlearning, reinforcement learning, and pretrained transformer models like BERT.\nWe discuss key tools and libraries - Lucene, Anserini, and Pyserini - for\nefficient text indexing and search. A comparative analysis of sparse, dense,\nand hybrid retrieval methods is presented, along with applications in web\nsearch engines, cross-language IR, argument mining, private information\nretrieval, and hate speech detection. Finally, we identify open challenges and\nfuture research directions to enhance retrieval accuracy, scalability, and\nethical considerations.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02391", "pdf": "https://arxiv.org/pdf/2505.02391", "abs": "https://arxiv.org/abs/2505.02391", "authors": ["Jiarui Yao", "Yifan Hao", "Hanning Zhang", "Hanze Dong", "Wei Xiong", "Nan Jiang", "Tong Zhang"], "title": "Optimizing Chain-of-Thought Reasoners via Gradient Variance Minimization in Rejection Sampling and RL", "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "Chain-of-thought (CoT) reasoning in large language models (LLMs) can be\nformalized as a latent variable problem, where the model needs to generate\nintermediate reasoning steps. While prior approaches such as iterative\nreward-ranked fine-tuning (RAFT) have relied on such formulations, they\ntypically apply uniform inference budgets across prompts, which fails to\naccount for variability in difficulty and convergence behavior. This work\nidentifies the main bottleneck in CoT training as inefficient stochastic\ngradient estimation due to static sampling strategies. We propose GVM-RAFT, a\nprompt-specific Dynamic Sample Allocation Strategy designed to minimize\nstochastic gradient variance under a computational budget constraint. The\nmethod dynamically allocates computational resources by monitoring prompt\nacceptance rates and stochastic gradient norms, ensuring that the resulting\ngradient variance is minimized. Our theoretical analysis shows that the\nproposed dynamic sampling strategy leads to accelerated convergence guarantees\nunder suitable conditions. Experiments on mathematical reasoning show that\nGVM-RAFT achieves a 2-4x speedup and considerable accuracy improvements over\nvanilla RAFT. The proposed dynamic sampling strategy is general and can be\nincorporated into other reinforcement learning algorithms, such as GRPO,\nleading to similar improvements in convergence and test accuracy. Our code is\navailable at https://github.com/RLHFlow/GVM.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["sampling strategies"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "mathematical reasoning"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02182", "pdf": "https://arxiv.org/pdf/2505.02182", "abs": "https://arxiv.org/abs/2505.02182", "authors": ["Yamini Sri Krubha", "Aryana Hou", "Braden Vester", "Web Walker", "Xin Wang", "Li Lin", "Shu Hu"], "title": "Robust AI-Generated Face Detection with Imbalanced Data", "categories": ["cs.CV"], "comment": null, "summary": "Deepfakes, created using advanced AI techniques such as Variational\nAutoencoder and Generative Adversarial Networks, have evolved from research and\nentertainment applications into tools for malicious activities, posing\nsignificant threats to digital trust. Current deepfake detection techniques\nhave evolved from CNN-based methods focused on local artifacts to more advanced\napproaches using vision transformers and multimodal models like CLIP, which\ncapture global anomalies and improve cross-domain generalization. Despite\nrecent progress, state-of-the-art deepfake detectors still face major\nchallenges in handling distribution shifts from emerging generative models and\naddressing severe class imbalance between authentic and fake samples in\ndeepfake datasets, which limits their robustness and detection accuracy. To\naddress these challenges, we propose a framework that combines dynamic loss\nreweighting and ranking-based optimization, which achieves superior\ngeneralization and performance under imbalanced dataset conditions. The code is\navailable at https://github.com/Purdue-M2/SP_CUP.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02236", "pdf": "https://arxiv.org/pdf/2505.02236", "abs": "https://arxiv.org/abs/2505.02236", "authors": ["Tianle Chen", "Chaitanya Chakka", "Deepti Ghadiyaram"], "title": "Improving Physical Object State Representation in Text-to-Image Generative Systems", "categories": ["cs.CV", "cs.AI"], "comment": "Submitted to Synthetic Data for Computer Vision - CVPR 2025 Workshop", "summary": "Current text-to-image generative models struggle to accurately represent\nobject states (e.g., \"a table without a bottle,\" \"an empty tumbler\"). In this\nwork, we first design a fully-automatic pipeline to generate high-quality\nsynthetic data that accurately captures objects in varied states. Next, we\nfine-tune several open-source text-to-image models on this synthetic data. We\nevaluate the performance of the fine-tuned models by quantifying the alignment\nof the generated images to their prompts using GPT4o-mini, and achieve an\naverage absolute improvement of 8+% across four models on the public\nGenAI-Bench dataset. We also curate a collection of 200 prompts with a specific\nfocus on common objects in various physical states. We demonstrate a\nsignificant improvement of an average of 24+% over the baseline on this\ndataset. We release all evaluation prompts and code.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02242", "pdf": "https://arxiv.org/pdf/2505.02242", "abs": "https://arxiv.org/abs/2505.02242", "authors": ["Qian Zeng", "Jie Song", "Yuanyu Wan", "Huiqiong Wang", "Mingli Song"], "title": "Quantizing Diffusion Models from a Sampling-Aware Perspective", "categories": ["cs.CV"], "comment": "11 pages, 4 figures", "summary": "Diffusion models have recently emerged as the dominant approach in visual\ngeneration tasks. However, the lengthy denoising chains and the computationally\nintensive noise estimation networks hinder their applicability in low-latency\nand resource-limited environments. Previous research has endeavored to address\nthese limitations in a decoupled manner, utilizing either advanced samplers or\nefficient model quantization techniques. In this study, we uncover that\nquantization-induced noise disrupts directional estimation at each sampling\nstep, further distorting the precise directional estimations of higher-order\nsamplers when solving the sampling equations through discretized numerical\nmethods, thereby altering the optimal sampling trajectory. To attain dual\nacceleration with high fidelity, we propose a sampling-aware quantization\nstrategy, wherein a Mixed-Order Trajectory Alignment technique is devised to\nimpose a more stringent constraint on the error bounds at each sampling step,\nfacilitating a more linear probability flow. Extensive experiments on\nsparse-step fast sampling across multiple datasets demonstrate that our\napproach preserves the rapid convergence characteristics of high-speed samplers\nwhile maintaining superior generation quality. Code will be made publicly\navailable soon.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02811", "pdf": "https://arxiv.org/pdf/2505.02811", "abs": "https://arxiv.org/abs/2505.02811", "authors": ["Diji Yang", "Linda Zeng", "Jinmeng Rao", "Yi Zhang"], "title": "Knowing You Don't Know: Learning When to Continue Search in Multi-round RAG through Self-Practicing", "categories": ["cs.AI", "cs.CL", "cs.IR"], "comment": "Proceedings of the 48th International ACM SIGIR 2025", "summary": "Retrieval Augmented Generation (RAG) has shown strong capability in enhancing\nlanguage models' knowledge and reducing AI generative hallucinations, driving\nits widespread use. However, complex tasks requiring multi-round retrieval\nremain challenging, and early attempts tend to be overly optimistic without a\ngood sense of self-skepticism. Current multi-round RAG systems may continue\nsearching even when enough information has already been retrieved, or they may\nprovide incorrect answers without having sufficient information or knowledge.\nExisting solutions either require large amounts of expensive human-labeled\nprocess supervision data or lead to subpar performance.\n  This paper aims to address these limitations by introducing a new framework,\n\\textbf{SIM-RAG}, to explicitly enhance RAG systems' self-awareness and\nmulti-round retrieval capabilities. To train SIM-RAG, we first let a RAG system\nself-practice multi-round retrieval, augmenting existing question-answer pairs\nwith intermediate inner monologue reasoning steps to generate synthetic\ntraining data. For each pair, the system may explore multiple retrieval paths,\nwhich are labeled as successful if they reach the correct answer and\nunsuccessful otherwise. Using this data, we train a lightweight information\nsufficiency Critic. At inference time, the Critic evaluates whether the RAG\nsystem has retrieved sufficient information at each round, guiding retrieval\ndecisions and improving system-level self-awareness through in-context\nreinforcement learning.\n  Experiments across multiple prominent RAG benchmarks show that SIM-RAG is an\neffective multi-round RAG solution. Furthermore, this framework is\nsystem-efficient, adding a lightweight component to RAG without requiring\nmodifications to existing LLMs or search engines, and data-efficient,\neliminating the need for costly human-annotated mid-step retrieval process\nsupervision data.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02325", "pdf": "https://arxiv.org/pdf/2505.02325", "abs": "https://arxiv.org/abs/2505.02325", "authors": ["Zhichuan Wang", "Yang Zhou", "Jinhai Xiang", "Yulong Wang", "Xinwei He"], "title": "TeDA: Boosting Vision-Lanuage Models for Zero-Shot 3D Object Retrieval via Testing-time Distribution Alignment", "categories": ["cs.CV"], "comment": "Accepted by ICMR 2025", "summary": "Learning discriminative 3D representations that generalize well to unknown\ntesting categories is an emerging requirement for many real-world 3D\napplications. Existing well-established methods often struggle to attain this\ngoal due to insufficient 3D training data from broader concepts. Meanwhile,\npre-trained large vision-language models (e.g., CLIP) have shown remarkable\nzero-shot generalization capabilities. Yet, they are limited in extracting\nsuitable 3D representations due to substantial gaps between their 2D training\nand 3D testing distributions. To address these challenges, we propose\nTesting-time Distribution Alignment (TeDA), a novel framework that adapts a\npretrained 2D vision-language model CLIP for unknown 3D object retrieval at\ntest time. To our knowledge, it is the first work that studies the test-time\nadaptation of a vision-language model for 3D feature learning. TeDA projects 3D\nobjects into multi-view images, extracts features using CLIP, and refines 3D\nquery embeddings with an iterative optimization strategy by confident\nquery-target sample pairs in a self-boosting manner. Additionally, TeDA\nintegrates textual descriptions generated by a multimodal language model\n(InternVL) to enhance 3D object understanding, leveraging CLIP's aligned\nfeature space to fuse visual and textual cues. Extensive experiments on four\nopen-set 3D object retrieval benchmarks demonstrate that TeDA greatly\noutperforms state-of-the-art methods, even those requiring extensive training.\nWe also experimented with depth maps on Objaverse-LVIS, further validating its\neffectiveness. Code is available at https://github.com/wangzhichuan123/TeDA.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test time"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02331", "pdf": "https://arxiv.org/pdf/2505.02331", "abs": "https://arxiv.org/abs/2505.02331", "authors": ["Hao Cheng", "Zhiwei Zhao", "Yichao He", "Zhenzhen Hu", "Jia Li", "Meng Wang", "Richang Hong"], "title": "VAEmo: Efficient Representation Learning for Visual-Audio Emotion with Knowledge Injection", "categories": ["cs.CV", "cs.SD"], "comment": "Source code and pre-trained models will be available at\n  https://github.com/MSA-LMC/VAEmo", "summary": "Audiovisual emotion recognition (AVER) aims to infer human emotions from\nnonverbal visual-audio (VA) cues, offering modality-complementary and\nlanguage-agnostic advantages. However, AVER remains challenging due to the\ninherent ambiguity of emotional expressions, cross-modal expressive\ndisparities, and the scarcity of reliably annotated data. Recent\nself-supervised AVER approaches have introduced strong multimodal\nrepresentations, yet they predominantly rely on modality-specific encoders and\ncoarse content-level alignment, limiting fine-grained emotional semantic\nmodeling. To address these issues, we propose VAEmo, an efficient two-stage\nframework for emotion-centric joint VA representation learning with external\nknowledge injection. In Stage 1, a unified and lightweight representation\nnetwork is pre-trained on large-scale speaker-centric VA corpora via masked\nreconstruction and contrastive objectives, mitigating the modality gap and\nlearning expressive, complementary representations without emotion labels. In\nStage 2, multimodal large language models automatically generate detailed\naffective descriptions according to our well-designed chain-of-thought\nprompting for only a small subset of VA samples; these rich textual semantics\nare then injected by aligning their corresponding embeddings with VA\nrepresentations through dual-path contrastive learning, further bridging the\nemotion gap. Extensive experiments on multiple downstream AVER benchmarks show\nthat VAEmo achieves state-of-the-art performance with a compact design,\nhighlighting the benefit of unified cross-modal encoding and emotion-aware\nsemantic guidance for efficient, generalizable VA emotion representations.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02388", "pdf": "https://arxiv.org/pdf/2505.02388", "abs": "https://arxiv.org/abs/2505.02388", "authors": ["Huangyue Yu", "Baoxiong Jia", "Yixin Chen", "Yandan Yang", "Puhao Li", "Rongpeng Su", "Jiaxin Li", "Qing Li", "Wei Liang", "Song-Chun Zhu", "Tengyu Liu", "Siyuan Huang"], "title": "MetaScenes: Towards Automated Replica Creation for Real-world 3D Scans", "categories": ["cs.CV", "cs.AI", "cs.LG", "cs.RO"], "comment": "CVPR 2025", "summary": "Embodied AI (EAI) research requires high-quality, diverse 3D scenes to\neffectively support skill acquisition, sim-to-real transfer, and\ngeneralization. Achieving these quality standards, however, necessitates the\nprecise replication of real-world object diversity. Existing datasets\ndemonstrate that this process heavily relies on artist-driven designs, which\ndemand substantial human effort and present significant scalability challenges.\nTo scalably produce realistic and interactive 3D scenes, we first present\nMetaScenes, a large-scale, simulatable 3D scene dataset constructed from\nreal-world scans, which includes 15366 objects spanning 831 fine-grained\ncategories. Then, we introduce Scan2Sim, a robust multi-modal alignment model,\nwhich enables the automated, high-quality replacement of assets, thereby\neliminating the reliance on artist-driven designs for scaling 3D scenes. We\nfurther propose two benchmarks to evaluate MetaScenes: a detailed scene\nsynthesis task focused on small item layouts for robotic manipulation and a\ndomain transfer task in vision-and-language navigation (VLN) to validate\ncross-domain transfer. Results confirm MetaScene's potential to enhance EAI by\nsupporting more generalizable agent learning and sim-to-real applications,\nintroducing new possibilities for EAI research. Project website:\nhttps://meta-scenes.github.io/.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02471", "pdf": "https://arxiv.org/pdf/2505.02471", "abs": "https://arxiv.org/abs/2505.02471", "authors": ["Biao Gong", "Cheng Zou", "Dandan Zheng", "Hu Yu", "Jingdong Chen", "Jianxin Sun", "Junbo Zhao", "Jun Zhou", "Kaixiang Ji", "Lixiang Ru", "Libin Wang", "Qingpei Guo", "Rui Liu", "Weilong Chai", "Xinyu Xiao", "Ziyuan Huang"], "title": "Ming-Lite-Uni: Advancements in Unified Architecture for Natural Multimodal Interaction", "categories": ["cs.CV"], "comment": "https://github.com/inclusionAI/Ming/tree/main/Ming-unify", "summary": "We introduce Ming-Lite-Uni, an open-source multimodal framework featuring a\nnewly designed unified visual generator and a native multimodal autoregressive\nmodel tailored for unifying vision and language. Specifically, this project\nprovides an open-source implementation of the integrated MetaQueries and\nM2-omni framework, while introducing the novel multi-scale learnable tokens and\nmulti-scale representation alignment strategy. By leveraging a fixed MLLM and a\nlearnable diffusion model, Ming-Lite-Uni enables native multimodal AR models to\nperform both text-to-image generation and instruction based image editing\ntasks, expanding their capabilities beyond pure visual understanding. Our\nexperimental results demonstrate the strong performance of Ming-Lite-Uni and\nillustrate the impressive fluid nature of its interactive process. All code and\nmodel weights are open-sourced to foster further exploration within the\ncommunity. Notably, this work aligns with concurrent multimodal AI milestones -\nsuch as ChatGPT-4o with native image generation updated in March 25, 2025 -\nunderscoring the broader significance of unified models like Ming-Lite-Uni on\nthe path toward AGI. Ming-Lite-Uni is in alpha stage and will soon be further\nrefined.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02481", "pdf": "https://arxiv.org/pdf/2505.02481", "abs": "https://arxiv.org/abs/2505.02481", "authors": ["Xiongjun Guan", "Zhiyu Pan", "Jianjiang Feng", "Jie Zhou"], "title": "Finger Pose Estimation for Under-screen Fingerprint Sensor", "categories": ["cs.CV"], "comment": null, "summary": "Two-dimensional pose estimation plays a crucial role in fingerprint\nrecognition by facilitating global alignment and reduce pose-induced\nvariations. However, existing methods are still unsatisfactory when handling\nwith large angle or small area inputs. These limitations are particularly\npronounced on fingerprints captured by under-screen fingerprint sensors in\nsmartphones. In this paper, we present a novel dual-modal input based network\nfor under-screen fingerprint pose estimation. Our approach effectively\nintegrates two distinct yet complementary modalities: texture details extracted\nfrom ridge patches through the under-screen fingerprint sensor, and rough\ncontours derived from capacitive images obtained via the touch screen. This\ncollaborative integration endows our network with more comprehensive and\ndiscriminative information, substantially improving the accuracy and stability\nof pose estimation. A decoupled probability distribution prediction task is\ndesigned, instead of the traditional supervised forms of numerical regression\nor heatmap voting, to facilitate the training process. Additionally, we\nincorporate a Mixture of Experts (MoE) based feature fusion mechanism and a\nrelationship driven cross-domain knowledge transfer strategy to further\nstrengthen feature extraction and fusion capabilities. Extensive experiments\nare conducted on several public datasets and two private datasets. The results\nindicate that our method is significantly superior to previous state-of-the-art\n(SOTA) methods and remarkably boosts the recognition ability of fingerprint\nrecognition algorithms. Our code is available at\nhttps://github.com/XiongjunGuan/DRACO.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02539", "pdf": "https://arxiv.org/pdf/2505.02539", "abs": "https://arxiv.org/abs/2505.02539", "authors": ["Nahuel Garcia-D'Urso", "Bernabe Sanchez-Sos", "Jorge Azorin-Lopez", "Andres Fuster-Guillo", "Antonio Macia-Lillo", "Higinio Mora-Mora"], "title": "Marker-Based Extrinsic Calibration Method for Accurate Multi-Camera 3D Reconstruction", "categories": ["cs.CV", "cs.MM"], "comment": null, "summary": "Accurate 3D reconstruction using multi-camera RGB-D systems critically\ndepends on precise extrinsic calibration to achieve proper alignment between\ncaptured views. In this paper, we introduce an iterative extrinsic calibration\nmethod that leverages the geometric constraints provided by a three-dimensional\nmarker to significantly improve calibration accuracy. Our proposed approach\nsystematically segments and refines marker planes through clustering,\nregression analysis, and iterative reassignment techniques, ensuring robust\ngeometric correspondence across camera views. We validate our method\ncomprehensively in both controlled environments and practical real-world\nsettings within the Tech4Diet project, aimed at modeling the physical\nprogression of patients undergoing nutritional treatments. Experimental results\ndemonstrate substantial reductions in alignment errors, facilitating accurate\nand reliable 3D reconstructions.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02704", "pdf": "https://arxiv.org/pdf/2505.02704", "abs": "https://arxiv.org/abs/2505.02704", "authors": ["Bojin Wu", "Jing Chen"], "title": "Visually-Guided Linguistic Disambiguation for Monocular Depth Scale Recovery", "categories": ["cs.CV"], "comment": "21 pages, conference", "summary": "We propose a robust method for monocular depth scale recovery. Monocular\ndepth estimation can be divided into two main directions: (1) relative depth\nestimation, which provides normalized or inverse depth without scale\ninformation, and (2) metric depth estimation, which involves recovering depth\nwith absolute scale. To obtain absolute scale information for practical\ndownstream tasks, utilizing textual information to recover the scale of a\nrelative depth map is a highly promising approach. However, since a single\nimage can have multiple descriptions from different perspectives or with\nvarying styles, it has been shown that different textual descriptions can\nsignificantly affect the scale recovery process. To address this issue, our\nmethod, VGLD, stabilizes the influence of textual information by incorporating\nhigh-level semantic information from the corresponding image alongside the\ntextual description. This approach resolves textual ambiguities and robustly\noutputs a set of linear transformation parameters (scalars) that can be\nglobally applied to the relative depth map, ultimately generating depth\npredictions with metric-scale accuracy. We validate our method across several\npopular relative depth models(MiDas, DepthAnything), using both indoor scenes\n(NYUv2) and outdoor scenes (KITTI). Our results demonstrate that VGLD functions\nas a universal alignment module when trained on multiple datasets, achieving\nstrong performance even in zero-shot scenarios. Code is available at:\nhttps://github.com/pakinwu/VGLD.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02779", "pdf": "https://arxiv.org/pdf/2505.02779", "abs": "https://arxiv.org/abs/2505.02779", "authors": ["David Rivas-Villar", "lvaro S. Hervella", "Jos Rouco", "Jorge Novo"], "title": "Unsupervised Deep Learning-based Keypoint Localization Estimating Descriptor Matching Performance", "categories": ["cs.CV"], "comment": null, "summary": "Retinal image registration, particularly for color fundus images, is a\nchallenging yet essential task with diverse clinical applications. Existing\nregistration methods for color fundus images typically rely on keypoints and\ndescriptors for alignment; however, a significant limitation is their reliance\non labeled data, which is particularly scarce in the medical domain.\n  In this work, we present a novel unsupervised registration pipeline that\nentirely eliminates the need for labeled data. Our approach is based on the\nprinciple that locations with distinctive descriptors constitute reliable\nkeypoints. This fully inverts the conventional state-of-the-art approach,\nconditioning the detector on the descriptor rather than the opposite.\n  First, we propose an innovative descriptor learning method that operates\nwithout keypoint detection or any labels, generating descriptors for arbitrary\nlocations in retinal images. Next, we introduce a novel, label-free keypoint\ndetector network which works by estimating descriptor performance directly from\nthe input image.\n  We validate our method through a comprehensive evaluation on four hold-out\ndatasets, demonstrating that our unsupervised descriptor outperforms\nstate-of-the-art supervised descriptors and that our unsupervised detector\nsignificantly outperforms existing unsupervised detection methods. Finally, our\nfull registration pipeline achieves performance comparable to the leading\nsupervised methods, while not employing any labeled data. Additionally, the\nlabel-free nature and design of our method enable direct adaptation to other\ndomains and modalities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02787", "pdf": "https://arxiv.org/pdf/2505.02787", "abs": "https://arxiv.org/abs/2505.02787", "authors": ["David Rivas-Villar", "lvaro S. Hervella", "Jos Rouco", "Jorge Novo"], "title": "Unsupervised training of keypoint-agnostic descriptors for flexible retinal image registration", "categories": ["cs.CV"], "comment": null, "summary": "Current color fundus image registration approaches are limited, among other\nthings, by the lack of labeled data, which is even more significant in the\nmedical domain, motivating the use of unsupervised learning. Therefore, in this\nwork, we develop a novel unsupervised descriptor learning method that does not\nrely on keypoint detection. This enables the resulting descriptor network to be\nagnostic to the keypoint detector used during the registration inference.\n  To validate this approach, we perform an extensive and comprehensive\ncomparison on the reference public retinal image registration dataset.\nAdditionally, we test our method with multiple keypoint detectors of varied\nnature, even proposing some novel ones. Our results demonstrate that the\nproposed approach offers accurate registration, not incurring in any\nperformance loss versus supervised methods. Additionally, it demonstrates\naccurate performance regardless of the keypoint detector used. Thus, this work\nrepresents a notable step towards leveraging unsupervised learning in the\nmedical domain.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02836", "pdf": "https://arxiv.org/pdf/2505.02836", "abs": "https://arxiv.org/abs/2505.02836", "authors": ["Lu Ling", "Chen-Hsuan Lin", "Tsung-Yi Lin", "Yifan Ding", "Yu Zeng", "Yichen Sheng", "Yunhao Ge", "Ming-Yu Liu", "Aniket Bera", "Zhaoshuo Li"], "title": "Scenethesis: A Language and Vision Agentic Framework for 3D Scene Generation", "categories": ["cs.CV"], "comment": null, "summary": "Synthesizing interactive 3D scenes from text is essential for gaming, virtual\nreality, and embodied AI. However, existing methods face several challenges.\nLearning-based approaches depend on small-scale indoor datasets, limiting the\nscene diversity and layout complexity. While large language models (LLMs) can\nleverage diverse text-domain knowledge, they struggle with spatial realism,\noften producing unnatural object placements that fail to respect common sense.\nOur key insight is that vision perception can bridge this gap by providing\nrealistic spatial guidance that LLMs lack. To this end, we introduce\nScenethesis, a training-free agentic framework that integrates LLM-based scene\nplanning with vision-guided layout refinement. Given a text prompt, Scenethesis\nfirst employs an LLM to draft a coarse layout. A vision module then refines it\nby generating an image guidance and extracting scene structure to capture\ninter-object relations. Next, an optimization module iteratively enforces\naccurate pose alignment and physical plausibility, preventing artifacts like\nobject penetration and instability. Finally, a judge module verifies spatial\ncoherence. Comprehensive experiments show that Scenethesis generates diverse,\nrealistic, and physically plausible 3D interactive scenes, making it valuable\nfor virtual content creation, simulation environments, and embodied AI\nresearch.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01657", "pdf": "https://arxiv.org/pdf/2505.01657", "abs": "https://arxiv.org/abs/2505.01657", "authors": ["Run Ling", "Wenji Wang", "Yuting Liu", "Guibing Guo", "Linying Jiang", "Xingwei Wang"], "title": "RAGAR: Retrieval Augment Personalized Image Generation Guided by Recommendation", "categories": ["cs.IR", "cs.CV"], "comment": null, "summary": "Personalized image generation is crucial for improving the user experience,\nas it renders reference images into preferred ones according to user visual\npreferences. Although effective, existing methods face two main issues. First,\nexisting methods treat all items in the user historical sequence equally when\nextracting user preferences, overlooking the varying semantic similarities\nbetween historical items and the reference item. Disproportionately high\nweights for low-similarity items distort users' visual preferences for the\nreference item. Second, existing methods heavily rely on consistency between\ngenerated and reference images to optimize the generation, which leads to\nunderfitting user preferences and hinders personalization. To address these\nissues, we propose Retrieval Augment Personalized Image GenerAtion guided by\nRecommendation (RAGAR). Our approach uses a retrieval mechanism to assign\ndifferent weights to historical items according to their similarities to the\nreference item, thereby extracting more refined users' visual preferences for\nthe reference item. Then we introduce a novel rank task based on the\nmulti-modal ranking model to optimize the personalization of the generated\nimages instead of forcing depend on consistency. Extensive experiments and\nhuman evaluations on three real-world datasets demonstrate that RAGAR achieves\nsignificant improvements in both personalization and semantic metrics compared\nto five baselines.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01709", "pdf": "https://arxiv.org/pdf/2505.01709", "abs": "https://arxiv.org/abs/2505.01709", "authors": ["Kaidong Zhang", "Rongtao Xu", "Pengzhen Ren", "Junfan Lin", "Hefeng Wu", "Liang Lin", "Xiaodan Liang"], "title": "RoBridge: A Hierarchical Architecture Bridging Cognition and Execution for General Robotic Manipulation", "categories": ["cs.RO", "cs.AI", "cs.CV"], "comment": "project page: https://abliao.github.io/RoBridge/", "summary": "Operating robots in open-ended scenarios with diverse tasks is a crucial\nresearch and application direction in robotics. While recent progress in\nnatural language processing and large multimodal models has enhanced robots'\nability to understand complex instructions, robot manipulation still faces the\nprocedural skill dilemma and the declarative skill dilemma in open\nenvironments. Existing methods often compromise cognitive and executive\ncapabilities. To address these challenges, in this paper, we propose RoBridge,\na hierarchical intelligent architecture for general robotic manipulation. It\nconsists of a high-level cognitive planner (HCP) based on a large-scale\npre-trained vision-language model (VLM), an invariant operable representation\n(IOR) serving as a symbolic bridge, and a generalist embodied agent (GEA).\nRoBridge maintains the declarative skill of VLM and unleashes the procedural\nskill of reinforcement learning, effectively bridging the gap between cognition\nand execution. RoBridge demonstrates significant performance improvements over\nexisting baselines, achieving a 75% success rate on new tasks and an 83%\naverage success rate in sim-to-real generalization using only five real-world\ndata samples per task. This work represents a significant step towards\nintegrating cognitive reasoning with physical execution in robotic systems,\noffering a new paradigm for general robotic manipulation.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.01932", "pdf": "https://arxiv.org/pdf/2505.01932", "abs": "https://arxiv.org/abs/2505.01932", "authors": ["Xinmu Wang", "Xiang Gao", "Xiyun Song", "Heather Yu", "Zongfang Lin", "Liang Peng", "Xianfeng Gu"], "title": "OT-Talk: Animating 3D Talking Head with Optimal Transportation", "categories": ["cs.GR", "cs.CV"], "comment": null, "summary": "Animating 3D head meshes using audio inputs has significant applications in\nAR/VR, gaming, and entertainment through 3D avatars. However, bridging the\nmodality gap between speech signals and facial dynamics remains a challenge,\noften resulting in incorrect lip syncing and unnatural facial movements. To\naddress this, we propose OT-Talk, the first approach to leverage optimal\ntransportation to optimize the learning model in talking head animation.\nBuilding on existing learning frameworks, we utilize a pre-trained Hubert model\nto extract audio features and a transformer model to process temporal\nsequences. Unlike previous methods that focus solely on vertex coordinates or\ndisplacements, we introduce Chebyshev Graph Convolution to extract geometric\nfeatures from triangulated meshes. To measure mesh dissimilarities, we go\nbeyond traditional mesh reconstruction errors and velocity differences between\nadjacent frames. Instead, we represent meshes as probability measures and\napproximate their surfaces. This allows us to leverage the sliced Wasserstein\ndistance for modeling mesh variations. This approach facilitates the learning\nof smooth and accurate facial motions, resulting in coherent and natural facial\nanimations. Our experiments on two public audio-mesh datasets demonstrate that\nour method outperforms state-of-the-art techniques both quantitatively and\nqualitatively in terms of mesh reconstruction accuracy and temporal alignment.\nIn addition, we conducted a user perception study with 20 volunteers to further\nassess the effectiveness of our approach.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02001", "pdf": "https://arxiv.org/pdf/2505.02001", "abs": "https://arxiv.org/abs/2505.02001", "authors": ["Vineesh Kumar Reddy Mondem"], "title": "Hybrid Image Resolution Quality Metric (HIRQM):A Comprehensive Perceptual Image Quality Assessment Framework", "categories": ["eess.IV", "cs.CV", "94A08", "I.4.0; I.4.9; I.2.10"], "comment": "19 pages,2 figures,2 tables and biblography with similar papers with\n  some valid information", "summary": "Traditional image quality assessment metrics like Mean Squared Error and\nStructural Similarity Index often fail to reflect perceptual quality under\ncomplex distortions. We propose the Hybrid Image Resolution Quality Metric\n(HIRQM), integrating statistical, multi-scale, and deep learning-based methods\nfor a comprehensive quality evaluation. HIRQM combines three components:\nProbability Density Function for local pixel distribution analysis, Multi-scale\nFeature Similarity for structural integrity across resolutions, and\nHierarchical Deep Image Features using a pre-trained VGG16 network for semantic\nalignment with human perception. A dynamic weighting mechanism adapts component\ncontributions based on image characteristics like brightness and variance,\nenhancing flexibility across distortion types. Our contributions include a\nunified metric and dynamic weighting for better perceptual alignment. Evaluated\non TID2013 and LIVE datasets, HIRQM achieves Pearson and Spearman correlations\nof 0.92 and 0.90, outperforming traditional metrics. It excels in handling\nnoise, blur, and compression artifacts, making it valuable for image processing\napplications like compression and restoration.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02094", "pdf": "https://arxiv.org/pdf/2505.02094", "abs": "https://arxiv.org/abs/2505.02094", "authors": ["Runyi Yu", "Yinhuai Wang", "Qihan Zhao", "Hok Wai Tsui", "Jingbo Wang", "Ping Tan", "Qifeng Chen"], "title": "SkillMimic-V2: Learning Robust and Generalizable Interaction Skills from Sparse and Noisy Demonstrations", "categories": ["cs.LG", "cs.CV"], "comment": null, "summary": "We address a fundamental challenge in Reinforcement Learning from Interaction\nDemonstration (RLID): demonstration noise and coverage limitations. While\nexisting data collection approaches provide valuable interaction\ndemonstrations, they often yield sparse, disconnected, and noisy trajectories\nthat fail to capture the full spectrum of possible skill variations and\ntransitions. Our key insight is that despite noisy and sparse demonstrations,\nthere exist infinite physically feasible trajectories that naturally bridge\nbetween demonstrated skills or emerge from their neighboring states, forming a\ncontinuous space of possible skill variations and transitions. Building upon\nthis insight, we present two data augmentation techniques: a Stitched\nTrajectory Graph (STG) that discovers potential transitions between\ndemonstration skills, and a State Transition Field (STF) that establishes\nunique connections for arbitrary states within the demonstration neighborhood.\nTo enable effective RLID with augmented data, we develop an Adaptive Trajectory\nSampling (ATS) strategy for dynamic curriculum generation and a historical\nencoding mechanism for memory-dependent skill learning. Our approach enables\nrobust skill acquisition that significantly generalizes beyond the reference\ndemonstrations. Extensive experiments across diverse interaction tasks\ndemonstrate substantial improvements over state-of-the-art methods in terms of\nconvergence stability, generalization capability, and recovery robustness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02304", "pdf": "https://arxiv.org/pdf/2505.02304", "abs": "https://arxiv.org/abs/2505.02304", "authors": ["Siyu Liang", "Yunan Li", "Wentian Xin", "Huizhou Chen", "Xujie Liu", "Kang Liu", "Qiguang Miao"], "title": "Generative Sign-description Prompts with Multi-positive Contrastive Learning for Sign Language Recognition", "categories": ["cs.CL", "cs.CV"], "comment": "9 pages, 6 figures", "summary": "Sign language recognition (SLR) faces fundamental challenges in creating\naccurate annotations due to the inherent complexity of simultaneous manual and\nnon-manual signals. To the best of our knowledge, this is the first work to\nintegrate generative large language models (LLMs) into SLR tasks. We propose a\nnovel Generative Sign-description Prompts Multi-positive Contrastive learning\n(GSP-MC) method that leverages retrieval-augmented generation (RAG) with\ndomain-specific LLMs, incorporating multi-step prompt engineering and\nexpert-validated sign language corpora to produce precise multipart\ndescriptions. The GSP-MC method also employs a dual-encoder architecture to\nbidirectionally align hierarchical skeleton features with multiple text\ndescriptions (global, synonym, and part level) through probabilistic matching.\nOur approach combines global and part-level losses, optimizing KL divergence to\nensure robust alignment across all relevant text-skeleton pairs while capturing\nboth sign-level semantics and detailed part dynamics. Experiments demonstrate\nstate-of-the-art performance against existing methods on the Chinese SLR500\n(reaching 97.1%) and Turkish AUTSL datasets (97.07% accuracy). The method's\ncross-lingual effectiveness highlight its potential for developing inclusive\ncommunication technologies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02664", "pdf": "https://arxiv.org/pdf/2505.02664", "abs": "https://arxiv.org/abs/2505.02664", "authors": ["Ali Rashidi Moghadam", "Sayedmohammadreza Rastegari", "Mehdi Tale Masouleh", "Ahmad Kalhor"], "title": "Grasp the Graph (GtG) 2.0: Ensemble of GNNs for High-Precision Grasp Pose Detection in Clutter", "categories": ["cs.RO", "cs.CV", "cs.LG"], "comment": "9 Pages, 6 figures", "summary": "Grasp pose detection in cluttered, real-world environments remains a\nsignificant challenge due to noisy and incomplete sensory data combined with\ncomplex object geometries. This paper introduces Grasp the Graph 2.0 (GtG 2.0)\nmethod, a lightweight yet highly effective hypothesis-and-test robotics\ngrasping framework which leverages an ensemble of Graph Neural Networks for\nefficient geometric reasoning from point cloud data. Building on the success of\nGtG 1.0, which demonstrated the potential of Graph Neural Networks for grasp\ndetection but was limited by assumptions of complete, noise-free point clouds\nand 4-Dof grasping, GtG 2.0 employs a conventional Grasp Pose Generator to\nefficiently produce 7-Dof grasp candidates. Candidates are assessed with an\nensemble Graph Neural Network model which includes points within the gripper\njaws (inside points) and surrounding contextual points (outside points). This\nimproved representation boosts grasp detection performance over previous\nmethods using the same generator. GtG 2.0 shows up to a 35% improvement in\nAverage Precision on the GraspNet-1Billion benchmark compared to\nhypothesis-and-test and Graph Neural Network-based methods, ranking it among\nthe top three frameworks. Experiments with a 3-Dof Delta Parallel robot and\nKinect-v1 camera show a success rate of 91% and a clutter completion rate of\n100%, demonstrating its flexibility and reliability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "reliability"], "score": 2}}, "source_file": "2025-05-06.jsonl"}
{"id": "2505.02833", "pdf": "https://arxiv.org/pdf/2505.02833", "abs": "https://arxiv.org/abs/2505.02833", "authors": ["Yanjie Ze", "Zixuan Chen", "Joo Pedro Arajo", "Zi-ang Cao", "Xue Bin Peng", "Jiajun Wu", "C. Karen Liu"], "title": "TWIST: Teleoperated Whole-Body Imitation System", "categories": ["cs.RO", "cs.CV", "cs.LG"], "comment": "Project website: https://humanoid-teleop.github.io", "summary": "Teleoperating humanoid robots in a whole-body manner marks a fundamental step\ntoward developing general-purpose robotic intelligence, with human motion\nproviding an ideal interface for controlling all degrees of freedom. Yet, most\ncurrent humanoid teleoperation systems fall short of enabling coordinated\nwhole-body behavior, typically limiting themselves to isolated locomotion or\nmanipulation tasks. We present the Teleoperated Whole-Body Imitation System\n(TWIST), a system for humanoid teleoperation through whole-body motion\nimitation. We first generate reference motion clips by retargeting human motion\ncapture data to the humanoid robot. We then develop a robust, adaptive, and\nresponsive whole-body controller using a combination of reinforcement learning\nand behavior cloning (RL+BC). Through systematic analysis, we demonstrate how\nincorporating privileged future motion frames and real-world motion capture\n(MoCap) data improves tracking accuracy. TWIST enables real-world humanoid\nrobots to achieve unprecedented, versatile, and coordinated whole-body motor\nskills--spanning whole-body manipulation, legged manipulation, locomotion, and\nexpressive movement--using a single unified neural network controller. Our\nproject website: https://humanoid-teleop.github.io", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-06.jsonl"}
