{"id": "2507.19672", "categories": ["cs.AI", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2507.19672", "abs": "https://arxiv.org/abs/2507.19672", "authors": ["Haoran Lu", "Luyang Fang", "Ruidong Zhang", "Xinliang Li", "Jiazhang Cai", "Huimin Cheng", "Lin Tang", "Ziyu Liu", "Zeliang Sun", "Tao Wang", "Yingchuan Zhang", "Arif Hassan Zidan", "Jinwen Xu", "Jincheng Yu", "Meizhi Yu", "Hanqi Jiang", "Xilin Gong", "Weidi Luo", "Bolun Sun", "Yongkai Chen", "Terry Ma", "Shushan Wu", "Yifan Zhou", "Junhao Chen", "Haotian Xiang", "Jing Zhang", "Afrar Jahin", "Wei Ruan", "Ke Deng", "Yi Pan", "Peilong Wang", "Jiahui Li", "Zhengliang Liu", "Lu Zhang", "Lin Zhao", "Wei Liu", "Dajiang Zhu", "Xin Xing", "Fei Dou", "Wei Zhang", "Chao Huang", "Rongjie Liu", "Mengrui Zhang", "Yiwen Liu", "Xiaoxiao Sun", "Qin Lu", "Zhen Xiang", "Wenxuan Zhong", "Tianming Liu", "Ping Ma"], "title": "Alignment and Safety in Large Language Models: Safety Mechanisms, Training Paradigms, and Emerging Challenges", "comment": "119 pages, 10 figures, 7 tables", "summary": "Due to the remarkable capabilities and growing impact of large language\nmodels (LLMs), they have been deeply integrated into many aspects of society.\nThus, ensuring their alignment with human values and intentions has emerged as\na critical challenge. This survey provides a comprehensive overview of\npractical alignment techniques, training protocols, and empirical findings in\nLLM alignment. We analyze the development of alignment methods across diverse\nparadigms, characterizing the fundamental trade-offs between core alignment\nobjectives. Our analysis shows that while supervised fine-tuning enables basic\ninstruction-following, preference-based methods offer more flexibility for\naligning with nuanced human intent. We discuss state-of-the-art techniques,\nincluding Direct Preference Optimization (DPO), Constitutional AI,\nbrain-inspired methods, and alignment uncertainty quantification (AUQ),\nhighlighting their approaches to balancing quality and efficiency. We review\nexisting evaluation frameworks and benchmarking datasets, emphasizing\nlimitations such as reward misspecification, distributional robustness, and\nscalable oversight. We summarize strategies adopted by leading AI labs to\nillustrate the current state of practice. We conclude by outlining open\nproblems in oversight, value pluralism, robustness, and continuous alignment.\nThis survey aims to inform both researchers and practitioners navigating the\nevolving landscape of LLM alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "constitutional AI", "alignment", "DPO", "direct preference optimization"], "score": 5}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20150", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20150", "abs": "https://arxiv.org/abs/2507.20150", "authors": ["Xingcheng Xu"], "title": "The Policy Cliff: A Theoretical Analysis of Reward-Policy Maps in Large Language Models", "comment": null, "summary": "Reinforcement learning (RL) plays a crucial role in shaping the behavior of\nlarge language and reasoning models (LLMs/LRMs). However, it often produces\nbrittle and unstable policies, leading to critical failures such as spurious\nreasoning, deceptive alignment, and instruction disobedience that undermine the\ntrustworthiness and safety of LLMs/LRMs. Currently, these issues lack a unified\ntheoretical explanation and are typically addressed using ad-hoc heuristics.\nThis paper presents a rigorous mathematical framework for analyzing the\nstability of the mapping from a reward function to the optimal policy. We show\nthat policy brittleness often stems from non-unique optimal actions, a common\noccurrence when multiple valid traces exist in a reasoning task. This\ntheoretical lens provides a unified explanation for a range of seemingly\ndisparate failures, reframing them as rational outcomes of optimizing rewards\nthat may be incomplete or noisy, especially in the presence of action\ndegeneracy. We extend this analysis from the fundamental single-reward setting\nto the more realistic multi-reward RL across diverse domains, showing how\nstability is governed by an \"effective reward\" aggregation mechanism. We also\nprove that entropy regularization restores policy stability at the cost of\nincreased stochasticity. Our framework provides a unified explanation for\nrecent empirical findings on deceptive reasoning, instruction-following\ntrade-offs, and RLHF-induced sophistry, and is further validated through\nperturbation experiments in multi-reward RL. This work advances\npolicy-stability analysis from empirical heuristics towards a principled\ntheory, offering essential insights for designing safer and more trustworthy AI\nsystems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "RLHF", "reinforcement learning", "alignment"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20150", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20150", "abs": "https://arxiv.org/abs/2507.20150", "authors": ["Xingcheng Xu"], "title": "The Policy Cliff: A Theoretical Analysis of Reward-Policy Maps in Large Language Models", "comment": null, "summary": "Reinforcement learning (RL) plays a crucial role in shaping the behavior of\nlarge language and reasoning models (LLMs/LRMs). However, it often produces\nbrittle and unstable policies, leading to critical failures such as spurious\nreasoning, deceptive alignment, and instruction disobedience that undermine the\ntrustworthiness and safety of LLMs/LRMs. Currently, these issues lack a unified\ntheoretical explanation and are typically addressed using ad-hoc heuristics.\nThis paper presents a rigorous mathematical framework for analyzing the\nstability of the mapping from a reward function to the optimal policy. We show\nthat policy brittleness often stems from non-unique optimal actions, a common\noccurrence when multiple valid traces exist in a reasoning task. This\ntheoretical lens provides a unified explanation for a range of seemingly\ndisparate failures, reframing them as rational outcomes of optimizing rewards\nthat may be incomplete or noisy, especially in the presence of action\ndegeneracy. We extend this analysis from the fundamental single-reward setting\nto the more realistic multi-reward RL across diverse domains, showing how\nstability is governed by an \"effective reward\" aggregation mechanism. We also\nprove that entropy regularization restores policy stability at the cost of\nincreased stochasticity. Our framework provides a unified explanation for\nrecent empirical findings on deceptive reasoning, instruction-following\ntrade-offs, and RLHF-induced sophistry, and is further validated through\nperturbation experiments in multi-reward RL. This work advances\npolicy-stability analysis from empirical heuristics towards a principled\ntheory, offering essential insights for designing safer and more trustworthy AI\nsystems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "RLHF", "reinforcement learning", "alignment"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19725", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19725", "abs": "https://arxiv.org/abs/2507.19725", "authors": ["Leonardo Villalobos-Arias", "Grant Forbes", "Jianxun Wang", "David L Roberts", "Arnav Jhala"], "title": "Minding Motivation: The Effect of Intrinsic Motivation on Agent Behaviors", "comment": "11 pages, 7 figures, 3 tables", "summary": "Games are challenging for Reinforcement Learning~(RL) agents due to their\nreward-sparsity, as rewards are only obtainable after long sequences of\ndeliberate actions. Intrinsic Motivation~(IM) methods -- which introduce\nexploration rewards -- are an effective solution to reward-sparsity. However,\nIM also causes an issue known as `reward hacking' where the agent optimizes for\nthe new reward at the expense of properly playing the game. The larger problem\nis that reward hacking itself is largely unknown; there is no answer to\nwhether, and to what extent, IM rewards change the behavior of RL agents. This\nstudy takes a first step by empirically evaluating the impact on behavior of\nthree IM techniques on the MiniGrid game-like environment. We compare these IM\nmodels with Generalized Reward Matching~(GRM), a method that can be used with\nany intrinsic reward function to guarantee optimality. Our results suggest that\nIM causes noticeable change by increasing the initial rewards, but also\naltering the way the agent plays; and that GRM mitigated reward hacking in some\nscenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning", "reward hacking"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19679", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19679", "abs": "https://arxiv.org/abs/2507.19679", "authors": ["Mandar Kulkarni"], "title": "Efficient Learning for Product Attributes with Compact Multimodal Models", "comment": null, "summary": "Image-based product attribute prediction in e-commerce is a crucial task with\nnumerous applications. The supervised fine-tuning of Vision Language Models\n(VLMs) faces significant scale challenges due to the cost of manual or API\nbased annotation. In this paper, we investigate label-efficient semi-supervised\nfine-tuning strategies for compact VLMs (2B-3B parameters) that leverage\nunlabeled product listings through Direct Preference Optimization (DPO).\nBeginning with a small, API-based, annotated, and labeled set, we first employ\nPEFT to train low-rank adapter modules. To update the adapter weights with\nunlabeled data, we generate multiple reasoning-and-answer chains per unlabeled\nsample and segregate these chains into preferred and dispreferred based on\nself-consistency. We then fine-tune the model with DPO loss and use the updated\nmodel for the next iteration. By using PEFT fine-tuning with DPO, our method\nachieves efficient convergence with minimal compute overhead. On a dataset\nspanning twelve e-commerce verticals, DPO-based fine-tuning, which utilizes\nonly unlabeled data, demonstrates a significant improvement over the supervised\nmodel. Moreover, experiments demonstrate that accuracy with DPO training\nimproves with more unlabeled data, indicating that a large pool of unlabeled\nsamples can be effectively leveraged to improve performance.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation", "consistency", "accuracy"], "score": 4}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20067", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20067", "abs": "https://arxiv.org/abs/2507.20067", "authors": ["Sarat Chandra Bobbili", "Ujwal Dinesha", "Dheeraj Narasimha", "Srinivas Shakkottai"], "title": "PITA: Preference-Guided Inference-Time Alignment for LLM Post-Training", "comment": null, "summary": "Inference-time alignment enables large language models (LLMs) to generate\noutputs aligned with end-user preferences without further training. Recent\npost-training methods achieve this by using small guidance models to modify\ntoken generation during inference. These methods typically optimize a reward\nfunction KL-regularized by the original LLM taken as the reference policy. A\ncritical limitation, however, is their dependence on a pre-trained reward\nmodel, which requires fitting to human preference feedback--a potentially\nunstable process. In contrast, we introduce PITA, a novel framework that\nintegrates preference feedback directly into the LLM's token generation,\neliminating the need for a reward model. PITA learns a small preference-based\nguidance policy to modify token probabilities at inference time without LLM\nfine-tuning, reducing computational cost and bypassing the pre-trained reward\nmodel dependency. The problem is framed as identifying an underlying preference\ndistribution, solved through stochastic search and iterative refinement of the\npreference-based guidance model. We evaluate PITA across diverse tasks,\nincluding mathematical reasoning and sentiment classification, demonstrating\nits effectiveness in aligning LLM outputs with user preferences.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "inference time", "iterative refinement"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "preference", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference", "mathematical reasoning"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20566", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20566", "abs": "https://arxiv.org/abs/2507.20566", "authors": ["Jiajun Liu", "Wenjun Ke", "Peng Wang", "Yao He", "Ziyu Shang", "Guozheng Li", "Zijie Xu", "Ke Ji"], "title": "Unlearning of Knowledge Graph Embedding via Preference Optimization", "comment": null, "summary": "Existing knowledge graphs (KGs) inevitably contain outdated or erroneous\nknowledge that needs to be removed from knowledge graph embedding (KGE) models.\nTo address this challenge, knowledge unlearning can be applied to eliminate\nspecific information while preserving the integrity of the remaining knowledge\nin KGs. Existing unlearning methods can generally be categorized into exact\nunlearning and approximate unlearning. However, exact unlearning requires high\ntraining costs while approximate unlearning faces two issues when applied to\nKGs due to the inherent connectivity of triples: (1) It fails to fully remove\ntargeted information, as forgetting triples can still be inferred from\nremaining ones. (2) It focuses on local data for specific removal, which\nweakens the remaining knowledge in the forgetting boundary. To address these\nissues, we propose GraphDPO, a novel approximate unlearning framework based on\ndirect preference optimization (DPO). Firstly, to effectively remove forgetting\ntriples, we reframe unlearning as a preference optimization problem, where the\nmodel is trained by DPO to prefer reconstructed alternatives over the original\nforgetting triples. This formulation penalizes reliance on forgettable\nknowledge, mitigating incomplete forgetting caused by KG connectivity.\nMoreover, we introduce an out-boundary sampling strategy to construct\npreference pairs with minimal semantic overlap, weakening the connection\nbetween forgetting and retained knowledge. Secondly, to preserve boundary\nknowledge, we introduce a boundary recall mechanism that replays and distills\nrelevant information both within and across time steps. We construct eight\nunlearning datasets across four popular KGs with varying unlearning rates.\nExperiments show that GraphDPO outperforms state-of-the-art baselines by up to\n10.1% in MRR_Avg and 14.0% in MRR_F1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20181", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20181", "abs": "https://arxiv.org/abs/2507.20181", "authors": ["Hyeonji Lee", "Daejin Jo", "Seohwan Yun", "Sungwoong Kim"], "title": "SGPO: Self-Generated Preference Optimization based on Self-Improver", "comment": null, "summary": "Large language models (LLMs), despite their extensive pretraining on diverse\ndatasets, require effective alignment to human preferences for practical and\nreliable deployment. Conventional alignment methods typically employ off-policy\nlearning and depend on human-annotated datasets, which limits their broad\napplicability and introduces distribution shift issues during training. To\naddress these challenges, we propose Self-Generated Preference Optimization\nbased on Self-Improver (SGPO), an innovative alignment framework that leverages\nan on-policy self-improving mechanism. Specifically, the improver refines\nresponses from a policy model to self-generate preference data for direct\npreference optimization (DPO) of the policy model. Here, the improver and\npolicy are unified into a single model, and in order to generate higher-quality\npreference data, this self-improver learns to make incremental yet discernible\nimprovements to the current responses by referencing supervised fine-tuning\noutputs. Experimental results on AlpacaEval 2.0 and Arena-Hard show that the\nproposed SGPO significantly improves performance over DPO and baseline\nself-improving methods without using external preference data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20964", "categories": ["cs.AI", "cs.CC", "cs.GT", "cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2507.20964", "abs": "https://arxiv.org/abs/2507.20964", "authors": ["Aran Nayebi"], "title": "Core Safety Values for Provably Corrigible Agents", "comment": "14 pages", "summary": "We introduce the first implementable framework for corrigibility, with\nprovable guarantees in multi-step, partially observed environments. Our\nframework replaces a single opaque reward with five *structurally separate*\nutility heads -- deference, switch-access preservation, truthfulness,\nlow-impact behavior via a belief-based extension of Attainable Utility\nPreservation, and bounded task reward -- combined lexicographically by strict\nweight gaps. Theorem 1 proves exact single-round corrigibility in the partially\nobservable off-switch game; Theorem 3 extends the guarantee to multi-step,\nself-spawning agents, showing that even if each head is \\emph{learned} to\nmean-squared error $\\varepsilon$ and the planner is $\\varepsilon$-sub-optimal,\nthe probability of violating \\emph{any} safety property is bounded while still\nensuring net human benefit. In contrast to Constitutional AI or RLHF/RLAIF,\nwhich merge all norms into one learned scalar, our separation makes obedience\nand impact-limits dominate even when incentives conflict. For open-ended\nsettings where adversaries can modify the agent, we prove that deciding whether\nan arbitrary post-hack agent will ever violate corrigibility is undecidable by\nreduction to the halting problem, then carve out a finite-horizon ``decidable\nisland'' where safety can be certified in randomized polynomial time and\nverified with privacy-preserving, constant-round zero-knowledge proofs.\nConsequently, the remaining challenge is the ordinary ML task of data coverage\nand generalization: reward-hacking risk is pushed into evaluation quality\nrather than hidden incentive leak-through, giving clearer implementation\nguidance for today's LLM assistants and future autonomous systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "constitutional AI", "RLAIF"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "truthfulness", "safety"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19679", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19679", "abs": "https://arxiv.org/abs/2507.19679", "authors": ["Mandar Kulkarni"], "title": "Efficient Learning for Product Attributes with Compact Multimodal Models", "comment": null, "summary": "Image-based product attribute prediction in e-commerce is a crucial task with\nnumerous applications. The supervised fine-tuning of Vision Language Models\n(VLMs) faces significant scale challenges due to the cost of manual or API\nbased annotation. In this paper, we investigate label-efficient semi-supervised\nfine-tuning strategies for compact VLMs (2B-3B parameters) that leverage\nunlabeled product listings through Direct Preference Optimization (DPO).\nBeginning with a small, API-based, annotated, and labeled set, we first employ\nPEFT to train low-rank adapter modules. To update the adapter weights with\nunlabeled data, we generate multiple reasoning-and-answer chains per unlabeled\nsample and segregate these chains into preferred and dispreferred based on\nself-consistency. We then fine-tune the model with DPO loss and use the updated\nmodel for the next iteration. By using PEFT fine-tuning with DPO, our method\nachieves efficient convergence with minimal compute overhead. On a dataset\nspanning twelve e-commerce verticals, DPO-based fine-tuning, which utilizes\nonly unlabeled data, demonstrates a significant improvement over the supervised\nmodel. Moreover, experiments demonstrate that accuracy with DPO training\nimproves with more unlabeled data, indicating that a large pool of unlabeled\nsamples can be effectively leveraged to improve performance.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation", "consistency", "accuracy"], "score": 4}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20067", "categories": ["cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20067", "abs": "https://arxiv.org/abs/2507.20067", "authors": ["Sarat Chandra Bobbili", "Ujwal Dinesha", "Dheeraj Narasimha", "Srinivas Shakkottai"], "title": "PITA: Preference-Guided Inference-Time Alignment for LLM Post-Training", "comment": null, "summary": "Inference-time alignment enables large language models (LLMs) to generate\noutputs aligned with end-user preferences without further training. Recent\npost-training methods achieve this by using small guidance models to modify\ntoken generation during inference. These methods typically optimize a reward\nfunction KL-regularized by the original LLM taken as the reference policy. A\ncritical limitation, however, is their dependence on a pre-trained reward\nmodel, which requires fitting to human preference feedback--a potentially\nunstable process. In contrast, we introduce PITA, a novel framework that\nintegrates preference feedback directly into the LLM's token generation,\neliminating the need for a reward model. PITA learns a small preference-based\nguidance policy to modify token probabilities at inference time without LLM\nfine-tuning, reducing computational cost and bypassing the pre-trained reward\nmodel dependency. The problem is framed as identifying an underlying preference\ndistribution, solved through stochastic search and iterative refinement of the\npreference-based guidance model. We evaluate PITA across diverse tasks,\nincluding mathematical reasoning and sentiment classification, demonstrating\nits effectiveness in aligning LLM outputs with user preferences.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "inference time", "iterative refinement"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "preference", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference", "mathematical reasoning"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20181", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20181", "abs": "https://arxiv.org/abs/2507.20181", "authors": ["Hyeonji Lee", "Daejin Jo", "Seohwan Yun", "Sungwoong Kim"], "title": "SGPO: Self-Generated Preference Optimization based on Self-Improver", "comment": null, "summary": "Large language models (LLMs), despite their extensive pretraining on diverse\ndatasets, require effective alignment to human preferences for practical and\nreliable deployment. Conventional alignment methods typically employ off-policy\nlearning and depend on human-annotated datasets, which limits their broad\napplicability and introduces distribution shift issues during training. To\naddress these challenges, we propose Self-Generated Preference Optimization\nbased on Self-Improver (SGPO), an innovative alignment framework that leverages\nan on-policy self-improving mechanism. Specifically, the improver refines\nresponses from a policy model to self-generate preference data for direct\npreference optimization (DPO) of the policy model. Here, the improver and\npolicy are unified into a single model, and in order to generate higher-quality\npreference data, this self-improver learns to make incremental yet discernible\nimprovements to the current responses by referencing supervised fine-tuning\noutputs. Experimental results on AlpacaEval 2.0 and Arena-Hard show that the\nproposed SGPO significantly improves performance over DPO and baseline\nself-improving methods without using external preference data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19626", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.19626", "abs": "https://arxiv.org/abs/2507.19626", "authors": ["Adrian Celaya", "Tucker Netherton", "Dawid Schellingerhout", "Caroline Chung", "Beatrice Riviere", "David Fuentes"], "title": "Pre- and Post-Treatment Glioma Segmentation with the Medical Imaging Segmentation Toolkit", "comment": null, "summary": "Medical image segmentation continues to advance rapidly, yet rigorous\ncomparison between methods remains challenging due to a lack of standardized\nand customizable tooling. In this work, we present the current state of the\nMedical Imaging Segmentation Toolkit (MIST), with a particular focus on its\nflexible and modular postprocessing framework designed for the BraTS 2025 pre-\nand post-treatment glioma segmentation challenge. Since its debut in the 2024\nBraTS adult glioma post-treatment segmentation challenge, MIST's postprocessing\nmodule has been significantly extended to support a wide range of transforms,\nincluding removal or replacement of small objects, extraction of the largest\nconnected components, and morphological operations such as hole filling and\nclosing. These transforms can be composed into user-defined strategies,\nenabling fine-grained control over the final segmentation output. We evaluate\nthree such strategies - ranging from simple small-object removal to more\ncomplex, class-specific pipelines - and rank their performance using the BraTS\nranking protocol. Our results highlight how MIST facilitates rapid\nexperimentation and targeted refinement, ultimately producing high-quality\nsegmentations for the BraTS 2025 challenge. MIST remains open source and\nextensible, supporting reproducible and scalable research in medical image\nsegmentation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "ranking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20133", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20133", "abs": "https://arxiv.org/abs/2507.20133", "authors": ["Anas Mohamed", "Azal Ahmad Khan", "Xinran Wang", "Ahmad Faraz Khan", "Shuwen Ge", "Saman Bahzad Khan", "Ayaan Ahmad", "Ali Anwar"], "title": "Sem-DPO: Mitigating Semantic Inconsistency in Preference Optimization for Prompt Engineering", "comment": null, "summary": "Generative AI can now synthesize strikingly realistic images from text, yet\noutput quality remains highly sensitive to how prompts are phrased. Direct\nPreference Optimization (DPO) offers a lightweight, off-policy alternative to\nRL for automatic prompt engineering, but its token-level regularization leaves\nsemantic inconsistency unchecked as prompts that win higher preference scores\ncan still drift away from the user's intended meaning.\n  We introduce Sem-DPO, a variant of DPO that preserves semantic consistency\nyet retains its simplicity and efficiency. Sem-DPO scales the DPO loss by an\nexponential weight proportional to the cosine distance between the original\nprompt and winning candidate in embedding space, softly down-weighting training\nsignals that would otherwise reward semantically mismatched prompts. We provide\nthe first analytical bound on semantic drift for preference-tuned prompt\ngenerators, showing that Sem-DPO keeps learned prompts within a provably\nbounded neighborhood of the original text. On three standard text-to-image\nprompt-optimization benchmarks and two language models, Sem-DPO achieves 8-12%\nhigher CLIP similarity and 5-9% higher human-preference scores (HPSv2.1,\nPickScore) than DPO, while also outperforming state-of-the-art baselines. These\nfindings suggest that strong flat baselines augmented with semantic weighting\nshould become the new standard for prompt-optimization studies and lay the\ngroundwork for broader, semantics-aware preference optimization in language\nmodels.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20187", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20187", "abs": "https://arxiv.org/abs/2507.20187", "authors": ["Yumeng Wang", "Zhiyuan Fan", "Jiayu Liu", "Yi R. Fung"], "title": "Diversity-Enhanced Reasoning for Subjective Questions", "comment": null, "summary": "Large reasoning models (LRM) with long chain-of-thought (CoT) capabilities\nhave shown strong performance on objective tasks, such as math reasoning and\ncoding. However, their effectiveness on subjective questions that may have\ndifferent responses from different perspectives is still limited by a tendency\ntowards homogeneous reasoning, introduced by the reliance on a single ground\ntruth in supervised fine-tuning and verifiable reward in reinforcement\nlearning. Motivated by the finding that increasing role perspectives\nconsistently improves performance, we propose MultiRole-R1, a\ndiversity-enhanced framework with multiple role perspectives, to improve the\naccuracy and diversity in subjective reasoning tasks. MultiRole-R1 features an\nunsupervised data construction pipeline that generates reasoning chains that\nincorporate diverse role perspectives. We further employ reinforcement learning\nvia Group Relative Policy Optimization (GRPO) with reward shaping, by taking\ndiversity as a reward signal in addition to the verifiable reward. With\nspecially designed reward functions, we successfully promote perspective\ndiversity and lexical diversity, uncovering a positive relation between\nreasoning diversity and accuracy. Our experiment on six benchmarks demonstrates\nMultiRole-R1's effectiveness and generalizability in enhancing both subjective\nand objective reasoning, showcasing the potential of diversity-enhanced\ntraining in LRMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20783", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20783", "abs": "https://arxiv.org/abs/2507.20783", "authors": ["Meishan Zhang", "Xin Zhang", "Xinping Zhao", "Shouzheng Huang", "Baotian Hu", "Min Zhang"], "title": "On The Role of Pretrained Language Models in General-Purpose Text Embeddings: A Survey", "comment": "45 pages, 2 figures, 9 tables", "summary": "Text embeddings have attracted growing interest due to their effectiveness\nacross a wide range of natural language processing (NLP) tasks, such as\nretrieval, classification, clustering, bitext mining, and summarization. With\nthe emergence of pretrained language models (PLMs), general-purpose text\nembeddings (GPTE) have gained significant traction for their ability to produce\nrich, transferable representations. The general architecture of GPTE typically\nleverages PLMs to derive dense text representations, which are then optimized\nthrough contrastive learning on large-scale pairwise datasets. In this survey,\nwe provide a comprehensive overview of GPTE in the era of PLMs, focusing on the\nroles PLMs play in driving its development. We first examine the fundamental\narchitecture and describe the basic roles of PLMs in GPTE, i.e., embedding\nextraction, expressivity enhancement, training strategies, learning objectives,\nand data construction. Then, we describe advanced roles enabled by PLMs, such\nas multilingual support, multimodal integration, code understanding, and\nscenario-specific adaptation. Finally, we highlight potential future research\ndirections that move beyond traditional improvement goals, including ranking\nintegration, safety considerations, bias mitigation, structural information\nincorporation, and the cognitive extension of embeddings. This survey aims to\nserve as a valuable reference for both newcomers and established researchers\nseeking to understand the current state and future potential of GPTE.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking", "pairwise"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety", "summarization"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20133", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20133", "abs": "https://arxiv.org/abs/2507.20133", "authors": ["Anas Mohamed", "Azal Ahmad Khan", "Xinran Wang", "Ahmad Faraz Khan", "Shuwen Ge", "Saman Bahzad Khan", "Ayaan Ahmad", "Ali Anwar"], "title": "Sem-DPO: Mitigating Semantic Inconsistency in Preference Optimization for Prompt Engineering", "comment": null, "summary": "Generative AI can now synthesize strikingly realistic images from text, yet\noutput quality remains highly sensitive to how prompts are phrased. Direct\nPreference Optimization (DPO) offers a lightweight, off-policy alternative to\nRL for automatic prompt engineering, but its token-level regularization leaves\nsemantic inconsistency unchecked as prompts that win higher preference scores\ncan still drift away from the user's intended meaning.\n  We introduce Sem-DPO, a variant of DPO that preserves semantic consistency\nyet retains its simplicity and efficiency. Sem-DPO scales the DPO loss by an\nexponential weight proportional to the cosine distance between the original\nprompt and winning candidate in embedding space, softly down-weighting training\nsignals that would otherwise reward semantically mismatched prompts. We provide\nthe first analytical bound on semantic drift for preference-tuned prompt\ngenerators, showing that Sem-DPO keeps learned prompts within a provably\nbounded neighborhood of the original text. On three standard text-to-image\nprompt-optimization benchmarks and two language models, Sem-DPO achieves 8-12%\nhigher CLIP similarity and 5-9% higher human-preference scores (HPSv2.1,\nPickScore) than DPO, while also outperforming state-of-the-art baselines. These\nfindings suggest that strong flat baselines augmented with semantic weighting\nshould become the new standard for prompt-optimization studies and lay the\ngroundwork for broader, semantics-aware preference optimization in language\nmodels.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "DPO"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19836", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.MM", "cs.SD"], "pdf": "https://arxiv.org/pdf/2507.19836", "abs": "https://arxiv.org/abs/2507.19836", "authors": ["Xuanchen Wang", "Heng Wang", "Weidong Cai"], "title": "ChoreoMuse: Robust Music-to-Dance Video Generation with Style Transfer and Beat-Adherent Motion", "comment": "10 pages, 5 figures, accepted by the 33rd ACM International\n  Conference on Multimedia (ACM MM 2025), demo page:\n  https://choreomuse.github.io", "summary": "Modern artistic productions increasingly demand automated choreography\ngeneration that adapts to diverse musical styles and individual dancer\ncharacteristics. Existing approaches often fail to produce high-quality dance\nvideos that harmonize with both musical rhythm and user-defined choreography\nstyles, limiting their applicability in real-world creative contexts. To\naddress this gap, we introduce ChoreoMuse, a diffusion-based framework that\nuses SMPL format parameters and their variation version as intermediaries\nbetween music and video generation, thereby overcoming the usual constraints\nimposed by video resolution. Critically, ChoreoMuse supports\nstyle-controllable, high-fidelity dance video generation across diverse musical\ngenres and individual dancer characteristics, including the flexibility to\nhandle any reference individual at any resolution. Our method employs a novel\nmusic encoder MotionTune to capture motion cues from audio, ensuring that the\ngenerated choreography closely follows the beat and expressive qualities of the\ninput music. To quantitatively evaluate how well the generated dances match\nboth musical and choreographic styles, we introduce two new metrics that\nmeasure alignment with the intended stylistic cues. Extensive experiments\nconfirm that ChoreoMuse achieves state-of-the-art performance across multiple\ndimensions, including video quality, beat alignment, dance diversity, and style\nadherence, demonstrating its potential as a robust solution for a wide range of\ncreative applications. Video results can be found on our project page:\nhttps://choreomuse.github.io.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19788", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19788", "abs": "https://arxiv.org/abs/2507.19788", "authors": ["Rifny Rachman", "Josh Tingey", "Richard Allmendinger", "Pradyumn Shukla", "Wei Pan"], "title": "Reinforcement Learning for Multi-Objective Multi-Echelon Supply Chain Optimisation", "comment": null, "summary": "This study develops a generalised multi-objective, multi-echelon supply chain\noptimisation model with non-stationary markets based on a Markov decision\nprocess, incorporating economic, environmental, and social considerations. The\nmodel is evaluated using a multi-objective reinforcement learning (RL) method,\nbenchmarked against an originally single-objective RL algorithm modified with\nweighted sum using predefined weights, and a multi-objective evolutionary\nalgorithm (MOEA)-based approach. We conduct experiments on varying network\ncomplexities, mimicking typical real-world challenges using a customisable\nsimulator. The model determines production and delivery quantities across\nsupply chain routes to achieve near-optimal trade-offs between competing\nobjectives, approximating Pareto front sets. The results demonstrate that the\nprimary approach provides the most balanced trade-off between optimality,\ndiversity, and density, further enhanced with a shared experience buffer that\nallows knowledge transfer among policies. In complex settings, it achieves up\nto 75\\% higher hypervolume than the MOEA-based method and generates solutions\nthat are approximately eleven times denser, signifying better robustness, than\nthose produced by the modified single-objective RL method. Moreover, it ensures\nstable production and inventory levels while minimising demand loss.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19748", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.19748", "abs": "https://arxiv.org/abs/2507.19748", "authors": ["Yifan Hao", "Fangning Chao", "Yaqian Hao", "Zhaojun Cui", "Huan Bai", "Haiyu Zhang", "Yankai Liu", "Chao Deng", "Junlan Feng"], "title": "JT-Math: A Multi-Stage Framework for Advanced Mathematical Reasoning in Large Language Models", "comment": null, "summary": "Mathematical reasoning is a cornerstone of artificial general intelligence\nand a primary benchmark for evaluating the capabilities of Large Language\nModels (LLMs). While state-of-the-art models show promise, they often falter\nwhen faced with complex problems that demand deep conceptual understanding and\nintricate, multi-step deliberation. To address this challenge, we introduce\nJT-Math-8B, a series of open-source models comprising base, instruct, and\nthinking versions, built upon a systematic, multi-stage optimization framework.\nOur pre-training corpus is a high-quality, 210B-token dataset curated through a\ndedicated data pipeline that uses model-based validation to ensure quality and\ndiversity. The Instruct Model is optimized for direct, concise answers through\nSupervised Fine-Tuning (SFT) and a GRPO-based reinforcement learning (RL)\nmethod. The Thinking Model is trained for complex problem-solving using a Long\nChain-of-Thought (Long CoT) approach, combining SFT with a novel, multi-stage\nRL curriculum that progressively increases task difficulty and context length\nup to 32K tokens. JT-Math-8B achieves state-of-the-art results among\nopen-source models of similar size, surpassing prominent models like OpenAI's\nO1-mini and GPT-4o , and demonstrating superior performance on\ncompetition-level mathematics.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["o1"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "mathematical reasoning"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19766", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19766", "abs": "https://arxiv.org/abs/2507.19766", "authors": ["Dong Du", "Shulin Liu", "Tao Yang", "Shaohua Chen", "Yang Li"], "title": "UloRL:An Ultra-Long Output Reinforcement Learning Approach for Advancing Large Language Models' Reasoning Abilities", "comment": "12 pages", "summary": "Recent advances in large language models (LLMs) have highlighted the\npotential of reinforcement learning with verifiable rewards (RLVR) to enhance\nreasoning capabilities through extended output sequences. However, traditional\nRL frameworks face inefficiencies when handling ultra-long outputs due to\nlong-tail sequence distributions and entropy collapse during training. To\naddress these challenges, we propose an Ultra-Long Output Reinforcement\nLearning (UloRL) approach for advancing large language models' reasoning\nabilities. Specifically, we divide ultra long output decoding into short\nsegments, enabling efficient training by mitigating delays caused by long-tail\nsamples. Additionally, we introduce dynamic masking of well-Mastered Positive\nTokens (MPTs) to prevent entropy collapse. Experimental results demonstrate the\neffectiveness of our approach. On the Qwen3-30B-A3B model, RL with segment\nrollout achieved 2.06x increase in training speed, while RL training with\n128k-token outputs improves the model's performance on AIME2025 from 70.9\\% to\n85.1\\% and on BeyondAIME from 50.7\\% to 61.9\\%, even surpassing Qwen3-235B-A22B\nwith remarkable gains. These findings underscore the potential of our methods\nto advance the reasoning capabilities of LLMs with ultra-long sequence\ngeneration. We will release our code and model for further use by the\ncommunity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20000", "categories": ["cs.AI", "cs.DL"], "pdf": "https://arxiv.org/pdf/2507.20000", "abs": "https://arxiv.org/abs/2507.20000", "authors": ["Renaud Fabre", "Daniel Egret", "Patrice Bellot"], "title": "Matching Game Preferences Through Dialogical Large Language Models: A Perspective", "comment": "28 pages, 1 figure. Published in Applied Sciences", "summary": "This perspective paper explores the future potential of \"conversational\nintelligence\" by examining how Large Language Models (LLMs) could be combined\nwith GRAPHYP's network system to better understand human conversations and\npreferences. Using recent research and case studies, we propose a conceptual\nframework that could make AI rea-soning transparent and traceable, allowing\nhumans to see and understand how AI reaches its conclusions. We present the\nconceptual perspective of \"Matching Game Preferences through Dialogical Large\nLanguage Models (D-LLMs),\" a proposed system that would allow multiple users to\nshare their different preferences through structured conversations. This\napproach envisions personalizing LLMs by embedding individual user preferences\ndirectly into how the model makes decisions. The proposed D-LLM framework would\nrequire three main components: (1) reasoning processes that could analyze\ndifferent search experiences and guide performance, (2) classification systems\nthat would identify user preference patterns, and (3) dialogue approaches that\ncould help humans resolve conflicting information. This perspective framework\naims to create an interpretable AI system where users could examine,\nunderstand, and combine the different human preferences that influence AI\nresponses, detected through GRAPHYP's search experience networks. The goal of\nthis perspective is to envision AI systems that would not only provide answers\nbut also show users how those answers were reached, making artificial\nintelligence more transparent and trustworthy for human decision-making.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20010", "categories": ["cs.AI", "cs.GT", "cs.LO"], "pdf": "https://arxiv.org/pdf/2507.20010", "abs": "https://arxiv.org/abs/2507.20010", "authors": ["Müge Fidan", "Esra Erdem"], "title": "Finding Personalized Good-Enough Solutions to Unsatisfiable Stable Roommates Problems", "comment": null, "summary": "The Stable Roommates problems are characterized by the preferences of agents\nover other agents as roommates. A solution is a partition of the agents into\npairs that are acceptable to each other (i.e., they are in the preference lists\nof each other), and the matching is stable (i.e., there do not exist any two\nagents who prefer each other to their roommates, and thus block the matching).\nMotivated by real-world applications, and considering that stable roommates\nproblems do not always have solutions, we continue our studies to compute\n\"good-enough\" matchings. In addition to the agents' habits and habitual\npreferences, we consider their networks of preferred friends, and introduce a\nmethod to generate personalized solutions to stable roommates problems. We\nillustrate the usefulness of our method with examples and empirical\nevaluations.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20143", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20143", "abs": "https://arxiv.org/abs/2507.20143", "authors": ["Zhonghan Ge", "Yuanyang Zhu", "Chunlin Chen"], "title": "Concept Learning for Cooperative Multi-Agent Reinforcement Learning", "comment": "IEEE-China Conference on System Simulation Technology and its\n  Applications, 2025", "summary": "Despite substantial progress in applying neural networks (NN) to multi-agent\nreinforcement learning (MARL) areas, they still largely suffer from a lack of\ntransparency and interoperability. However, its implicit cooperative mechanism\nis not yet fully understood due to black-box networks. In this work, we study\nan interpretable value decomposition framework via concept bottleneck models,\nwhich promote trustworthiness by conditioning credit assignment on an\nintermediate level of human-like cooperation concepts. To address this problem,\nwe propose a novel value-based method, named Concepts learning for Multi-agent\nQ-learning (CMQ), that goes beyond the current performance-vs-interpretability\ntrade-off by learning interpretable cooperation concepts. CMQ represents each\ncooperation concept as a supervised vector, as opposed to existing models where\nthe information flowing through their end-to-end mechanism is concept-agnostic.\nIntuitively, using individual action value conditioning on global state\nembeddings to represent each concept allows for extra cooperation\nrepresentation capacity. Empirical evaluations on the StarCraft II\nmicromanagement challenge and level-based foraging (LBF) show that CMQ achieves\nsuperior performance compared with the state-of-the-art counterparts. The\nresults also demonstrate that CMQ provides more cooperation concept\nrepresentation capturing meaningful cooperation modes, and supports test-time\nconcept interventions for detecting potential biases of cooperation mode and\nidentifying spurious artifacts that impact cooperation.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19962", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.19962", "abs": "https://arxiv.org/abs/2507.19962", "authors": ["Seorin Kim", "Dongyoung Lee", "Jaejin Lee"], "title": "KLAAD: Refining Attention Mechanisms to Reduce Societal Bias in Generative Language Models", "comment": null, "summary": "Large language models (LLMs) often exhibit societal biases in their outputs,\nprompting ethical concerns regarding fairness and harm. In this work, we\npropose KLAAD (KL-Attention Alignment Debiasing), an attention-based debiasing\nframework that implicitly aligns attention distributions between stereotypical\nand anti-stereotypical sentence pairs without directly modifying model weights.\nKLAAD introduces a composite training objective combining Cross-Entropy, KL\ndivergence, and Triplet losses, guiding the model to consistently attend across\nbiased and unbiased contexts while preserving fluency and coherence.\nExperimental evaluation of KLAAD demonstrates improved bias mitigation on both\nthe BBQ and BOLD benchmarks, with minimal impact on language modeling quality.\nThe results indicate that attention-level alignment offers a principled\nsolution for mitigating bias in generative language models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19804", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.19804", "abs": "https://arxiv.org/abs/2507.19804", "authors": ["Peng Cai", "Qiang Li", "Kaicheng Yang", "Dong Guo", "Jia Li", "Nan Zhou", "Xiang An", "Ninghua Yang", "Jiankang Deng"], "title": "ForCenNet: Foreground-Centric Network for Document Image Rectification", "comment": "Accepted by ICCV25, 16 pages, 14 figures", "summary": "Document image rectification aims to eliminate geometric deformation in\nphotographed documents to facilitate text recognition. However, existing\nmethods often neglect the significance of foreground elements, which provide\nessential geometric references and layout information for document image\ncorrection. In this paper, we introduce Foreground-Centric Network (ForCenNet)\nto eliminate geometric distortions in document images. Specifically, we\ninitially propose a foreground-centric label generation method, which extracts\ndetailed foreground elements from an undistorted image. Then we introduce a\nforeground-centric mask mechanism to enhance the distinction between readable\nand background regions. Furthermore, we design a curvature consistency loss to\nleverage the detailed foreground labels to help the model understand the\ndistorted geometric distribution. Extensive experiments demonstrate that\nForCenNet achieves new state-of-the-art on four real-world benchmarks, such as\nDocUNet, DIR300, WarpDoc, and DocReal. Quantitative analysis shows that the\nproposed method effectively undistorts layout elements, such as text lines and\ntable borders. The resources for further comparison are provided at\nhttps://github.com/caipeng328/ForCenNet.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20333", "categories": ["cs.AI", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2507.20333", "abs": "https://arxiv.org/abs/2507.20333", "authors": ["Rachel S. Y. Teo", "Laziz U. Abdullaev", "Tan M. Nguyen"], "title": "The Blessing and Curse of Dimensionality in Safety Alignment", "comment": "Published as a conference paper at COLM 2025", "summary": "The focus on safety alignment in large language models (LLMs) has increased\nsignificantly due to their widespread adoption across different domains. The\nscale of LLMs play a contributing role in their success, and the growth in\nparameter count follows larger hidden dimensions. In this paper, we hypothesize\nthat while the increase in dimensions has been a key advantage, it may lead to\nemergent problems as well. These problems emerge as the linear structures in\nthe activation space can be exploited, in the form of activation engineering,\nto circumvent its safety alignment. Through detailed visualizations of linear\nsubspaces associated with different concepts, such as safety, across various\nmodel scales, we show that the curse of high-dimensional representations\nuniquely impacts LLMs. Further substantiating our claim, we demonstrate that\nprojecting the representations of the model onto a lower dimensional subspace\ncan preserve sufficient information for alignment while avoiding those linear\nstructures. Empirical results confirm that such dimensional reduction\nsignificantly reduces susceptibility to jailbreaking through representation\nengineering. Building on our empirical validations, we provide theoretical\ninsights into these linear jailbreaking methods relative to a model's hidden\ndimensions. Broadly speaking, our work posits that the high dimensions of a\nmodel's internal representations can be both a blessing and a curse in safety\nalignment.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20377", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20377", "abs": "https://arxiv.org/abs/2507.20377", "authors": ["Farshid Nooshi", "Suining He"], "title": "Multi-Agent Reinforcement Learning for Dynamic Mobility Resource Allocation with Hierarchical Adaptive Grouping", "comment": "5 pages, UrbComp 2025", "summary": "Allocating mobility resources (e.g., shared bikes/e-scooters, ride-sharing\nvehicles) is crucial for rebalancing the mobility demand and supply in the\nurban environments. We propose in this work a novel multi-agent reinforcement\nlearning named Hierarchical Adaptive Grouping-based Parameter Sharing (HAG-PS)\nfor dynamic mobility resource allocation. HAG-PS aims to address two important\nresearch challenges regarding multi-agent reinforcement learning for mobility\nresource allocation: (1) how to dynamically and adaptively share the mobility\nresource allocation policy (i.e., how to distribute mobility resources) across\nagents (i.e., representing the regional coordinators of mobility resources);\nand (2) how to achieve memory-efficient parameter sharing in an urban-scale\nsetting. To address the above challenges, we have provided following novel\ndesigns within HAG-PS. To enable dynamic and adaptive parameter sharing, we\nhave designed a hierarchical approach that consists of global and local\ninformation of the mobility resource states (e.g., distribution of mobility\nresources). We have developed an adaptive agent grouping approach in order to\nsplit or merge the groups of agents based on their relative closeness of\nencoded trajectories (i.e., states, actions, and rewards). We have designed a\nlearnable identity (ID) embeddings to enable agent specialization beyond simple\nparameter copy. We have performed extensive experimental studies based on\nreal-world NYC bike sharing data (a total of more than 1.2 million trips), and\ndemonstrated the superior performance (e.g., improved bike availability) of\nHAG-PS compared with other baseline approaches.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19840", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.19840", "abs": "https://arxiv.org/abs/2507.19840", "authors": ["Samuel Ebimobowei Johnny", "Blessed Guda", "Andrew Blayama Stephen", "Assane Gueye"], "title": "AutoSign: Direct Pose-to-Text Translation for Continuous Sign Language Recognition", "comment": "Paper to appear at the 1st Workshop in Multimodal Sign Language\n  Recognition at ICCV 2025", "summary": "Continuously recognizing sign gestures and converting them to glosses plays a\nkey role in bridging the gap between the hearing and hearing-impaired\ncommunities. This involves recognizing and interpreting the hands, face, and\nbody gestures of the signer, which pose a challenge as it involves a\ncombination of all these features. Continuous Sign Language Recognition (CSLR)\nmethods rely on multi-stage pipelines that first extract visual features, then\nalign variable-length sequences with target glosses using CTC or HMM-based\napproaches. However, these alignment-based methods suffer from error\npropagation across stages, overfitting, and struggle with vocabulary\nscalability due to the intermediate gloss representation bottleneck. To address\nthese limitations, we propose AutoSign, an autoregressive decoder-only\ntransformer that directly translates pose sequences to natural language text,\nbypassing traditional alignment mechanisms entirely. The use of this\ndecoder-only approach allows the model to directly map between the features and\nthe glosses without the need for CTC loss while also directly learning the\ntextual dependencies in the glosses. Our approach incorporates a temporal\ncompression module using 1D CNNs to efficiently process pose sequences,\nfollowed by AraGPT2, a pre-trained Arabic decoder, to generate text (glosses).\nThrough comprehensive ablation studies, we demonstrate that hand and body\ngestures provide the most discriminative features for signer-independent CSLR.\nBy eliminating the multi-stage pipeline, AutoSign achieves substantial\nimprovements on the Isharah-1000 dataset, achieving an improvement of up to\n6.1\\% in WER score compared to the best existing method.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20046", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20046", "abs": "https://arxiv.org/abs/2507.20046", "authors": ["Akash Ghosh", "Aparna Garimella", "Pritika Ramu", "Sambaran Bandyopadhyay", "Sriparna Saha"], "title": "Infogen: Generating Complex Statistical Infographics from Documents", "comment": "ACL Main 2025", "summary": "Statistical infographics are powerful tools that simplify complex data into\nvisually engaging and easy-to-understand formats. Despite advancements in AI,\nparticularly with LLMs, existing efforts have been limited to generating simple\ncharts, with no prior work addressing the creation of complex infographics from\ntext-heavy documents that demand a deep understanding of the content. We\naddress this gap by introducing the task of generating statistical infographics\ncomposed of multiple sub-charts (e.g., line, bar, pie) that are contextually\naccurate, insightful, and visually aligned. To achieve this, we define\ninfographic metadata that includes its title and textual insights, along with\nsub-chart-specific details such as their corresponding data and alignment. We\nalso present Infodat, the first benchmark dataset for text-to-infographic\nmetadata generation, where each sample links a document to its metadata. We\npropose Infogen, a two-stage framework where fine-tuned LLMs first generate\nmetadata, which is then converted into infographic code. Extensive evaluations\non Infodat demonstrate that Infogen achieves state-of-the-art performance,\noutperforming both closed and open-source LLMs in text-to-statistical\ninfographic generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20152", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20152", "abs": "https://arxiv.org/abs/2507.20152", "authors": ["Shuhaib Mehri", "Xiaocheng Yang", "Takyoung Kim", "Gokhan Tur", "Shikib Mehri", "Dilek Hakkani-Tür"], "title": "Goal Alignment in LLM-Based User Simulators for Conversational AI", "comment": null, "summary": "User simulators are essential to conversational AI, enabling scalable agent\ndevelopment and evaluation through simulated interactions. While current Large\nLanguage Models (LLMs) have advanced user simulation capabilities, we reveal\nthat they struggle to consistently demonstrate goal-oriented behavior across\nmulti-turn conversations--a critical limitation that compromises their\nreliability in downstream applications. We introduce User Goal State Tracking\n(UGST), a novel framework that tracks user goal progression throughout\nconversations. Leveraging UGST, we present a three-stage methodology for\ndeveloping user simulators that can autonomously track goal progression and\nreason to generate goal-aligned responses. Moreover, we establish comprehensive\nevaluation metrics for measuring goal alignment in user simulators, and\ndemonstrate that our approach yields substantial improvements across two\nbenchmarks (MultiWOZ 2.4 and {\\tau}-Bench). Our contributions address a\ncritical gap in conversational AI and establish UGST as an essential framework\nfor developing goal-aligned user simulators.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "reliability"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19924", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.19924", "abs": "https://arxiv.org/abs/2507.19924", "authors": ["Chang Liu", "Yunfan Ye", "Fan Zhang", "Qingyang Zhou", "Yuchuan Luo", "Zhiping Cai"], "title": "HumanSAM: Classifying Human-centric Forgery Videos in Human Spatial, Appearance, and Motion Anomaly", "comment": "ICCV 2025. Project page: https://dejian-lc.github.io/humansam/", "summary": "Numerous synthesized videos from generative models, especially human-centric\nones that simulate realistic human actions, pose significant threats to human\ninformation security and authenticity. While progress has been made in binary\nforgery video detection, the lack of fine-grained understanding of forgery\ntypes raises concerns regarding both reliability and interpretability, which\nare critical for real-world applications. To address this limitation, we\npropose HumanSAM, a new framework that builds upon the fundamental challenges\nof video generation models. Specifically, HumanSAM aims to classify\nhuman-centric forgeries into three distinct types of artifacts commonly\nobserved in generated content: spatial, appearance, and motion anomaly.To\nbetter capture the features of geometry, semantics and spatiotemporal\nconsistency, we propose to generate the human forgery representation by fusing\ntwo branches of video understanding and spatial depth. We also adopt a\nrank-based confidence enhancement strategy during the training process to learn\nmore robust representation by introducing three prior scores. For training and\nevaluation, we construct the first public benchmark, the Human-centric Forgery\nVideo (HFV) dataset, with all types of forgeries carefully annotated\nsemi-automatically. In our experiments, HumanSAM yields promising results in\ncomparison with state-of-the-art methods, both in binary and multi-class\nforgery classification.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "consistency", "reliability", "fine-grained"], "score": 6}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20774", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20774", "abs": "https://arxiv.org/abs/2507.20774", "authors": ["Fatou Ndiaye Mbodji"], "title": "evalSmarT: An LLM-Based Framework for Evaluating Smart Contract Generated Comments", "comment": "4 pages, 4 tables", "summary": "Smart contract comment generation has gained traction as a means to improve\ncode comprehension and maintainability in blockchain systems. However,\nevaluating the quality of generated comments remains a challenge. Traditional\nmetrics such as BLEU and ROUGE fail to capture domain-specific nuances, while\nhuman evaluation is costly and unscalable. In this paper, we present\n\\texttt{evalSmarT}, a modular and extensible framework that leverages large\nlanguage models (LLMs) as evaluators. The system supports over 400 evaluator\nconfigurations by combining approximately 40 LLMs with 10 prompting strategies.\nWe demonstrate its application in benchmarking comment generation tools and\nselecting the most informative outputs. Our results show that prompt design\nsignificantly impacts alignment with human judgment, and that LLM-based\nevaluation offers a scalable and semantically rich alternative to existing\nmethods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20252", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20252", "abs": "https://arxiv.org/abs/2507.20252", "authors": ["Xiang Fei", "Siqi Wang", "Shu Wei", "Yuxiang Nie", "Wei Shi", "Hao Feng", "Can Huang"], "title": "Post-Completion Learning for Language Models", "comment": null, "summary": "Current language model training paradigms typically terminate learning upon\nreaching the end-of-sequence (<eos>}) token, overlooking the potential learning\nopportunities in the post-completion space. We propose Post-Completion Learning\n(PCL), a novel training framework that systematically utilizes the sequence\nspace after model output completion, to enhance both the reasoning and\nself-evaluation abilities. PCL enables models to continue generating\nself-assessments and reward predictions during training, while maintaining\nefficient inference by stopping at the completion point.\n  To fully utilize this post-completion space, we design a white-box\nreinforcement learning method: let the model evaluate the output content\naccording to the reward rules, then calculate and align the score with the\nreward functions for supervision. We implement dual-track SFT to optimize both\nreasoning and evaluation capabilities, and mixed it with RL training to achieve\nmulti-objective hybrid optimization.\n  Experimental results on different datasets and models demonstrate consistent\nimprovements over traditional SFT and RL methods. Our method provides a new\ntechnical path for language model training that enhances output quality while\npreserving deployment efficiency.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20264", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20264", "abs": "https://arxiv.org/abs/2507.20264", "authors": ["Abeer Aldayel", "Areej Alokaili"], "title": "EMBRACE: Shaping Inclusive Opinion Representation by Aligning Implicit Conversations with Social Norms", "comment": "Under review for publication", "summary": "Shaping inclusive representations that embrace diversity and ensure fair\nparticipation and reflections of values is at the core of many\nconversation-based models. However, many existing methods rely on surface\ninclusion using mention of user demographics or behavioral attributes of social\ngroups. Such methods overlook the nuanced, implicit expression of opinion\nembedded in conversations. Furthermore, the over-reliance on overt cues can\nexacerbate misalignment and reinforce harmful or stereotypical representations\nin model outputs. Thus, we took a step back and recognized that equitable\ninclusion needs to account for the implicit expression of opinion and use the\nstance of responses to validate the normative alignment. This study aims to\nevaluate how opinions are represented in NLP or computational models by\nintroducing an alignment evaluation framework that foregrounds implicit, often\noverlooked conversations and evaluates the normative social views and\ndiscourse. Our approach models the stance of responses as a proxy for the\nunderlying opinion, enabling a considerate and reflective representation of\ndiverse social viewpoints. We evaluate the framework using both (i)\npositive-unlabeled (PU) online learning with base classifiers, and (ii)\ninstruction-tuned language models to assess post-training alignment. Through\nthis, we provide a lens on how implicit opinions are (mis)represented and offer\na pathway toward more inclusive model behavior.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19950", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19950", "abs": "https://arxiv.org/abs/2507.19950", "authors": ["Chengyu Zheng", "Jin Huang", "Honghua Chen", "Mingqiang Wei"], "title": "RARE: Refine Any Registration of Pairwise Point Clouds via Zero-Shot Learning", "comment": null, "summary": "Recent research leveraging large-scale pretrained diffusion models has\ndemonstrated the potential of using diffusion features to establish semantic\ncorrespondences in images. Inspired by advancements in diffusion-based\ntechniques, we propose a novel zero-shot method for refining point cloud\nregistration algorithms. Our approach leverages correspondences derived from\ndepth images to enhance point feature representations, eliminating the need for\na dedicated training dataset. Specifically, we first project the point cloud\ninto depth maps from multiple perspectives and extract implicit knowledge from\na pretrained diffusion network as depth diffusion features. These features are\nthen integrated with geometric features obtained from existing methods to\nestablish more accurate correspondences between point clouds. By leveraging\nthese refined correspondences, our approach achieves significantly improved\nregistration accuracy. Extensive experiments demonstrate that our method not\nonly enhances the performance of existing point cloud registration techniques\nbut also exhibits robust generalization capabilities across diverse datasets.\nCodes are available at https://github.com/zhengcy-lambo/RARE.git.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20352", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20352", "abs": "https://arxiv.org/abs/2507.20352", "authors": ["Hao Xiang", "Tianyi Tang", "Yang Su", "Bowen Yu", "An Yang", "Fei Huang", "Yichang Zhang", "Yaojie Lu", "Hongyu Lin", "Xianpei Han", "Jingren Zhou", "Junyang Lin", "Le Sun"], "title": "RMTBench: Benchmarking LLMs Through Multi-Turn User-Centric Role-Playing", "comment": null, "summary": "Recent advancements in Large Language Models (LLMs) have shown outstanding\npotential for role-playing applications. Evaluating these capabilities is\nbecoming crucial yet remains challenging. Existing benchmarks mostly adopt a\n\\textbf{character-centric} approach, simplify user-character interactions to\nisolated Q&A tasks, and fail to reflect real-world applications. To address\nthis limitation, we introduce RMTBench, a comprehensive \\textbf{user-centric}\nbilingual role-playing benchmark featuring 80 diverse characters and over 8,000\ndialogue rounds. RMTBench includes custom characters with detailed backgrounds\nand abstract characters defined by simple traits, enabling evaluation across\nvarious user scenarios. Our benchmark constructs dialogues based on explicit\nuser motivations rather than character descriptions, ensuring alignment with\npractical user applications. Furthermore, we construct an authentic multi-turn\ndialogue simulation mechanism. With carefully selected evaluation dimensions\nand LLM-based scoring, this mechanism captures the complex intention of\nconversations between the user and the character. By shifting focus from\ncharacter background to user intention fulfillment, RMTBench bridges the gap\nbetween academic evaluation and practical deployment requirements, offering a\nmore effective framework for assessing role-playing capabilities in LLMs. All\ncode and datasets will be released soon.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dialogue"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2407.05592", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2407.05592", "abs": "https://arxiv.org/abs/2407.05592", "authors": ["Zehui Zhao", "Laith Alzubaidi", "Jinglan Zhang", "Ye Duan", "Usman Naseem", "Yuantong Gu"], "title": "Transfer or Self-Supervised? Bridging the Performance Gap in Medical Imaging", "comment": "37 pages, 8 figures", "summary": "Recently, transfer learning and self-supervised learning have gained\nsignificant attention within the medical field due to their ability to mitigate\nthe challenges posed by limited data availability, improve model\ngeneralisation, and reduce computational expenses. Transfer learning and\nself-supervised learning hold immense potential for advancing medical research.\nHowever, it is crucial to recognise that transfer learning and self-supervised\nlearning architectures exhibit distinct advantages and limitations, manifesting\nvariations in accuracy, training speed, and robustness. This paper compares the\nperformance and robustness of transfer learning and self-supervised learning in\nthe medical field. Specifically, we pre-trained two models using the same\nsource domain datasets with different pre-training methods and evaluated them\non small-sized medical datasets to identify the factors influencing their final\nperformance. We tested data with several common issues in medical domains, such\nas data imbalance, data scarcity, and domain mismatch, through comparison\nexperiments to understand their impact on specific pre-trained models. Finally,\nwe provide recommendations to help users apply transfer learning and\nself-supervised learning methods in medical areas, and build more convenient\nand efficient deployment strategies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20025", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20025", "abs": "https://arxiv.org/abs/2507.20025", "authors": ["Yin Xie", "Kaicheng Yang", "Xiang An", "Kun Wu", "Yongle Zhao", "Weimo Deng", "Zimin Ran", "Yumeng Wang", "Ziyong Feng", "Roy Miles", "Ismail Elezi", "Jiankang Deng"], "title": "Region-based Cluster Discrimination for Visual Representation Learning", "comment": "Accepted as a highlight paper at ICCV 2025", "summary": "Learning visual representations is foundational for a broad spectrum of\ndownstream tasks. Although recent vision-language contrastive models, such as\nCLIP and SigLIP, have achieved impressive zero-shot performance via large-scale\nvision-language alignment, their reliance on global representations constrains\ntheir effectiveness for dense prediction tasks, such as grounding, OCR, and\nsegmentation. To address this gap, we introduce Region-Aware Cluster\nDiscrimination (RICE), a novel method that enhances region-level visual and OCR\ncapabilities. We first construct a billion-scale candidate region dataset and\npropose a Region Transformer layer to extract rich regional semantics. We\nfurther design a unified region cluster discrimination loss that jointly\nsupports object and OCR learning within a single classification framework,\nenabling efficient and scalable distributed training on large-scale data.\nExtensive experiments show that RICE consistently outperforms previous methods\non tasks, including segmentation, dense detection, and visual perception for\nMultimodal Large Language Models (MLLMs). The pre-trained models have been\nreleased at https://github.com/deepglint/MVT.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20028", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20028", "abs": "https://arxiv.org/abs/2507.20028", "authors": ["Dhruv Sarkar", "Aprameyo Chakrabartty", "Bibhudatta Bhanja"], "title": "TAPS : Frustratingly Simple Test Time Active Learning for VLMs", "comment": null, "summary": "Test-Time Optimization enables models to adapt to new data during inference\nby updating parameters on-the-fly. Recent advances in Vision-Language Models\n(VLMs) have explored learning prompts at test time to improve performance in\ndownstream tasks. In this work, we extend this idea by addressing a more\ngeneral and practical challenge: Can we effectively utilize an oracle in a\ncontinuous data stream where only one sample is available at a time, requiring\nan immediate query decision while respecting latency and memory constraints? To\ntackle this, we propose a novel Test-Time Active Learning (TTAL) framework that\nadaptively queries uncertain samples and updates prompts dynamically. Unlike\nprior methods that assume batched data or multiple gradient updates, our\napproach operates in a real-time streaming scenario with a single test sample\nper step. We introduce a dynamically adjusted entropy threshold for active\nquerying, a class-balanced replacement strategy for memory efficiency, and a\nclass-aware distribution alignment technique to enhance adaptation. The design\nchoices are justified using careful theoretical analysis. Extensive experiments\nacross 10 cross-dataset transfer benchmarks and 4 domain generalization\ndatasets demonstrate consistent improvements over state-of-the-art methods\nwhile maintaining reasonable latency and memory overhead. Our framework\nprovides a practical and effective solution for real-world deployment in\nsafety-critical applications such as autonomous systems and medical\ndiagnostics.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test time"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20419", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20419", "abs": "https://arxiv.org/abs/2507.20419", "authors": ["Khloud AL Jallad", "Nada Ghneim", "Ghaida Rebdawi"], "title": "Survey of NLU Benchmarks Diagnosing Linguistic Phenomena: Why not Standardize Diagnostics Benchmarks?", "comment": null, "summary": "Natural Language Understanding (NLU) is a basic task in Natural Language\nProcessing (NLP). The evaluation of NLU capabilities has become a trending\nresearch topic that attracts researchers in the last few years, resulting in\nthe development of numerous benchmarks. These benchmarks include various tasks\nand datasets in order to evaluate the results of pretrained models via public\nleaderboards. Notably, several benchmarks contain diagnostics datasets designed\nfor investigation and fine-grained error analysis across a wide range of\nlinguistic phenomena. This survey provides a comprehensive review of available\nEnglish, Arabic, and Multilingual NLU benchmarks, with a particular emphasis on\ntheir diagnostics datasets and the linguistic phenomena they covered. We\npresent a detailed comparison and analysis of these benchmarks, highlighting\ntheir strengths and limitations in evaluating NLU tasks and providing in-depth\nerror analysis. When highlighting the gaps in the state-of-the-art, we noted\nthat there is no naming convention for macro and micro categories or even a\nstandard set of linguistic phenomena that should be covered. Consequently, we\nformulated a research question regarding the evaluation metrics of the\nevaluation diagnostics benchmarks: \"Why do not we have an evaluation standard\nfor the NLU evaluation diagnostics benchmarks?\" similar to ISO standard in\nindustry. We conducted a deep analysis and comparisons of the covered\nlinguistic phenomena in order to support experts in building a global hierarchy\nfor linguistic phenomena in future. We think that having evaluation metrics for\ndiagnostics evaluation could be valuable to gain more insights when comparing\nthe results of the studied models on different diagnostics benchmarks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19766", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19766", "abs": "https://arxiv.org/abs/2507.19766", "authors": ["Dong Du", "Shulin Liu", "Tao Yang", "Shaohua Chen", "Yang Li"], "title": "UloRL:An Ultra-Long Output Reinforcement Learning Approach for Advancing Large Language Models' Reasoning Abilities", "comment": "12 pages", "summary": "Recent advances in large language models (LLMs) have highlighted the\npotential of reinforcement learning with verifiable rewards (RLVR) to enhance\nreasoning capabilities through extended output sequences. However, traditional\nRL frameworks face inefficiencies when handling ultra-long outputs due to\nlong-tail sequence distributions and entropy collapse during training. To\naddress these challenges, we propose an Ultra-Long Output Reinforcement\nLearning (UloRL) approach for advancing large language models' reasoning\nabilities. Specifically, we divide ultra long output decoding into short\nsegments, enabling efficient training by mitigating delays caused by long-tail\nsamples. Additionally, we introduce dynamic masking of well-Mastered Positive\nTokens (MPTs) to prevent entropy collapse. Experimental results demonstrate the\neffectiveness of our approach. On the Qwen3-30B-A3B model, RL with segment\nrollout achieved 2.06x increase in training speed, while RL training with\n128k-token outputs improves the model's performance on AIME2025 from 70.9\\% to\n85.1\\% and on BeyondAIME from 50.7\\% to 61.9\\%, even surpassing Qwen3-235B-A22B\nwith remarkable gains. These findings underscore the potential of our methods\nto advance the reasoning capabilities of LLMs with ultra-long sequence\ngeneration. We will release our code and model for further use by the\ncommunity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19836", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.MM", "cs.SD"], "pdf": "https://arxiv.org/pdf/2507.19836", "abs": "https://arxiv.org/abs/2507.19836", "authors": ["Xuanchen Wang", "Heng Wang", "Weidong Cai"], "title": "ChoreoMuse: Robust Music-to-Dance Video Generation with Style Transfer and Beat-Adherent Motion", "comment": "10 pages, 5 figures, accepted by the 33rd ACM International\n  Conference on Multimedia (ACM MM 2025), demo page:\n  https://choreomuse.github.io", "summary": "Modern artistic productions increasingly demand automated choreography\ngeneration that adapts to diverse musical styles and individual dancer\ncharacteristics. Existing approaches often fail to produce high-quality dance\nvideos that harmonize with both musical rhythm and user-defined choreography\nstyles, limiting their applicability in real-world creative contexts. To\naddress this gap, we introduce ChoreoMuse, a diffusion-based framework that\nuses SMPL format parameters and their variation version as intermediaries\nbetween music and video generation, thereby overcoming the usual constraints\nimposed by video resolution. Critically, ChoreoMuse supports\nstyle-controllable, high-fidelity dance video generation across diverse musical\ngenres and individual dancer characteristics, including the flexibility to\nhandle any reference individual at any resolution. Our method employs a novel\nmusic encoder MotionTune to capture motion cues from audio, ensuring that the\ngenerated choreography closely follows the beat and expressive qualities of the\ninput music. To quantitatively evaluate how well the generated dances match\nboth musical and choreographic styles, we introduce two new metrics that\nmeasure alignment with the intended stylistic cues. Extensive experiments\nconfirm that ChoreoMuse achieves state-of-the-art performance across multiple\ndimensions, including video quality, beat alignment, dance diversity, and style\nadherence, demonstrating its potential as a robust solution for a wide range of\ncreative applications. Video results can be found on our project page:\nhttps://choreomuse.github.io.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19840", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.19840", "abs": "https://arxiv.org/abs/2507.19840", "authors": ["Samuel Ebimobowei Johnny", "Blessed Guda", "Andrew Blayama Stephen", "Assane Gueye"], "title": "AutoSign: Direct Pose-to-Text Translation for Continuous Sign Language Recognition", "comment": "Paper to appear at the 1st Workshop in Multimodal Sign Language\n  Recognition at ICCV 2025", "summary": "Continuously recognizing sign gestures and converting them to glosses plays a\nkey role in bridging the gap between the hearing and hearing-impaired\ncommunities. This involves recognizing and interpreting the hands, face, and\nbody gestures of the signer, which pose a challenge as it involves a\ncombination of all these features. Continuous Sign Language Recognition (CSLR)\nmethods rely on multi-stage pipelines that first extract visual features, then\nalign variable-length sequences with target glosses using CTC or HMM-based\napproaches. However, these alignment-based methods suffer from error\npropagation across stages, overfitting, and struggle with vocabulary\nscalability due to the intermediate gloss representation bottleneck. To address\nthese limitations, we propose AutoSign, an autoregressive decoder-only\ntransformer that directly translates pose sequences to natural language text,\nbypassing traditional alignment mechanisms entirely. The use of this\ndecoder-only approach allows the model to directly map between the features and\nthe glosses without the need for CTC loss while also directly learning the\ntextual dependencies in the glosses. Our approach incorporates a temporal\ncompression module using 1D CNNs to efficiently process pose sequences,\nfollowed by AraGPT2, a pre-trained Arabic decoder, to generate text (glosses).\nThrough comprehensive ablation studies, we demonstrate that hand and body\ngestures provide the most discriminative features for signer-independent CSLR.\nBy eliminating the multi-stage pipeline, AutoSign achieves substantial\nimprovements on the Isharah-1000 dataset, achieving an improvement of up to\n6.1\\% in WER score compared to the best existing method.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20120", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20120", "abs": "https://arxiv.org/abs/2507.20120", "authors": ["Rajat Koner", "Zhipeng Wang", "Srinivas Parthasarathy", "Chinghang Chen"], "title": "Local2Global query Alignment for Video Instance Segmentation", "comment": null, "summary": "Online video segmentation methods excel at handling long sequences and\ncapturing gradual changes, making them ideal for real-world applications.\nHowever, achieving temporally consistent predictions remains a challenge,\nespecially with gradual accumulation of noise or drift in on-line propagation,\nabrupt occlusions and scene transitions. This paper introduces Local2Global, an\nonline framework, for video instance segmentation, exhibiting state-of-the-art\nperformance with simple baseline and training purely in online fashion.\nLeveraging the DETR-based query propagation framework, we introduce two novel\nsets of queries:(1) local queries that capture initial object-specific spatial\nfeatures from each frame and (2) global queries containing past spatio-temporal\nrepresentations. We propose the L2G-aligner, a novel lightweight transformer\ndecoder, to facilitate an early alignment between local and global queries.\nThis alignment allows our model to effectively utilize current frame\ninformation while maintaining temporal consistency, producing a smooth\ntransition between frames. Furthermore, L2G-aligner is integrated within the\nsegmentation model, without relying on additional complex heuristics, or memory\nmechanisms. Extensive experiments across various challenging VIS and VPS\ndatasets showcase the superiority of our method with simple online training,\nsurpassing current benchmarks without bells and rings. For instance, we achieve\n54.3 and 49.4 AP on Youtube-VIS-19/-21 datasets and 37.0 AP on OVIS dataset\nrespectively withthe ResNet-50 backbone.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20125", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20125", "abs": "https://arxiv.org/abs/2507.20125", "authors": ["Jianping Yao", "Son N. Tran"], "title": "Multi-output Deep-Supervised Classifier Chains for Plant Pathology", "comment": null, "summary": "Plant leaf disease classification is an important task in smart agriculture\nwhich plays a critical role in sustainable production. Modern machine learning\napproaches have shown unprecedented potential in this classification task which\noffers an array of benefits including time saving and cost reduction. However,\nmost recent approaches directly employ convolutional neural networks where the\neffect of the relationship between plant species and disease types on\nprediction performance is not properly studied. In this study, we proposed a\nnew model named Multi-output Deep Supervised Classifier Chains (Mo-DsCC) which\nweaves the prediction of plant species and disease by chaining the output\nlayers for the two labels. Mo-DsCC consists of three components: A modified\nVGG-16 network as the backbone, deep supervision training, and a stack of\nclassification chains. To evaluate the advantages of our model, we perform\nintensive experiments on two benchmark datasets Plant Village and PlantDoc.\nComparison to recent approaches, including multi-model, multi-label\n(Power-set), multi-output and multi-task, demonstrates that Mo-DsCC achieves\nbetter accuracy and F1-score. The empirical study in this paper shows that the\napplication of Mo-DsCC could be a useful puzzle for smart agriculture to\nbenefit farms and bring new ideas to industry and academia.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20673", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.20673", "abs": "https://arxiv.org/abs/2507.20673", "authors": ["Yuzhong Zhao", "Yue Liu", "Junpeng Liu", "Jingye Chen", "Xun Wu", "Yaru Hao", "Tengchao Lv", "Shaohan Huang", "Lei Cui", "Qixiang Ye", "Fang Wan", "Furu Wei"], "title": "Geometric-Mean Policy Optimization", "comment": "Code is available at https://github.com/callsys/GMPO", "summary": "Recent advancements, such as Group Relative Policy Optimization (GRPO), have\nenhanced the reasoning capabilities of large language models by optimizing the\narithmetic mean of token-level rewards. However, GRPO suffers from unstable\npolicy updates when processing tokens with outlier importance-weighted rewards,\nwhich manifests as extreme importance sampling ratios during training, i.e.,\nthe ratio between the sampling probabilities assigned to a token by the current\nand old policies. In this work, we propose Geometric-Mean Policy Optimization\n(GMPO), a stabilized variant of GRPO. Instead of optimizing the arithmetic\nmean, GMPO maximizes the geometric mean of token-level rewards, which is\ninherently less sensitive to outliers and maintains a more stable range of\nimportance sampling ratio. In addition, we provide comprehensive theoretical\nand experimental analysis to justify the design and stability benefits of GMPO.\nBeyond improved stability, GMPO-7B outperforms GRPO by an average of 4.1% on\nmultiple mathematical benchmarks and 1.4% on multimodal reasoning benchmark,\nincluding AIME24, AMC, MATH500, OlympiadBench, Minerva, and Geometry3K. Code is\navailable at https://github.com/callsys/GMPO.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20146", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20146", "abs": "https://arxiv.org/abs/2507.20146", "authors": ["Haote Zhang", "Lipeng Gu", "Wuzhou Quan", "Fu Lee Wang", "Honghui Fan", "Jiali Tang", "Dingkun Zhu", "Haoran Xie", "Xiaoping Zhang", "Mingqiang Wei"], "title": "Wavelet-guided Misalignment-aware Network for Visible-Infrared Object Detection", "comment": null, "summary": "Visible-infrared object detection aims to enhance the detection robustness by\nexploiting the complementary information of visible and infrared image pairs.\nHowever, its performance is often limited by frequent misalignments caused by\nresolution disparities, spatial displacements, and modality inconsistencies. To\naddress this issue, we propose the Wavelet-guided Misalignment-aware Network\n(WMNet), a unified framework designed to adaptively address different\ncross-modal misalignment patterns. WMNet incorporates wavelet-based\nmulti-frequency analysis and modality-aware fusion mechanisms to improve the\nalignment and integration of cross-modal features. By jointly exploiting low\nand high-frequency information and introducing adaptive guidance across\nmodalities, WMNet alleviates the adverse effects of noise, illumination\nvariation, and spatial misalignment. Furthermore, it enhances the\nrepresentation of salient target features while suppressing spurious or\nmisleading information, thereby promoting more accurate and robust detection.\nExtensive evaluations on the DVTOD, DroneVehicle, and M3FD datasets demonstrate\nthat WMNet achieves state-of-the-art performance on misaligned cross-modal\nobject detection tasks, confirming its effectiveness and practical\napplicability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20704", "categories": ["cs.CL", "cs.AI", "cs.CR"], "pdf": "https://arxiv.org/pdf/2507.20704", "abs": "https://arxiv.org/abs/2507.20704", "authors": ["Gabriel Downer", "Sean Craven", "Damian Ruck", "Jake Thomas"], "title": "Text2VLM: Adapting Text-Only Datasets to Evaluate Alignment Training in Visual Language Models", "comment": "9 pages, 9 figures. Jake Thomas served as Editor for this manuscript", "summary": "The increasing integration of Visual Language Models (VLMs) into AI systems\nnecessitates robust model alignment, especially when handling multimodal\ncontent that combines text and images. Existing evaluation datasets heavily\nlean towards text-only prompts, leaving visual vulnerabilities under evaluated.\nTo address this gap, we propose \\textbf{Text2VLM}, a novel multi-stage pipeline\nthat adapts text-only datasets into multimodal formats, specifically designed\nto evaluate the resilience of VLMs against typographic prompt injection\nattacks. The Text2VLM pipeline identifies harmful content in the original text\nand converts it into a typographic image, creating a multimodal prompt for\nVLMs. Also, our evaluation of open-source VLMs highlights their increased\nsusceptibility to prompt injection when visual inputs are introduced, revealing\ncritical weaknesses in the current models' alignment. This is in addition to a\nsignificant performance gap compared to closed-source frontier models. We\nvalidate Text2VLM through human evaluations, ensuring the alignment of\nextracted salient concepts; text summarization and output classification align\nwith human expectations. Text2VLM provides a scalable tool for comprehensive\nsafety assessment, contributing to the development of more robust safety\nmechanisms for VLMs. By enhancing the evaluation of multimodal vulnerabilities,\nText2VLM plays a role in advancing the safe deployment of VLMs in diverse,\nreal-world applications.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety", "summarization"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19950", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.19950", "abs": "https://arxiv.org/abs/2507.19950", "authors": ["Chengyu Zheng", "Jin Huang", "Honghua Chen", "Mingqiang Wei"], "title": "RARE: Refine Any Registration of Pairwise Point Clouds via Zero-Shot Learning", "comment": null, "summary": "Recent research leveraging large-scale pretrained diffusion models has\ndemonstrated the potential of using diffusion features to establish semantic\ncorrespondences in images. Inspired by advancements in diffusion-based\ntechniques, we propose a novel zero-shot method for refining point cloud\nregistration algorithms. Our approach leverages correspondences derived from\ndepth images to enhance point feature representations, eliminating the need for\na dedicated training dataset. Specifically, we first project the point cloud\ninto depth maps from multiple perspectives and extract implicit knowledge from\na pretrained diffusion network as depth diffusion features. These features are\nthen integrated with geometric features obtained from existing methods to\nestablish more accurate correspondences between point clouds. By leveraging\nthese refined correspondences, our approach achieves significantly improved\nregistration accuracy. Extensive experiments demonstrate that our method not\nonly enhances the performance of existing point cloud registration techniques\nbut also exhibits robust generalization capabilities across diverse datasets.\nCodes are available at https://github.com/zhengcy-lambo/RARE.git.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20156", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20156", "abs": "https://arxiv.org/abs/2507.20156", "authors": ["Daulet Toibazar", "Kesen Wang", "Sherif Mohamed", "Abdulaziz Al-Badawi", "Abdulrahman Alfulayt", "Pedro J. Moreno"], "title": "Trust the Model: Compact VLMs as In-Context Judges for Image-Text Data Quality", "comment": null, "summary": "Vision-language models (VLMs) extend the conventional large language models\nby integrating visual data, enabling richer multimodal reasoning and\nsignificantly broadens the practical applications of AI. However, including\nvisual inputs also brings new challenges in maintaining data quality. Empirical\nevidence consistently shows that carefully curated and representative training\nexamples often yield superior results compared to simply increasing the\nquantity of data. Inspired by this observation, we introduce a streamlined data\nfiltration framework that employs a compact VLM, fine-tuned on a high-quality\nimage-caption annotated dataset. This model effectively evaluates and filters\npotential training samples based on caption and image quality and alignment.\nUnlike previous approaches, which typically add auxiliary filtration modules on\ntop of existing full-scale VLMs, our method exclusively utilizes the inherent\nevaluative capability of a purpose-built small VLM. This strategy eliminates\nthe need for extra modules and reduces training overhead. Our lightweight model\nefficiently filters out inaccurate, noisy web data, improving image-text\nalignment and caption linguistic fluency. Experimental results show that\ndatasets underwent high-precision filtration using our compact VLM perform on\npar with, or even surpass, larger and noisier datasets gathered through\nhigh-volume web crawling. Thus, our method provides a lightweight yet robust\nsolution for building high-quality vision-language training corpora. \\\\\n\\textbf{Availability and implementation:} Our compact VLM filtration model,\ntraining data, utility scripts, and Supplementary data (Appendices) are freely\navailable at https://github.com/daulettoibazar/Compact_VLM_Filter.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20158", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20158", "abs": "https://arxiv.org/abs/2507.20158", "authors": ["Yuhong Zhang", "Liyao Wang", "Han Wang", "Danni Wu", "Zuzeng Lin", "Feng Wang", "Li Song"], "title": "AnimeColor: Reference-based Animation Colorization with Diffusion Transformers", "comment": null, "summary": "Animation colorization plays a vital role in animation production, yet\nexisting methods struggle to achieve color accuracy and temporal consistency.\nTo address these challenges, we propose \\textbf{AnimeColor}, a novel\nreference-based animation colorization framework leveraging Diffusion\nTransformers (DiT). Our approach integrates sketch sequences into a DiT-based\nvideo diffusion model, enabling sketch-controlled animation generation. We\nintroduce two key components: a High-level Color Extractor (HCE) to capture\nsemantic color information and a Low-level Color Guider (LCG) to extract\nfine-grained color details from reference images. These components work\nsynergistically to guide the video diffusion process. Additionally, we employ a\nmulti-stage training strategy to maximize the utilization of reference image\ncolor information. Extensive experiments demonstrate that AnimeColor\noutperforms existing methods in color accuracy, sketch alignment, temporal\nconsistency, and visual quality. Our framework not only advances the state of\nthe art in animation colorization but also provides a practical solution for\nindustrial applications. The code will be made publicly available at\n\\href{https://github.com/IamCreateAI/AnimeColor}{https://github.com/IamCreateAI/AnimeColor}.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy", "fine-grained"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20028", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20028", "abs": "https://arxiv.org/abs/2507.20028", "authors": ["Dhruv Sarkar", "Aprameyo Chakrabartty", "Bibhudatta Bhanja"], "title": "TAPS : Frustratingly Simple Test Time Active Learning for VLMs", "comment": null, "summary": "Test-Time Optimization enables models to adapt to new data during inference\nby updating parameters on-the-fly. Recent advances in Vision-Language Models\n(VLMs) have explored learning prompts at test time to improve performance in\ndownstream tasks. In this work, we extend this idea by addressing a more\ngeneral and practical challenge: Can we effectively utilize an oracle in a\ncontinuous data stream where only one sample is available at a time, requiring\nan immediate query decision while respecting latency and memory constraints? To\ntackle this, we propose a novel Test-Time Active Learning (TTAL) framework that\nadaptively queries uncertain samples and updates prompts dynamically. Unlike\nprior methods that assume batched data or multiple gradient updates, our\napproach operates in a real-time streaming scenario with a single test sample\nper step. We introduce a dynamically adjusted entropy threshold for active\nquerying, a class-balanced replacement strategy for memory efficiency, and a\nclass-aware distribution alignment technique to enhance adaptation. The design\nchoices are justified using careful theoretical analysis. Extensive experiments\nacross 10 cross-dataset transfer benchmarks and 4 domain generalization\ndatasets demonstrate consistent improvements over state-of-the-art methods\nwhile maintaining reasonable latency and memory overhead. Our framework\nprovides a practical and effective solution for real-world deployment in\nsafety-critical applications such as autonomous systems and medical\ndiagnostics.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test time"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20930", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20930", "abs": "https://arxiv.org/abs/2507.20930", "authors": ["Likun Tan", "Kuan-Wei Huang", "Kevin Wu"], "title": "FRED: Financial Retrieval-Enhanced Detection and Editing of Hallucinations in Language Models", "comment": null, "summary": "Hallucinations in large language models pose a critical challenge for\napplications requiring factual reliability, particularly in high-stakes domains\nsuch as finance. This work presents an effective approach for detecting and\nediting factually incorrect content in model-generated responses based on the\nprovided context. Given a user-defined domain-specific error taxonomy, we\nconstruct a synthetic dataset by inserting tagged errors into financial\nquestion-answering corpora and then fine-tune four language models, Phi-4,\nPhi-4-mini, Qwen3-4B, and Qwen3-14B, to detect and edit these factual\ninaccuracies. Our best-performing model, fine-tuned Phi-4, achieves an 8%\nimprovement in binary F1 score and a 30% gain in overall detection performance\ncompared to OpenAI-o3. Notably, our fine-tuned Phi-4-mini model, despite having\nonly 4 billion parameters, maintains competitive performance with just a 2%\ndrop in binary detection and a 0.1% decline in overall detection compared to\nOpenAI-o3. Our work provides a practical solution for detecting and editing\nfactual inconsistencies in financial text generation while introducing a\ngeneralizable framework that can enhance the trustworthiness and alignment of\nlarge language models across diverse applications beyond finance. Our code and\ndata are available at https://github.com/pegasi-ai/fine-grained-editting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability", "fine-grained"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20956", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20956", "abs": "https://arxiv.org/abs/2507.20956", "authors": ["Max Peeperkorn", "Tom Kouwenhoven", "Dan Brown", "Anna Jordanous"], "title": "Mind the Gap: Conformative Decoding to Improve Output Diversity of Instruction-Tuned Large Language Models", "comment": "9 pages, 3 figures", "summary": "Instruction-tuning large language models (LLMs) reduces the diversity of\ntheir outputs, which has implications for many tasks, particularly for creative\ntasks. This paper investigates the ``diversity gap'' for a writing prompt\nnarrative generation task. This gap emerges as measured by current diversity\nmetrics for various open-weight and open-source LLMs. The results show\nsignificant decreases in diversity due to instruction-tuning. We explore the\ndiversity loss at each fine-tuning stage for the OLMo and OLMo 2 models to\nfurther understand how output diversity is affected. The results indicate that\nDPO has the most substantial impact on diversity. Motivated by these findings,\nwe present a new decoding strategy, conformative decoding, which guides an\ninstruct model using its more diverse base model to reintroduce output\ndiversity. We show that conformative decoding typically increases diversity and\neven maintains or improves quality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["DPO"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20152", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20152", "abs": "https://arxiv.org/abs/2507.20152", "authors": ["Shuhaib Mehri", "Xiaocheng Yang", "Takyoung Kim", "Gokhan Tur", "Shikib Mehri", "Dilek Hakkani-Tür"], "title": "Goal Alignment in LLM-Based User Simulators for Conversational AI", "comment": null, "summary": "User simulators are essential to conversational AI, enabling scalable agent\ndevelopment and evaluation through simulated interactions. While current Large\nLanguage Models (LLMs) have advanced user simulation capabilities, we reveal\nthat they struggle to consistently demonstrate goal-oriented behavior across\nmulti-turn conversations--a critical limitation that compromises their\nreliability in downstream applications. We introduce User Goal State Tracking\n(UGST), a novel framework that tracks user goal progression throughout\nconversations. Leveraging UGST, we present a three-stage methodology for\ndeveloping user simulators that can autonomously track goal progression and\nreason to generate goal-aligned responses. Moreover, we establish comprehensive\nevaluation metrics for measuring goal alignment in user simulators, and\ndemonstrate that our approach yields substantial improvements across two\nbenchmarks (MultiWOZ 2.4 and {\\tau}-Bench). Our contributions address a\ncritical gap in conversational AI and establish UGST as an essential framework\nfor developing goal-aligned user simulators.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "reliability"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19840", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.19840", "abs": "https://arxiv.org/abs/2507.19840", "authors": ["Samuel Ebimobowei Johnny", "Blessed Guda", "Andrew Blayama Stephen", "Assane Gueye"], "title": "AutoSign: Direct Pose-to-Text Translation for Continuous Sign Language Recognition", "comment": "Paper to appear at the 1st Workshop in Multimodal Sign Language\n  Recognition at ICCV 2025", "summary": "Continuously recognizing sign gestures and converting them to glosses plays a\nkey role in bridging the gap between the hearing and hearing-impaired\ncommunities. This involves recognizing and interpreting the hands, face, and\nbody gestures of the signer, which pose a challenge as it involves a\ncombination of all these features. Continuous Sign Language Recognition (CSLR)\nmethods rely on multi-stage pipelines that first extract visual features, then\nalign variable-length sequences with target glosses using CTC or HMM-based\napproaches. However, these alignment-based methods suffer from error\npropagation across stages, overfitting, and struggle with vocabulary\nscalability due to the intermediate gloss representation bottleneck. To address\nthese limitations, we propose AutoSign, an autoregressive decoder-only\ntransformer that directly translates pose sequences to natural language text,\nbypassing traditional alignment mechanisms entirely. The use of this\ndecoder-only approach allows the model to directly map between the features and\nthe glosses without the need for CTC loss while also directly learning the\ntextual dependencies in the glosses. Our approach incorporates a temporal\ncompression module using 1D CNNs to efficiently process pose sequences,\nfollowed by AraGPT2, a pre-trained Arabic decoder, to generate text (glosses).\nThrough comprehensive ablation studies, we demonstrate that hand and body\ngestures provide the most discriminative features for signer-independent CSLR.\nBy eliminating the multi-stage pipeline, AutoSign achieves substantial\nimprovements on the Isharah-1000 dataset, achieving an improvement of up to\n6.1\\% in WER score compared to the best existing method.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20156", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20156", "abs": "https://arxiv.org/abs/2507.20156", "authors": ["Daulet Toibazar", "Kesen Wang", "Sherif Mohamed", "Abdulaziz Al-Badawi", "Abdulrahman Alfulayt", "Pedro J. Moreno"], "title": "Trust the Model: Compact VLMs as In-Context Judges for Image-Text Data Quality", "comment": null, "summary": "Vision-language models (VLMs) extend the conventional large language models\nby integrating visual data, enabling richer multimodal reasoning and\nsignificantly broadens the practical applications of AI. However, including\nvisual inputs also brings new challenges in maintaining data quality. Empirical\nevidence consistently shows that carefully curated and representative training\nexamples often yield superior results compared to simply increasing the\nquantity of data. Inspired by this observation, we introduce a streamlined data\nfiltration framework that employs a compact VLM, fine-tuned on a high-quality\nimage-caption annotated dataset. This model effectively evaluates and filters\npotential training samples based on caption and image quality and alignment.\nUnlike previous approaches, which typically add auxiliary filtration modules on\ntop of existing full-scale VLMs, our method exclusively utilizes the inherent\nevaluative capability of a purpose-built small VLM. This strategy eliminates\nthe need for extra modules and reduces training overhead. Our lightweight model\nefficiently filters out inaccurate, noisy web data, improving image-text\nalignment and caption linguistic fluency. Experimental results show that\ndatasets underwent high-precision filtration using our compact VLM perform on\npar with, or even surpass, larger and noisier datasets gathered through\nhigh-volume web crawling. Thus, our method provides a lightweight yet robust\nsolution for building high-quality vision-language training corpora. \\\\\n\\textbf{Availability and implementation:} Our compact VLM filtration model,\ntraining data, utility scripts, and Supplementary data (Appendices) are freely\navailable at https://github.com/daulettoibazar/Compact_VLM_Filter.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20259", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20259", "abs": "https://arxiv.org/abs/2507.20259", "authors": ["Mitul Goswami", "Mrinal Goswami"], "title": "L-MCAT: Unpaired Multimodal Transformer with Contrastive Attention for Label-Efficient Satellite Image Classification", "comment": null, "summary": "We propose the Lightweight Multimodal Contrastive Attention Transformer\n(L-MCAT), a novel transformer-based framework for label-efficient remote\nsensing image classification using unpaired multimodal satellite data. L-MCAT\nintroduces two core innovations: (1) Modality-Spectral Adapters (MSA) that\ncompress high-dimensional sensor inputs into a unified embedding space, and (2)\nUnpaired Multimodal Attention Alignment (U-MAA), a contrastive self-supervised\nmechanism integrated into the attention layers to align heterogeneous\nmodalities without pixel-level correspondence or labels. L-MCAT achieves 95.4%\noverall accuracy on the SEN12MS dataset using only 20 labels per class,\noutperforming state-of-the-art baselines while using 47x fewer parameters and\n23x fewer FLOPs than MCTrans. It maintains over 92% accuracy even under 50%\nspatial misalignment, demonstrating robustness for real-world deployment. The\nmodel trains end-to-end in under 5 hours on a single consumer GPU.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20252", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20252", "abs": "https://arxiv.org/abs/2507.20252", "authors": ["Xiang Fei", "Siqi Wang", "Shu Wei", "Yuxiang Nie", "Wei Shi", "Hao Feng", "Can Huang"], "title": "Post-Completion Learning for Language Models", "comment": null, "summary": "Current language model training paradigms typically terminate learning upon\nreaching the end-of-sequence (<eos>}) token, overlooking the potential learning\nopportunities in the post-completion space. We propose Post-Completion Learning\n(PCL), a novel training framework that systematically utilizes the sequence\nspace after model output completion, to enhance both the reasoning and\nself-evaluation abilities. PCL enables models to continue generating\nself-assessments and reward predictions during training, while maintaining\nefficient inference by stopping at the completion point.\n  To fully utilize this post-completion space, we design a white-box\nreinforcement learning method: let the model evaluate the output content\naccording to the reward rules, then calculate and align the score with the\nreward functions for supervision. We implement dual-track SFT to optimize both\nreasoning and evaluation capabilities, and mixed it with RL training to achieve\nmulti-objective hybrid optimization.\n  Experimental results on different datasets and models demonstrate consistent\nimprovements over traditional SFT and RL methods. Our method provides a new\ntechnical path for language model training that enhances output quality while\npreserving deployment efficiency.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20884", "categories": ["cs.CV", "cs.CL", "eess.IV"], "pdf": "https://arxiv.org/pdf/2507.20884", "abs": "https://arxiv.org/abs/2507.20884", "authors": ["Dinh Nam Pham", "Eleftherios Avramidis"], "title": "The Importance of Facial Features in Vision-based Sign Language Recognition: Eyes, Mouth or Full Face?", "comment": "Accepted at 9th International Workshop on Sign Language Translation\n  and Avatar Technologies @ ACM IVA'25", "summary": "Non-manual facial features play a crucial role in sign language\ncommunication, yet their importance in automatic sign language recognition\n(ASLR) remains underexplored. While prior studies have shown that incorporating\nfacial features can improve recognition, related work often relies on\nhand-crafted feature extraction and fails to go beyond the comparison of manual\nfeatures versus the combination of manual and facial features. In this work, we\nsystematically investigate the contribution of distinct facial regionseyes,\nmouth, and full faceusing two different deep learning models (a CNN-based model\nand a transformer-based model) trained on an SLR dataset of isolated signs with\nrandomly selected classes. Through quantitative performance and qualitative\nsaliency map evaluation, we reveal that the mouth is the most important\nnon-manual facial feature, significantly improving accuracy. Our findings\nhighlight the necessity of incorporating facial features in ASLR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20419", "categories": ["cs.CL", "cs.AI", "cs.HC", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20419", "abs": "https://arxiv.org/abs/2507.20419", "authors": ["Khloud AL Jallad", "Nada Ghneim", "Ghaida Rebdawi"], "title": "Survey of NLU Benchmarks Diagnosing Linguistic Phenomena: Why not Standardize Diagnostics Benchmarks?", "comment": null, "summary": "Natural Language Understanding (NLU) is a basic task in Natural Language\nProcessing (NLP). The evaluation of NLU capabilities has become a trending\nresearch topic that attracts researchers in the last few years, resulting in\nthe development of numerous benchmarks. These benchmarks include various tasks\nand datasets in order to evaluate the results of pretrained models via public\nleaderboards. Notably, several benchmarks contain diagnostics datasets designed\nfor investigation and fine-grained error analysis across a wide range of\nlinguistic phenomena. This survey provides a comprehensive review of available\nEnglish, Arabic, and Multilingual NLU benchmarks, with a particular emphasis on\ntheir diagnostics datasets and the linguistic phenomena they covered. We\npresent a detailed comparison and analysis of these benchmarks, highlighting\ntheir strengths and limitations in evaluating NLU tasks and providing in-depth\nerror analysis. When highlighting the gaps in the state-of-the-art, we noted\nthat there is no naming convention for macro and micro categories or even a\nstandard set of linguistic phenomena that should be covered. Consequently, we\nformulated a research question regarding the evaluation metrics of the\nevaluation diagnostics benchmarks: \"Why do not we have an evaluation standard\nfor the NLU evaluation diagnostics benchmarks?\" similar to ISO standard in\nindustry. We conducted a deep analysis and comparisons of the covered\nlinguistic phenomena in order to support experts in building a global hierarchy\nfor linguistic phenomena in future. We think that having evaluation metrics for\ndiagnostics evaluation could be valuable to gain more insights when comparing\nthe results of the studied models on different diagnostics benchmarks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20337", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20337", "abs": "https://arxiv.org/abs/2507.20337", "authors": ["Peng Liu", "Bianca Güttner", "Yutong Su", "Chenyang Li", "Jinjing Xu", "Mingyang Liu", "Zhe Min", "Andrey Zhylka", "Jasper Smit", "Karin Olthof", "Matteo Fusaglia", "Rudi Apolle", "Matthias Miederer", "Laura Frohneberger", "Carina Riediger", "Jügen Weitz", "Fiona Kolbinger", "Stefanie Speidel", "Micha Pfeiffer"], "title": "PIVOTS: Aligning unseen Structures using Preoperative to Intraoperative Volume-To-Surface Registration for Liver Navigation", "comment": null, "summary": "Non-rigid registration is essential for Augmented Reality guided laparoscopic\nliver surgery by fusing preoperative information, such as tumor location and\nvascular structures, into the limited intraoperative view, thereby enhancing\nsurgical navigation. A prerequisite is the accurate prediction of\nintraoperative liver deformation which remains highly challenging due to\nfactors such as large deformation caused by pneumoperitoneum, respiration and\ntool interaction as well as noisy intraoperative data, and limited field of\nview due to occlusion and constrained camera movement. To address these\nchallenges, we introduce PIVOTS, a Preoperative to Intraoperative\nVOlume-To-Surface registration neural network that directly takes point clouds\nas input for deformation prediction. The geometric feature extraction encoder\nallows multi-resolution feature extraction, and the decoder, comprising novel\ndeformation aware cross attention modules, enables pre- and intraoperative\ninformation interaction and accurate multi-level displacement prediction. We\ntrain the neural network on synthetic data simulated from a biomechanical\nsimulation pipeline and validate its performance on both synthetic and real\ndatasets. Results demonstrate superior registration performance of our method\ncompared to baseline methods, exhibiting strong robustness against high amounts\nof noise, large deformation, and various levels of intraoperative visibility.\nWe publish the training and test sets as evaluation benchmarks and call for a\nfair comparison of liver registration methods with volume-to-surface data. Code\nand datasets are available here https://github.com/pengliu-nct/PIVOTS.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20536", "categories": ["cs.CV", "cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2507.20536", "abs": "https://arxiv.org/abs/2507.20536", "authors": ["Chieh-Yun Chen", "Min Shi", "Gong Zhang", "Humphrey Shi"], "title": "T2I-Copilot: A Training-Free Multi-Agent Text-to-Image System for Enhanced Prompt Interpretation and Interactive Generation", "comment": "ICCV 2025", "summary": "Text-to-Image (T2I) generative models have revolutionized content creation\nbut remain highly sensitive to prompt phrasing, often requiring users to\nrepeatedly refine prompts multiple times without clear feedback. While\ntechniques such as automatic prompt engineering, controlled text embeddings,\ndenoising, and multi-turn generation mitigate these issues, they offer limited\ncontrollability, or often necessitate additional training, restricting the\ngeneralization abilities. Thus, we introduce T2I-Copilot, a training-free\nmulti-agent system that leverages collaboration between (Multimodal) Large\nLanguage Models to automate prompt phrasing, model selection, and iterative\nrefinement. This approach significantly simplifies prompt engineering while\nenhancing generation quality and text-image alignment compared to direct\ngeneration. Specifically, T2I-Copilot consists of three agents: (1) Input\nInterpreter, which parses the input prompt, resolves ambiguities, and generates\na standardized report; (2) Generation Engine, which selects the appropriate\nmodel from different types of T2I models and organizes visual and textual\nprompts to initiate generation; and (3) Quality Evaluator, which assesses\naesthetic quality and text-image alignment, providing scores and feedback for\npotential regeneration. T2I-Copilot can operate fully autonomously while also\nsupporting human-in-the-loop intervention for fine-grained control. On\nGenAI-Bench, using open-source generation models, T2I-Copilot achieves a VQA\nscore comparable to commercial models RecraftV3 and Imagen 3, surpasses\nFLUX1.1-pro by 6.17% at only 16.59% of its cost, and outperforms FLUX.1-dev and\nSD 3.5 Large by 9.11% and 6.36%. Code will be released at:\nhttps://github.com/SHI-Labs/T2I-Copilot.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20404", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20404", "abs": "https://arxiv.org/abs/2507.20404", "authors": ["Juan E. Tapia", "Mario Nieto", "Juan M. Espin", "Alvaro S. Rocamora", "Javier Barrachina", "Naser Damer", "Christoph Busch", "Marija Ivanovska", "Leon Todorov", "Renat Khizbullin", "Lazar Lazarevich", "Aleksei Grishin", "Daniel Schulz", "Sebastian Gonzalez", "Amir Mohammadi", "Ketan Kotwal", "Sebastien Marcel", "Raghavendra Mudgalgundurao", "Kiran Raja", "Patrick Schuch", "Sushrut Patwardhan", "Raghavendra Ramachandra", "Pedro Couto Pereira", "Joao Ribeiro Pinto", "Mariana Xavier", "Andrés Valenzuela", "Rodrigo Lara", "Borut Batagelj", "Marko Peterlin", "Peter Peer", "Ajnas Muhammed", "Diogo Nunes", "Nuno Gonçalves"], "title": "Second Competition on Presentation Attack Detection on ID Card", "comment": null, "summary": "This work summarises and reports the results of the second Presentation\nAttack Detection competition on ID cards. This new version includes new\nelements compared to the previous one. (1) An automatic evaluation platform was\nenabled for automatic benchmarking; (2) Two tracks were proposed in order to\nevaluate algorithms and datasets, respectively; and (3) A new ID card dataset\nwas shared with Track 1 teams to serve as the baseline dataset for the training\nand optimisation. The Hochschule Darmstadt, Fraunhofer-IGD, and Facephi company\njointly organised this challenge. 20 teams were registered, and 74 submitted\nmodels were evaluated. For Track 1, the \"Dragons\" team reached first place with\nan Average Ranking and Equal Error rate (EER) of AV-Rank of 40.48% and 11.44%\nEER, respectively. For the more challenging approach in Track 2, the \"Incode\"\nteam reached the best results with an AV-Rank of 14.76% and 6.36% EER,\nimproving on the results of the first edition of 74.30% and 21.87% EER,\nrespectively. These results suggest that PAD on ID cards is improving, but it\nis still a challenging problem related to the number of images, especially of\nbona fide images.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20704", "categories": ["cs.CL", "cs.AI", "cs.CR"], "pdf": "https://arxiv.org/pdf/2507.20704", "abs": "https://arxiv.org/abs/2507.20704", "authors": ["Gabriel Downer", "Sean Craven", "Damian Ruck", "Jake Thomas"], "title": "Text2VLM: Adapting Text-Only Datasets to Evaluate Alignment Training in Visual Language Models", "comment": "9 pages, 9 figures. Jake Thomas served as Editor for this manuscript", "summary": "The increasing integration of Visual Language Models (VLMs) into AI systems\nnecessitates robust model alignment, especially when handling multimodal\ncontent that combines text and images. Existing evaluation datasets heavily\nlean towards text-only prompts, leaving visual vulnerabilities under evaluated.\nTo address this gap, we propose \\textbf{Text2VLM}, a novel multi-stage pipeline\nthat adapts text-only datasets into multimodal formats, specifically designed\nto evaluate the resilience of VLMs against typographic prompt injection\nattacks. The Text2VLM pipeline identifies harmful content in the original text\nand converts it into a typographic image, creating a multimodal prompt for\nVLMs. Also, our evaluation of open-source VLMs highlights their increased\nsusceptibility to prompt injection when visual inputs are introduced, revealing\ncritical weaknesses in the current models' alignment. This is in addition to a\nsignificant performance gap compared to closed-source frontier models. We\nvalidate Text2VLM through human evaluations, ensuring the alignment of\nextracted salient concepts; text summarization and output classification align\nwith human expectations. Text2VLM provides a scalable tool for comprehensive\nsafety assessment, contributing to the development of more robust safety\nmechanisms for VLMs. By enhancing the evaluation of multimodal vulnerabilities,\nText2VLM plays a role in advancing the safe deployment of VLMs in diverse,\nreal-world applications.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "safety", "summarization"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20480", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20480", "abs": "https://arxiv.org/abs/2507.20480", "authors": ["Shiyang Liu", "Dianyi Yang", "Yu Gao", "Bohan Ren", "Yi Yang", "Mengyin Fu"], "title": "Automated 3D-GS Registration and Fusion via Skeleton Alignment and Gaussian-Adaptive Features", "comment": "Accepted to IROS 2025", "summary": "In recent years, 3D Gaussian Splatting (3D-GS)-based scene representation\ndemonstrates significant potential in real-time rendering and training\nefficiency. However, most existing methods primarily focus on single-map\nreconstruction, while the registration and fusion of multiple 3D-GS sub-maps\nremain underexplored. Existing methods typically rely on manual intervention to\nselect a reference sub-map as a template and use point cloud matching for\nregistration. Moreover, hard-threshold filtering of 3D-GS primitives often\ndegrades rendering quality after fusion. In this paper, we present a novel\napproach for automated 3D-GS sub-map alignment and fusion, eliminating the need\nfor manual intervention while enhancing registration accuracy and fusion\nquality. First, we extract geometric skeletons across multiple scenes and\nleverage ellipsoid-aware convolution to capture 3D-GS attributes, facilitating\nrobust scene registration. Second, we introduce a multi-factor Gaussian fusion\nstrategy to mitigate the scene element loss caused by rigid thresholding.\nExperiments on the ScanNet-GSReg and our Coord datasets demonstrate the\neffectiveness of the proposed method in registration and fusion. For\nregistration, it achieves a 41.9\\% reduction in RRE on complex scenes, ensuring\nmore precise pose estimation. For fusion, it improves PSNR by 10.11 dB,\nhighlighting superior structural preservation. These results confirm its\nability to enhance scene alignment and reconstruction fidelity, ensuring more\nconsistent and accurate 3D scene representation for robotic perception and\nautonomous navigation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20518", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2507.20518", "abs": "https://arxiv.org/abs/2507.20518", "authors": ["Yili Li", "Gang Xiong", "Gaopeng Gou", "Xiangyan Qu", "Jiamin Zhuang", "Zhen Li", "Junzheng Shi"], "title": "T2VParser: Adaptive Decomposition Tokens for Partial Alignment in Text to Video Retrieval", "comment": null, "summary": "Text-to-video retrieval essentially aims to train models to align visual\ncontent with textual descriptions accurately. Due to the impressive general\nmultimodal knowledge demonstrated by image-text pretrained models such as CLIP,\nexisting work has primarily focused on extending CLIP knowledge for video-text\ntasks. However, videos typically contain richer information than images. In\ncurrent video-text datasets, textual descriptions can only reflect a portion of\nthe video content, leading to partial misalignment in video-text matching.\nTherefore, directly aligning text representations with video representations\ncan result in incorrect supervision, ignoring the inequivalence of information.\nIn this work, we propose T2VParser to extract multiview semantic\nrepresentations from text and video, achieving adaptive semantic alignment\nrather than aligning the entire representation. To extract corresponding\nrepresentations from different modalities, we introduce Adaptive Decomposition\nTokens, which consist of a set of learnable tokens shared across modalities.\nThe goal of T2VParser is to emphasize precise alignment between text and video\nwhile retaining the knowledge of pretrained models. Experimental results\ndemonstrate that T2VParser achieves accurate partial alignment through\neffective cross-modal content decomposition. The code is available at\nhttps://github.com/Lilidamowang/T2VParser.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20930", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.20930", "abs": "https://arxiv.org/abs/2507.20930", "authors": ["Likun Tan", "Kuan-Wei Huang", "Kevin Wu"], "title": "FRED: Financial Retrieval-Enhanced Detection and Editing of Hallucinations in Language Models", "comment": null, "summary": "Hallucinations in large language models pose a critical challenge for\napplications requiring factual reliability, particularly in high-stakes domains\nsuch as finance. This work presents an effective approach for detecting and\nediting factually incorrect content in model-generated responses based on the\nprovided context. Given a user-defined domain-specific error taxonomy, we\nconstruct a synthetic dataset by inserting tagged errors into financial\nquestion-answering corpora and then fine-tune four language models, Phi-4,\nPhi-4-mini, Qwen3-4B, and Qwen3-14B, to detect and edit these factual\ninaccuracies. Our best-performing model, fine-tuned Phi-4, achieves an 8%\nimprovement in binary F1 score and a 30% gain in overall detection performance\ncompared to OpenAI-o3. Notably, our fine-tuned Phi-4-mini model, despite having\nonly 4 billion parameters, maintains competitive performance with just a 2%\ndrop in binary detection and a 0.1% decline in overall detection compared to\nOpenAI-o3. Our work provides a practical solution for detecting and editing\nfactual inconsistencies in financial text generation while introducing a\ngeneralizable framework that can enhance the trustworthiness and alignment of\nlarge language models across diverse applications beyond finance. Our code and\ndata are available at https://github.com/pegasi-ai/fine-grained-editting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability", "fine-grained"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20536", "categories": ["cs.CV", "cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2507.20536", "abs": "https://arxiv.org/abs/2507.20536", "authors": ["Chieh-Yun Chen", "Min Shi", "Gong Zhang", "Humphrey Shi"], "title": "T2I-Copilot: A Training-Free Multi-Agent Text-to-Image System for Enhanced Prompt Interpretation and Interactive Generation", "comment": "ICCV 2025", "summary": "Text-to-Image (T2I) generative models have revolutionized content creation\nbut remain highly sensitive to prompt phrasing, often requiring users to\nrepeatedly refine prompts multiple times without clear feedback. While\ntechniques such as automatic prompt engineering, controlled text embeddings,\ndenoising, and multi-turn generation mitigate these issues, they offer limited\ncontrollability, or often necessitate additional training, restricting the\ngeneralization abilities. Thus, we introduce T2I-Copilot, a training-free\nmulti-agent system that leverages collaboration between (Multimodal) Large\nLanguage Models to automate prompt phrasing, model selection, and iterative\nrefinement. This approach significantly simplifies prompt engineering while\nenhancing generation quality and text-image alignment compared to direct\ngeneration. Specifically, T2I-Copilot consists of three agents: (1) Input\nInterpreter, which parses the input prompt, resolves ambiguities, and generates\na standardized report; (2) Generation Engine, which selects the appropriate\nmodel from different types of T2I models and organizes visual and textual\nprompts to initiate generation; and (3) Quality Evaluator, which assesses\naesthetic quality and text-image alignment, providing scores and feedback for\npotential regeneration. T2I-Copilot can operate fully autonomously while also\nsupporting human-in-the-loop intervention for fine-grained control. On\nGenAI-Bench, using open-source generation models, T2I-Copilot achieves a VQA\nscore comparable to commercial models RecraftV3 and Imagen 3, surpasses\nFLUX1.1-pro by 6.17% at only 16.59% of its cost, and outperforms FLUX.1-dev and\nSD 3.5 Large by 9.11% and 6.36%. Code will be released at:\nhttps://github.com/SHI-Labs/T2I-Copilot.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20956", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20956", "abs": "https://arxiv.org/abs/2507.20956", "authors": ["Max Peeperkorn", "Tom Kouwenhoven", "Dan Brown", "Anna Jordanous"], "title": "Mind the Gap: Conformative Decoding to Improve Output Diversity of Instruction-Tuned Large Language Models", "comment": "9 pages, 3 figures", "summary": "Instruction-tuning large language models (LLMs) reduces the diversity of\ntheir outputs, which has implications for many tasks, particularly for creative\ntasks. This paper investigates the ``diversity gap'' for a writing prompt\nnarrative generation task. This gap emerges as measured by current diversity\nmetrics for various open-weight and open-source LLMs. The results show\nsignificant decreases in diversity due to instruction-tuning. We explore the\ndiversity loss at each fine-tuning stage for the OLMo and OLMo 2 models to\nfurther understand how output diversity is affected. The results indicate that\nDPO has the most substantial impact on diversity. Motivated by these findings,\nwe present a new decoding strategy, conformative decoding, which guides an\ninstruct model using its more diverse base model to reintroduce output\ndiversity. We show that conformative decoding typically increases diversity and\neven maintains or improves quality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["DPO"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20994", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20994", "abs": "https://arxiv.org/abs/2507.20994", "authors": ["Shen Li", "Liuyi Yao", "Wujia Niu", "Lan Zhang", "Yaliang Li"], "title": "Security Tensors as a Cross-Modal Bridge: Extending Text-Aligned Safety to Vision in LVLM", "comment": "Codes and data are available at\n  https://github.com/listen0425/Security-Tensors", "summary": "Large visual-language models (LVLMs) integrate aligned large language models\n(LLMs) with visual modules to process multimodal inputs. However, the safety\nmechanisms developed for text-based LLMs do not naturally extend to visual\nmodalities, leaving LVLMs vulnerable to harmful image inputs. To address this\ncross-modal safety gap, we introduce security tensors - trainable input vectors\napplied during inference through either the textual or visual modality. These\ntensors transfer textual safety alignment to visual processing without\nmodifying the model's parameters. They are optimized using a curated dataset\ncontaining (i) malicious image-text pairs requiring rejection, (ii) contrastive\nbenign pairs with text structurally similar to malicious queries, with the\npurpose of being contrastive examples to guide visual reliance, and (iii)\ngeneral benign samples preserving model functionality. Experimental results\ndemonstrate that both textual and visual security tensors significantly enhance\nLVLMs' ability to reject diverse harmful visual inputs while maintaining\nnear-identical performance on benign tasks. Further internal analysis towards\nhidden-layer representations reveals that security tensors successfully\nactivate the language module's textual \"safety layers\" in visual inputs,\nthereby effectively extending text-based safety to the visual modality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20629", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20629", "abs": "https://arxiv.org/abs/2507.20629", "authors": ["Dezhi An", "Wenqiang Liu", "Kefan Wang", "Zening Chen", "Jun Lu", "Shengcai Zhang"], "title": "DAMS:Dual-Branch Adaptive Multiscale Spatiotemporal Framework for Video Anomaly Detection", "comment": "13 pages,7 figures", "summary": "The goal of video anomaly detection is tantamount to performing\nspatio-temporal localization of abnormal events in the video. The multiscale\ntemporal dependencies, visual-semantic heterogeneity, and the scarcity of\nlabeled data exhibited by video anomalies collectively present a challenging\nresearch problem in computer vision. This study offers a dual-path architecture\ncalled the Dual-Branch Adaptive Multiscale Spatiotemporal Framework (DAMS),\nwhich is based on multilevel feature decoupling and fusion, enabling efficient\nanomaly detection modeling by integrating hierarchical feature learning and\ncomplementary information. The main processing path of this framework\nintegrates the Adaptive Multiscale Time Pyramid Network (AMTPN) with the\nConvolutional Block Attention Mechanism (CBAM). AMTPN enables multigrained\nrepresentation and dynamically weighted reconstruction of temporal features\nthrough a three-level cascade structure (time pyramid pooling, adaptive feature\nfusion, and temporal context enhancement). CBAM maximizes the entropy\ndistribution of feature channels and spatial dimensions through dual attention\nmapping. Simultaneously, the parallel path driven by CLIP introduces a\ncontrastive language-visual pre-training paradigm. Cross-modal semantic\nalignment and a multiscale instance selection mechanism provide high-order\nsemantic guidance for spatio-temporal features. This creates a complete\ninference chain from the underlying spatio-temporal features to high-level\nsemantic concepts. The orthogonal complementarity of the two paths and the\ninformation fusion mechanism jointly construct a comprehensive representation\nand identification capability for anomalous events. Extensive experimental\nresults on the UCF-Crime and XD-Violence benchmarks establish the effectiveness\nof the DAMS framework.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20740", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20740", "abs": "https://arxiv.org/abs/2507.20740", "authors": ["Mingfeng Zha", "Tianyu Li", "Guoqing Wang", "Peng Wang", "Yangyang Wu", "Yang Yang", "Heng Tao Shen"], "title": "Implicit Counterfactual Learning for Audio-Visual Segmentation", "comment": "Accepted by ICCV 2025", "summary": "Audio-visual segmentation (AVS) aims to segment objects in videos based on\naudio cues. Existing AVS methods are primarily designed to enhance interaction\nefficiency but pay limited attention to modality representation discrepancies\nand imbalances. To overcome this, we propose the implicit counterfactual\nframework (ICF) to achieve unbiased cross-modal understanding. Due to the lack\nof semantics, heterogeneous representations may lead to erroneous matches,\nespecially in complex scenes with ambiguous visual content or interference from\nmultiple audio sources. We introduce the multi-granularity implicit text (MIT)\ninvolving video-, segment- and frame-level as the bridge to establish the\nmodality-shared space, reducing modality gaps and providing prior guidance.\nVisual content carries more information and typically dominates, thereby\nmarginalizing audio features in the decision-making. To mitigate knowledge\npreference, we propose the semantic counterfactual (SC) to learn orthogonal\nrepresentations in the latent space, generating diverse counterfactual samples,\nthus avoiding biases introduced by complex functional designs and explicit\nmodifications of text structures or attributes. We further formulate the\ncollaborative distribution-aware contrastive learning (CDCL), incorporating\nfactual-counterfactual and inter-modality contrasts to align representations,\npromoting cohesion and decoupling. Extensive experiments on three public\ndatasets validate that the proposed method achieves state-of-the-art\nperformance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20766", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20766", "abs": "https://arxiv.org/abs/2507.20766", "authors": ["Yang Chen", "Yufan Shen", "Wenxuan Huang", "Shen Zhou", "Qunshu Lin", "Xinyu Cai", "Zhi Yu", "Botian Shi", "Yu Qiao"], "title": "Learning Only with Images: Visual Reinforcement Learning with Reasoning, Rendering, and Visual Feedback", "comment": null, "summary": "Multimodal Large Language Models (MLLMs) have exhibited impressive\nperformance across various visual tasks. Subsequent investigations into\nenhancing their visual reasoning abilities have significantly expanded their\nperformance envelope. However, a critical bottleneck in the advancement of\nMLLMs toward deep visual reasoning is their heavy reliance on curated\nimage-text supervision. To solve this problem, we introduce a novel framework\ntermed ``Reasoning-Rendering-Visual-Feedback'' (RRVF), which enables MLLMs to\nlearn complex visual reasoning from only raw images. This framework builds on\nthe ``Asymmetry of Verification'' principle to train MLLMs, i.e., verifying the\nrendered output against a source image is easier than generating it. We\ndemonstrate that this relative ease provides an ideal reward signal for\noptimization via Reinforcement Learning (RL) training, reducing the reliance on\nthe image-text supervision. Guided by the above principle, RRVF implements a\nclosed-loop iterative process encompassing reasoning, rendering, and visual\nfeedback components, enabling the model to perform self-correction through\nmulti-turn interactions and tool invocation, while this pipeline can be\noptimized by the GRPO algorithm in an end-to-end manner. Extensive experiments\non image-to-code generation for data charts and web interfaces show that RRVF\nsubstantially outperforms existing open-source MLLMs and surpasses supervised\nfine-tuning baselines. Our findings demonstrate that systems driven by purely\nvisual feedback present a viable path toward more robust and generalizable\nreasoning models without requiring explicit supervision. Code will be available\nat https://github.com/L-O-I/RRVF.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["self-correction"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["code generation"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20879", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20879", "abs": "https://arxiv.org/abs/2507.20879", "authors": ["Weicheng Zheng", "Xiaofei Mao", "Nanfei Ye", "Pengxiang Li", "Kun Zhan", "Xianpeng Lang", "Hang Zhao"], "title": "DriveAgent-R1: Advancing VLM-based Autonomous Driving with Hybrid Thinking and Active Perception", "comment": null, "summary": "Vision-Language Models (VLMs) are advancing autonomous driving, yet their\npotential is constrained by myopic decision-making and passive perception,\nlimiting reliability in complex environments. We introduce DriveAgent-R1 to\ntackle these challenges in long-horizon, high-level behavioral decision-making.\nDriveAgent-R1 features two core innovations: a Hybrid-Thinking framework that\nadaptively switches between efficient text-based and in-depth tool-based\nreasoning, and an Active Perception mechanism with a vision toolkit to\nproactively resolve uncertainties, thereby balancing decision-making efficiency\nand reliability. The agent is trained using a novel, three-stage progressive\nreinforcement learning strategy designed to master these hybrid capabilities.\nExtensive experiments demonstrate that DriveAgent-R1 achieves state-of-the-art\nperformance, outperforming even leading proprietary large multimodal models,\nsuch as Claude Sonnet 4. Ablation studies validate our approach and confirm\nthat the agent's decisions are robustly grounded in actively perceived visual\nevidence, paving a path toward safer and more intelligent autonomous systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20884", "categories": ["cs.CV", "cs.CL", "eess.IV"], "pdf": "https://arxiv.org/pdf/2507.20884", "abs": "https://arxiv.org/abs/2507.20884", "authors": ["Dinh Nam Pham", "Eleftherios Avramidis"], "title": "The Importance of Facial Features in Vision-based Sign Language Recognition: Eyes, Mouth or Full Face?", "comment": "Accepted at 9th International Workshop on Sign Language Translation\n  and Avatar Technologies @ ACM IVA'25", "summary": "Non-manual facial features play a crucial role in sign language\ncommunication, yet their importance in automatic sign language recognition\n(ASLR) remains underexplored. While prior studies have shown that incorporating\nfacial features can improve recognition, related work often relies on\nhand-crafted feature extraction and fails to go beyond the comparison of manual\nfeatures versus the combination of manual and facial features. In this work, we\nsystematically investigate the contribution of distinct facial regionseyes,\nmouth, and full faceusing two different deep learning models (a CNN-based model\nand a transformer-based model) trained on an SLR dataset of isolated signs with\nrandomly selected classes. Through quantitative performance and qualitative\nsaliency map evaluation, we reveal that the mouth is the most important\nnon-manual facial feature, significantly improving accuracy. Our findings\nhighlight the necessity of incorporating facial features in ASLR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20901", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.20901", "abs": "https://arxiv.org/abs/2507.20901", "authors": ["Manasi Muglikar", "Nico Messikommer", "Marco Cannici", "Davide Scaramuzza"], "title": "Event-Based De-Snowing for Autonomous Driving", "comment": null, "summary": "Adverse weather conditions, particularly heavy snowfall, pose significant\nchallenges to both human drivers and autonomous vehicles. Traditional\nimage-based de-snowing methods often introduce hallucination artifacts as they\nrely solely on spatial information, while video-based approaches require high\nframe rates and suffer from alignment artifacts at lower frame rates. Camera\nparameters, such as exposure time, also influence the appearance of snowflakes,\nmaking the problem difficult to solve and heavily dependent on network\ngeneralization. In this paper, we propose to address the challenge of desnowing\nby using event cameras, which offer compressed visual information with\nsubmillisecond latency, making them ideal for de-snowing images, even in the\npresence of ego-motion. Our method leverages the fact that snowflake occlusions\nappear with a very distinctive streak signature in the spatio-temporal\nrepresentation of event data. We design an attention-based module that focuses\non events along these streaks to determine when a background point was occluded\nand use this information to recover its original intensity. We benchmark our\nmethod on DSEC-Snow, a new dataset created using a green-screen technique that\noverlays pre-recorded snowfall data onto the existing DSEC driving dataset,\nresulting in precise ground truth and synchronized image and event streams. Our\napproach outperforms state-of-the-art de-snowing methods by 3 dB in PSNR for\nimage reconstruction. Moreover, we show that off-the-shelf computer vision\nalgorithms can be applied to our reconstructions for tasks such as depth\nestimation and optical flow, achieving a $20\\%$ performance improvement over\nother de-snowing methods. Our work represents a crucial step towards enhancing\nthe reliability and safety of vision systems in challenging winter conditions,\npaving the way for more robust, all-weather-capable applications.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "safety", "reliability"], "score": 4}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.20994", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.20994", "abs": "https://arxiv.org/abs/2507.20994", "authors": ["Shen Li", "Liuyi Yao", "Wujia Niu", "Lan Zhang", "Yaliang Li"], "title": "Security Tensors as a Cross-Modal Bridge: Extending Text-Aligned Safety to Vision in LVLM", "comment": "Codes and data are available at\n  https://github.com/listen0425/Security-Tensors", "summary": "Large visual-language models (LVLMs) integrate aligned large language models\n(LLMs) with visual modules to process multimodal inputs. However, the safety\nmechanisms developed for text-based LLMs do not naturally extend to visual\nmodalities, leaving LVLMs vulnerable to harmful image inputs. To address this\ncross-modal safety gap, we introduce security tensors - trainable input vectors\napplied during inference through either the textual or visual modality. These\ntensors transfer textual safety alignment to visual processing without\nmodifying the model's parameters. They are optimized using a curated dataset\ncontaining (i) malicious image-text pairs requiring rejection, (ii) contrastive\nbenign pairs with text structurally similar to malicious queries, with the\npurpose of being contrastive examples to guide visual reliance, and (iii)\ngeneral benign samples preserving model functionality. Experimental results\ndemonstrate that both textual and visual security tensors significantly enhance\nLVLMs' ability to reject diverse harmful visual inputs while maintaining\nnear-identical performance on benign tasks. Further internal analysis towards\nhidden-layer representations reveals that security tensors successfully\nactivate the language module's textual \"safety layers\" in visual inputs,\nthereby effectively extending text-based safety to the visual modality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety"], "score": 2}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.21033", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.21033", "abs": "https://arxiv.org/abs/2507.21033", "authors": ["Yuhan Wang", "Siwei Yang", "Bingchen Zhao", "Letian Zhang", "Qing Liu", "Yuyin Zhou", "Cihang Xie"], "title": "GPT-IMAGE-EDIT-1.5M: A Million-Scale, GPT-Generated Image Dataset", "comment": null, "summary": "Recent advancements in large multimodal models like GPT-4o have set a new\nstandard for high-fidelity, instruction-guided image editing. However, the\nproprietary nature of these models and their training data creates a\nsignificant barrier for open-source research. To bridge this gap, we introduce\nGPT-IMAGE-EDIT-1.5M, a publicly available, large-scale image-editing corpus\ncontaining more than 1.5 million high-quality triplets (instruction, source\nimage, edited image). We systematically construct this dataset by leveraging\nthe versatile capabilities of GPT-4o to unify and refine three popular\nimage-editing datasets: OmniEdit, HQ-Edit, and UltraEdit. Specifically, our\nmethodology involves 1) regenerating output images to enhance visual quality\nand instruction alignment, and 2) selectively rewriting prompts to improve\nsemantic clarity. To validate the efficacy of our dataset, we fine-tune\nadvanced open-source models on GPT-IMAGE-EDIT-1.5M. The empirical results are\nexciting, e.g., the fine-tuned FluxKontext achieves highly competitive\nperformance across a comprehensive suite of benchmarks, including 7.24 on\nGEdit-EN, 3.80 on ImgEdit-Full, and 8.78 on Complex-Edit, showing stronger\ninstruction following and higher perceptual quality while maintaining identity.\nThese scores markedly exceed all previously published open-source methods and\nsubstantially narrow the gap to leading proprietary models. We hope the full\nrelease of GPT-IMAGE-EDIT-1.5M can help to catalyze further open research in\ninstruction-guided image editing.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
{"id": "2507.19836", "categories": ["cs.GR", "cs.AI", "cs.CV", "cs.MM", "cs.SD"], "pdf": "https://arxiv.org/pdf/2507.19836", "abs": "https://arxiv.org/abs/2507.19836", "authors": ["Xuanchen Wang", "Heng Wang", "Weidong Cai"], "title": "ChoreoMuse: Robust Music-to-Dance Video Generation with Style Transfer and Beat-Adherent Motion", "comment": "10 pages, 5 figures, accepted by the 33rd ACM International\n  Conference on Multimedia (ACM MM 2025), demo page:\n  https://choreomuse.github.io", "summary": "Modern artistic productions increasingly demand automated choreography\ngeneration that adapts to diverse musical styles and individual dancer\ncharacteristics. Existing approaches often fail to produce high-quality dance\nvideos that harmonize with both musical rhythm and user-defined choreography\nstyles, limiting their applicability in real-world creative contexts. To\naddress this gap, we introduce ChoreoMuse, a diffusion-based framework that\nuses SMPL format parameters and their variation version as intermediaries\nbetween music and video generation, thereby overcoming the usual constraints\nimposed by video resolution. Critically, ChoreoMuse supports\nstyle-controllable, high-fidelity dance video generation across diverse musical\ngenres and individual dancer characteristics, including the flexibility to\nhandle any reference individual at any resolution. Our method employs a novel\nmusic encoder MotionTune to capture motion cues from audio, ensuring that the\ngenerated choreography closely follows the beat and expressive qualities of the\ninput music. To quantitatively evaluate how well the generated dances match\nboth musical and choreographic styles, we introduce two new metrics that\nmeasure alignment with the intended stylistic cues. Extensive experiments\nconfirm that ChoreoMuse achieves state-of-the-art performance across multiple\ndimensions, including video quality, beat alignment, dance diversity, and style\nadherence, demonstrating its potential as a robust solution for a wide range of\ncreative applications. Video results can be found on our project page:\nhttps://choreomuse.github.io.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-29.jsonl"}
