{"id": "2505.20622", "pdf": "https://arxiv.org/pdf/2505.20622", "abs": "https://arxiv.org/abs/2505.20622", "authors": ["Ting Xu", "Zhichao Huang", "Jiankai Sun", "Shanbo Cheng", "Wai Lam"], "title": "SeqPO-SiMT: Sequential Policy Optimization for Simultaneous Machine Translation", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "Accepted by The 63rd Annual Meeting of the Association for\n  Computational Linguistics (ACL 2025)", "summary": "We present Sequential Policy Optimization for Simultaneous Machine\nTranslation (SeqPO-SiMT), a new policy optimization framework that defines the\nsimultaneous machine translation (SiMT) task as a sequential decision making\nproblem, incorporating a tailored reward to enhance translation quality while\nreducing latency. In contrast to popular Reinforcement Learning from Human\nFeedback (RLHF) methods, such as PPO and DPO, which are typically applied in\nsingle-step tasks, SeqPO-SiMT effectively tackles the multi-step SiMT task.\nThis intuitive framework allows the SiMT LLMs to simulate and refine the SiMT\nprocess using a tailored reward. We conduct experiments on six datasets from\ndiverse domains for En to Zh and Zh to En SiMT tasks, demonstrating that\nSeqPO-SiMT consistently achieves significantly higher translation quality with\nlower latency. In particular, SeqPO-SiMT outperforms the supervised fine-tuning\n(SFT) model by 1.13 points in COMET, while reducing the Average Lagging by 6.17\nin the NEWSTEST2021 En to Zh dataset. While SiMT operates with far less context\nthan offline translation, the SiMT results of SeqPO-SiMT on 7B LLM surprisingly\nrival the offline translation of high-performing LLMs, including\nQwen-2.5-7B-Instruct and LLaMA-3-8B-Instruct.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "PPO", "reinforcement learning", "policy optimization", "DPO"], "score": 5}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20336", "pdf": "https://arxiv.org/pdf/2505.20336", "abs": "https://arxiv.org/abs/2505.20336", "authors": ["Yu Zhang", "Wanli Jiang", "Zhengyu Yang"], "title": "MOSLIM:Align with diverse preferences in prompts through reward classification", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "The multi-objective alignment of Large Language Models (LLMs) is essential\nfor ensuring foundational models conform to diverse human preferences. Current\nresearch in this field typically involves either multiple policies or multiple\nreward models customized for various preferences, or the need to train a\npreference-specific supervised fine-tuning (SFT) model. In this work, we\nintroduce a novel multi-objective alignment method, MOSLIM, which utilizes a\nsingle reward model and policy model to address diverse objectives. MOSLIM\nprovides a flexible way to control these objectives through prompting and does\nnot require preference training during SFT phase, allowing thousands of\noff-the-shelf models to be directly utilized within this training framework.\nMOSLIM leverages a multi-head reward model that classifies question-answer\npairs instead of scoring them and then optimize policy model with a scalar\nreward derived from a mapping function that converts classification results\nfrom reward model into reward scores. We demonstrate the efficacy of our\nproposed method across several multi-objective benchmarks and conduct ablation\nstudies on various reward model sizes and policy optimization methods. The\nMOSLIM method outperforms current multi-objective approaches in most results\nwhile requiring significantly fewer GPU computing resources compared with\nexisting policy optimization methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "policy optimization", "preference", "alignment"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20871", "pdf": "https://arxiv.org/pdf/2505.20871", "abs": "https://arxiv.org/abs/2505.20871", "authors": ["Xin Sun", "Jianan Xie", "Zhongqi Chen", "Qiang Liu", "Shu Wu", "Yuehe Chen", "Bowen Song", "Weiqiang Wang", "Zilei Wang", "Liang Wang"], "title": "Divide-Then-Align: Honest Alignment based on the Knowledge Boundary of RAG", "categories": ["cs.CL"], "comment": "ACL 2025 main", "summary": "Large language models (LLMs) augmented with retrieval systems have\nsignificantly advanced natural language processing tasks by integrating\nexternal knowledge sources, enabling more accurate and contextually rich\nresponses. To improve the robustness of such systems against noisy retrievals,\nRetrieval-Augmented Fine-Tuning (RAFT) has emerged as a widely adopted method.\nHowever, RAFT conditions models to generate answers even in the absence of\nreliable knowledge. This behavior undermines their reliability in high-stakes\ndomains, where acknowledging uncertainty is critical. To address this issue, we\npropose Divide-Then-Align (DTA), a post-training approach designed to endow RAG\nsystems with the ability to respond with \"I don't know\" when the query is out\nof the knowledge boundary of both the retrieved passages and the model's\ninternal knowledge. DTA divides data samples into four knowledge quadrants and\nconstructs tailored preference data for each quadrant, resulting in a curated\ndataset for Direct Preference Optimization (DPO). Experimental results on three\nbenchmark datasets demonstrate that DTA effectively balances accuracy with\nappropriate abstention, enhancing the reliability and trustworthiness of\nretrieval-augmented systems.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO", "direct preference optimization"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "reliability", "accuracy"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20975", "pdf": "https://arxiv.org/pdf/2505.20975", "abs": "https://arxiv.org/abs/2505.20975", "authors": ["Shamil Ayupov", "Maksim Nakhodnov", "Anastasia Yaschenko", "Andrey Kuznetsov", "Aibek Alanov"], "title": "DreamBoothDPO: Improving Personalized Generation using Direct Preference Optimization", "categories": ["cs.CV"], "comment": "The first two authors contributed equally. The source code can be\n  found at https://github.com/ControlGenAI/DreamBoothDPO", "summary": "Personalized diffusion models have shown remarkable success in Text-to-Image\n(T2I) generation by enabling the injection of user-defined concepts into\ndiverse contexts. However, balancing concept fidelity with contextual alignment\nremains a challenging open problem. In this work, we propose an RL-based\napproach that leverages the diverse outputs of T2I models to address this\nissue. Our method eliminates the need for human-annotated scores by generating\na synthetic paired dataset for DPO-like training using external quality\nmetrics. These better-worse pairs are specifically constructed to improve both\nconcept fidelity and prompt adherence. Moreover, our approach supports flexible\nadjustment of the trade-off between image fidelity and textual alignment.\nThrough multi-step training, our approach outperforms a naive baseline in\nconvergence speed and output quality. We conduct extensive qualitative and\nquantitative analysis, demonstrating the effectiveness of our method across\nvarious architectures and fine-tuning techniques. The source code can be found\nat https://github.com/ControlGenAI/DreamBoothDPO.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO", "direct preference optimization"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21061", "pdf": "https://arxiv.org/pdf/2505.21061", "abs": "https://arxiv.org/abs/2505.21061", "authors": ["Fatemeh Pesaran Zadeh", "Yoojin Oh", "Gunhee Kim"], "title": "LPOI: Listwise Preference Optimization for Vision Language Models", "categories": ["cs.CV", "cs.AI"], "comment": "ACL 2025 Main. Code is released at\n  https://github.com/fatemehpesaran310/lpoi", "summary": "Aligning large VLMs with human preferences is a challenging task, as methods\nlike RLHF and DPO often overfit to textual information or exacerbate\nhallucinations. Although augmenting negative image samples partially addresses\nthese pitfalls, no prior work has employed listwise preference optimization for\nVLMs, due to the complexity and cost of constructing listwise image samples. In\nthis work, we propose LPOI, the first object-aware listwise preference\noptimization developed for reducing hallucinations in VLMs. LPOI identifies and\nmasks a critical object in the image, and then interpolates the masked region\nbetween the positive and negative images to form a sequence of incrementally\nmore complete images. The model is trained to rank these images in ascending\norder of object visibility, effectively reducing hallucinations while retaining\nvisual fidelity. LPOI requires no extra annotations beyond standard pairwise\npreference data, as it automatically constructs the ranked lists through object\nmasking and interpolation. Comprehensive experiments on MMHalBench, AMBER, and\nObject HalBench confirm that LPOI outperforms existing preference optimization\nmethods in reducing hallucinations and enhancing VLM performance. We make the\ncode available at https://github.com/fatemehpesaran310/lpoi.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "preference", "pairwise", "DPO"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20825", "pdf": "https://arxiv.org/pdf/2505.20825", "abs": "https://arxiv.org/abs/2505.20825", "authors": ["Yuhao Wang", "Ruiyang Ren", "Yucheng Wang", "Wayne Xin Zhao", "Jing Liu", "Hua Wu", "Haifeng Wang"], "title": "Reinforced Informativeness Optimization for Long-Form Retrieval-Augmented Generation", "categories": ["cs.CL"], "comment": null, "summary": "Long-form question answering (LFQA) presents unique challenges for large\nlanguage models, requiring the synthesis of coherent, paragraph-length answers.\nWhile retrieval-augmented generation (RAG) systems have emerged as a promising\nsolution, existing research struggles with key limitations: the scarcity of\nhigh-quality training data for long-form generation, the compounding risk of\nhallucination in extended outputs, and the absence of reliable evaluation\nmetrics for factual completeness. In this paper, we propose RioRAG, a novel\nreinforcement learning (RL) framework that advances long-form RAG through\nreinforced informativeness optimization. Our approach introduces two\nfundamental innovations to address the core challenges. First, we develop an RL\ntraining paradigm of reinforced informativeness optimization that directly\noptimizes informativeness and effectively addresses the slow-thinking deficit\nin conventional RAG systems, bypassing the need for expensive supervised data.\nSecond, we propose a nugget-centric hierarchical reward modeling approach that\nenables precise assessment of long-form answers through a three-stage process:\nextracting the nugget from every source webpage, constructing a nugget claim\nchecklist, and computing rewards based on factual alignment. Extensive\nexperiments on two LFQA benchmarks LongFact and RAGChecker demonstrate the\neffectiveness of the proposed method. Our codes are available at\nhttps://github.com/RUCAIBox/RioRAG.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward modeling", "reinforcement learning", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "question answering"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20315", "pdf": "https://arxiv.org/pdf/2505.20315", "abs": "https://arxiv.org/abs/2505.20315", "authors": ["Zhewei Yao", "Guoheng Sun", "Lukasz Borchmann", "Zheyu Shen", "Minghang Deng", "Bohan Zhai", "Hao Zhang", "Ang Li", "Yuxiong He"], "title": "Arctic-Text2SQL-R1: Simple Rewards, Strong Reasoning in Text-to-SQL", "categories": ["cs.CL", "cs.AI"], "comment": "22 pages, 2 figures", "summary": "Translating natural language into SQL (Test2SQL) is a longstanding challenge\nat the intersection of natural language understanding and structured data\naccess. While large language models (LLMs) have significantly improved fluency\nin SQL generation, producing correct and executable SQL--particularly for\ncomplex queries--remains a bottleneck. We present Arctic-Text2SQL-R1, a\nreinforcement learning (RL) framework and model family designed to generate\naccurate, executable SQL using a lightweight reward signal based solely on\nexecution correctness. Our approach avoids brittle intermediate supervision and\ncomplex reward shaping, promoting stable training and alignment with the end\ntask. Combined with carefully curated data, strong supervised initialization,\nand effective training practices, Arctic-Text2SQL-R1 achieves state-of-the-art\nexecution accuracy across six diverse Test2SQL benchmarks, including the top\nposition on the BIRD leaderboard. Notably, our 7B model outperforms prior\n70B-class systems, highlighting the framework's scalability and efficiency. We\nfurther demonstrate inference-time robustness through simple extensions like\nvalue retrieval and majority voting. Extensive experiments and ablation studies\noffer both positive and negative insights, providing practical guidance for\nfuture Test2SQL research.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20612", "pdf": "https://arxiv.org/pdf/2505.20612", "abs": "https://arxiv.org/abs/2505.20612", "authors": ["Peter Robicheaux", "Matvei Popov", "Anish Madan", "Isaac Robinson", "Joseph Nelson", "Deva Ramanan", "Neehar Peri"], "title": "Roboflow100-VL: A Multi-Domain Object Detection Benchmark for Vision-Language Models", "categories": ["cs.CV", "cs.CL", "cs.LG"], "comment": "The first two authors contributed equally", "summary": "Vision-language models (VLMs) trained on internet-scale data achieve\nremarkable zero-shot detection performance on common objects like car, truck,\nand pedestrian. However, state-of-the-art models still struggle to generalize\nto out-of-distribution classes, tasks and imaging modalities not typically\nfound in their pre-training. Rather than simply re-training VLMs on more visual\ndata, we argue that one should align VLMs to new concepts with annotation\ninstructions containing a few visual examples and rich textual descriptions. To\nthis end, we introduce Roboflow100-VL, a large-scale collection of 100\nmulti-modal object detection datasets with diverse concepts not commonly found\nin VLM pre-training. We evaluate state-of-the-art models on our benchmark in\nzero-shot, few-shot, semi-supervised, and fully-supervised settings, allowing\nfor comparison across data regimes. Notably, we find that VLMs like\nGroundingDINO and Qwen2.5-VL achieve less than 2% zero-shot accuracy on\nchallenging medical imaging datasets within Roboflow100-VL, demonstrating the\nneed for few-shot concept alignment. Our code and dataset are available at\nhttps://github.com/roboflow/rf100-vl/ and\nhttps://universe.roboflow.com/rf100-vl/", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation", "accuracy"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20487", "pdf": "https://arxiv.org/pdf/2505.20487", "abs": "https://arxiv.org/abs/2505.20487", "authors": ["Roi Cohen", "Russa Biswas", "Gerard de Melo"], "title": "InFact: Informativeness Alignment for Improved LLM Factuality", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Factual completeness is a general term that captures how detailed and\ninformative a factually correct text is. For instance, the factual sentence\n``Barack Obama was born in the United States'' is factually correct, though\nless informative than the factual sentence ``Barack Obama was born in Honolulu,\nHawaii, United States''. Despite the known fact that LLMs tend to hallucinate\nand generate factually incorrect text, they might also tend to choose to\ngenerate factual text that is indeed factually correct and yet less informative\nthan other, more informative choices. In this work, we tackle this problem by\nproposing an informativeness alignment mechanism. This mechanism takes\nadvantage of recent factual benchmarks to propose an informativeness alignment\nobjective. This objective prioritizes answers that are both correct and\ninformative. A key finding of our work is that when training a model to\nmaximize this objective or optimize its preference, we can improve not just\ninformativeness but also factuality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["factuality"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20732", "pdf": "https://arxiv.org/pdf/2505.20732", "abs": "https://arxiv.org/abs/2505.20732", "authors": ["Hanlin Wang", "Chak Tou Leong", "Jiashuo Wang", "Jian Wang", "Wenjie Li"], "title": "SPA-RL: Reinforcing LLM Agents via Stepwise Progress Attribution", "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "Reinforcement learning (RL) holds significant promise for training LLM agents\nto handle complex, goal-oriented tasks that require multi-step interactions\nwith external environments. However, a critical challenge when applying RL to\nthese agentic tasks arises from delayed rewards: feedback signals are typically\navailable only after the entire task is completed. This makes it non-trivial to\nassign delayed rewards to earlier actions, providing insufficient guidance\nregarding environmental constraints and hindering agent training. In this work,\nwe draw on the insight that the ultimate completion of a task emerges from the\ncumulative progress an agent makes across individual steps. We propose Stepwise\nProgress Attribution (SPA), a general reward redistribution framework that\ndecomposes the final reward into stepwise contributions, each reflecting its\nincremental progress toward overall task completion. To achieve this, we train\na progress estimator that accumulates stepwise contributions over a trajectory\nto match the task completion. During policy optimization, we combine the\nestimated per-step contribution with a grounding signal for actions executed in\nthe environment as the fine-grained, intermediate reward for effective agent\ntraining. Extensive experiments on common agent benchmarks (including Webshop,\nALFWorld, and VirtualHome) demonstrate that SPA consistently outperforms the\nstate-of-the-art method in both success rate (+2.5\\% on average) and grounding\naccuracy (+1.9\\% on average). Further analyses demonstrate that our method\nremarkably provides more effective intermediate rewards for RL training. Our\ncode is available at https://github.com/WangHanLinHenry/SPA-RL-Agent.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20925", "pdf": "https://arxiv.org/pdf/2505.20925", "abs": "https://arxiv.org/abs/2505.20925", "authors": ["Zhuo Li", "Guodong Du", "Weiyang Guo", "Yigeng Zhou", "Xiucheng Li", "Wenya Wang", "Fangming Liu", "Yequan Wang", "Deheng Ye", "Min Zhang", "Jing Li"], "title": "Multi-objective Large Language Model Alignment with Hierarchical Experts", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Aligning large language models (LLMs) to simultaneously satisfy multiple\nobjectives remains a significant challenge, especially given the diverse and\noften conflicting nature of human preferences. Existing alignment methods\nstruggle to balance trade-offs effectively, often requiring costly retraining\nor yielding suboptimal results across the Pareto frontier of preferences. In\nthis paper, we introduce \\textit{HoE}(Hierarchical Mixture-of-Experts), a\n\\textit{lightweight}, \\textit{parameter-efficient}, and \\textit{plug-and-play}\napproach that eliminates the need for model training, while enabling LLMs to\nadapt across the entire Pareto frontier and accommodate diverse user\npreferences. In particular, \\textit{HoE} consists of three hierarchical\ncomponents: LoRA Experts, Router Experts and Preference Routing, reaching\noptimal Pareto frontiers and achieving a trade-off between parameter size,\ntraining cost, and performance. We evaluate \\textit{HoE} across various tasks\non 14 objectives and 200 different preferences among 6 benchmarks,\ndemonstrating superior performance over 15 recent baselines. Code is available\nin the supplementary materials.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21179", "pdf": "https://arxiv.org/pdf/2505.21179", "abs": "https://arxiv.org/abs/2505.21179", "authors": ["Dar-Yen Chen", "Hmrishav Bandyopadhyay", "Kai Zou", "Yi-Zhe Song"], "title": "Normalized Attention Guidance: Universal Negative Guidance for Diffusion Model", "categories": ["cs.CV"], "comment": null, "summary": "Negative guidance -- explicitly suppressing unwanted attributes -- remains a\nfundamental challenge in diffusion models, particularly in few-step sampling\nregimes. While Classifier-Free Guidance (CFG) works well in standard settings,\nit fails under aggressive sampling step compression due to divergent\npredictions between positive and negative branches. We present Normalized\nAttention Guidance (NAG), an efficient, training-free mechanism that applies\nextrapolation in attention space with L1-based normalization and refinement.\nNAG restores effective negative guidance where CFG collapses while maintaining\nfidelity. Unlike existing approaches, NAG generalizes across architectures\n(UNet, DiT), sampling regimes (few-step, multi-step), and modalities (image,\nvideo), functioning as a \\textit{universal} plug-in with minimal computational\noverhead. Through extensive experimentation, we demonstrate consistent\nimprovements in text alignment (CLIP Score), fidelity (FID, PFID), and\nhuman-perceived quality (ImageReward). Our ablation studies validate each\ndesign component, while user studies confirm significant preference for\nNAG-guided outputs. As a model-agnostic inference-time approach requiring no\nretraining, NAG provides effortless negative guidance for all modern diffusion\nframeworks -- pseudocode in the Appendix!", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21172", "pdf": "https://arxiv.org/pdf/2505.21172", "abs": "https://arxiv.org/abs/2505.21172", "authors": ["Zheng Li", "Mao Zheng", "Mingyang Song", "Wenjie Yang"], "title": "TAT-R1: Terminology-Aware Translation with Reinforcement Learning and Word Alignment", "categories": ["cs.CL"], "comment": null, "summary": "Recently, deep reasoning large language models(LLMs) like DeepSeek-R1 have\nmade significant progress in tasks such as mathematics and coding. Inspired by\nthis, several studies have employed reinforcement learning(RL) to enhance\nmodels' deep reasoning capabilities and improve machine translation(MT)\nquality. However, the terminology translation, an essential task in MT, remains\nunexplored in deep reasoning LLMs. In this paper, we propose \\textbf{TAT-R1}, a\nterminology-aware translation model trained with reinforcement learning and\nword alignment. Specifically, we first extract the keyword translation pairs\nusing a word alignment model. Then we carefully design three types of\nrule-based alignment rewards with the extracted alignment relationships. With\nthose alignment rewards, the RL-trained translation model can learn to focus on\nthe accurate translation of key information, including terminology in the\nsource text. Experimental results show the effectiveness of TAT-R1. Our model\nsignificantly improves terminology translation accuracy compared to the\nbaseline models while maintaining comparable performance on general translation\ntasks. In addition, we conduct detailed ablation studies of the\nDeepSeek-R1-like training paradigm for machine translation and reveal several\nkey findings.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21178", "pdf": "https://arxiv.org/pdf/2505.21178", "abs": "https://arxiv.org/abs/2505.21178", "authors": ["Mingyang Song", "Mao Zheng"], "title": "Walk Before You Run! Concise LLM Reasoning via Reinforcement Learning", "categories": ["cs.CL"], "comment": "Ongoing Work", "summary": "As test-time scaling becomes a pivotal research frontier in Large Language\nModels (LLMs) development, contemporary and advanced post-training\nmethodologies increasingly focus on extending the generation length of long\nChain-of-Thought (CoT) responses to enhance reasoning capabilities toward\nDeepSeek R1-like performance. However, recent studies reveal a persistent\noverthinking phenomenon in state-of-the-art reasoning models, manifesting as\nexcessive redundancy or repetitive thinking patterns in long CoT responses. To\naddress this issue, in this paper, we propose a simple yet effective two-stage\nreinforcement learning framework for achieving concise reasoning in LLMs, named\nConciseR. Specifically, the first stage, using more training steps, aims to\nincentivize the model's reasoning capabilities via Group Relative Policy\nOptimization with clip-higher and dynamic sampling components (GRPO++), and the\nsecond stage, using fewer training steps, explicitly enforces conciseness and\nimproves efficiency via Length-aware Group Relative Policy Optimization\n(L-GRPO). Significantly, ConciseR only optimizes response length once all\nrollouts of a sample are correct, following the \"walk before you run\"\nprinciple. Extensive experimental results demonstrate that our ConciseR model,\nwhich generates more concise CoT reasoning responses, outperforms recent\nstate-of-the-art reasoning models with zero RL paradigm across AIME 2024,\nMATH-500, AMC 2023, Minerva, and Olympiad benchmarks.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21378", "pdf": "https://arxiv.org/pdf/2505.21378", "abs": "https://arxiv.org/abs/2505.21378", "authors": ["Jules Watson", "Xi Wang", "Raymond Liu", "Suzanne Stevenson", "Barend Beekhuizen"], "title": "Analyzing values about gendered language reform in LLMs' revisions", "categories": ["cs.CL"], "comment": "15 pages", "summary": "Within the common LLM use case of text revision, we study LLMs' revision of\ngendered role nouns (e.g., outdoorsperson/woman/man) and their justifications\nof such revisions. We evaluate their alignment with feminist and\ntrans-inclusive language reforms for English. Drawing on insight from\nsociolinguistics, we further assess if LLMs are sensitive to the same\ncontextual effects in the application of such reforms as people are, finding\nbroad evidence of such effects. We discuss implications for value alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "value alignment"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20612", "pdf": "https://arxiv.org/pdf/2505.20612", "abs": "https://arxiv.org/abs/2505.20612", "authors": ["Peter Robicheaux", "Matvei Popov", "Anish Madan", "Isaac Robinson", "Joseph Nelson", "Deva Ramanan", "Neehar Peri"], "title": "Roboflow100-VL: A Multi-Domain Object Detection Benchmark for Vision-Language Models", "categories": ["cs.CV", "cs.CL", "cs.LG"], "comment": "The first two authors contributed equally", "summary": "Vision-language models (VLMs) trained on internet-scale data achieve\nremarkable zero-shot detection performance on common objects like car, truck,\nand pedestrian. However, state-of-the-art models still struggle to generalize\nto out-of-distribution classes, tasks and imaging modalities not typically\nfound in their pre-training. Rather than simply re-training VLMs on more visual\ndata, we argue that one should align VLMs to new concepts with annotation\ninstructions containing a few visual examples and rich textual descriptions. To\nthis end, we introduce Roboflow100-VL, a large-scale collection of 100\nmulti-modal object detection datasets with diverse concepts not commonly found\nin VLM pre-training. We evaluate state-of-the-art models on our benchmark in\nzero-shot, few-shot, semi-supervised, and fully-supervised settings, allowing\nfor comparison across data regimes. Notably, we find that VLMs like\nGroundingDINO and Qwen2.5-VL achieve less than 2% zero-shot accuracy on\nchallenging medical imaging datasets within Roboflow100-VL, demonstrating the\nneed for few-shot concept alignment. Our code and dataset are available at\nhttps://github.com/roboflow/rf100-vl/ and\nhttps://universe.roboflow.com/rf100-vl/", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation", "accuracy"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21493", "pdf": "https://arxiv.org/pdf/2505.21493", "abs": "https://arxiv.org/abs/2505.21493", "authors": ["Xiangxin Zhou", "Zichen Liu", "Anya Sims", "Haonan Wang", "Tianyu Pang", "Chongxuan Li", "Liang Wang", "Min Lin", "Chao Du"], "title": "Reinforcing General Reasoning without Verifiers", "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "The recent paradigm shift towards training large language models (LLMs) using\nDeepSeek-R1-Zero-style reinforcement learning (RL) on verifiable rewards has\nled to impressive advancements in code and mathematical reasoning. However,\nthis methodology is limited to tasks where rule-based answer verification is\npossible and does not naturally extend to real-world domains such as chemistry,\nhealthcare, engineering, law, biology, business, and economics. Current\npractical workarounds use an additional LLM as a model-based verifier; however,\nthis introduces issues such as reliance on a strong verifier LLM,\nsusceptibility to reward hacking, and the practical burden of maintaining the\nverifier model in memory during training. To address this and extend\nDeepSeek-R1-Zero-style training to general reasoning domains, we propose a\nverifier-free method (VeriFree) that bypasses answer verification and instead\nuses RL to directly maximize the probability of generating the reference\nanswer. We compare VeriFree with verifier-based methods and demonstrate that,\nin addition to its significant practical benefits and reduced compute\nrequirements, VeriFree matches and even surpasses verifier-based methods on\nextensive evaluations across MMLU-Pro, GPQA, SuperGPQA, and math-related\nbenchmarks. Moreover, we provide insights into this method from multiple\nperspectives: as an elegant integration of training both the policy and\nimplicit verifier in a unified model, and as a variational optimization\napproach. Code is available at https://github.com/sail-sg/VeriFree.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "reward hacking"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["mathematical reasoning"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20405", "pdf": "https://arxiv.org/pdf/2505.20405", "abs": "https://arxiv.org/abs/2505.20405", "authors": ["Lorenzo Baraldi", "Davide Bucciarelli", "Federico Betti", "Marcella Cornia", "Lorenzo Baraldi", "Nicu Sebe", "Rita Cucchiara"], "title": "What Changed? Detecting and Evaluating Instruction-Guided Image Edits with Multimodal Large Language Models", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.MM"], "comment": null, "summary": "Instruction-based image editing models offer increased personalization\nopportunities in generative tasks. However, properly evaluating their results\nis challenging, and most of the existing metrics lag in terms of alignment with\nhuman judgment and explainability. To tackle these issues, we introduce DICE\n(DIfference Coherence Estimator), a model designed to detect localized\ndifferences between the original and the edited image and to assess their\nrelevance to the given modification request. DICE consists of two key\ncomponents: a difference detector and a coherence estimator, both built on an\nautoregressive Multimodal Large Language Model (MLLM) and trained using a\nstrategy that leverages self-supervision, distillation from inpainting\nnetworks, and full supervision. Through extensive experiments, we evaluate each\nstage of our pipeline, comparing different MLLMs within the proposed framework.\nWe demonstrate that DICE effectively identifies coherent edits, effectively\nevaluating images generated by different editing models with a strong\ncorrelation with human judgment. We publicly release our source code, models,\nand data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20414", "pdf": "https://arxiv.org/pdf/2505.20414", "abs": "https://arxiv.org/abs/2505.20414", "authors": ["Royden Wagner", "Omer Sahin Tas", "Felix Hauser", "Marlon Steiner", "Dominik Strutz", "Abhishek Vivekanandan", "Carlos Fernandez", "Christoph Stiller"], "title": "RetroMotion: Retrocausal Motion Forecasting Models are Instructable", "categories": ["cs.CV", "cs.AI", "cs.RO"], "comment": null, "summary": "Motion forecasts of road users (i.e., agents) vary in complexity as a\nfunction of scene constraints and interactive behavior. We address this with a\nmulti-task learning method for motion forecasting that includes a retrocausal\nflow of information. The corresponding tasks are to forecast (1) marginal\ntrajectory distributions for all modeled agents and (2) joint trajectory\ndistributions for interacting agents. Using a transformer model, we generate\nthe joint distributions by re-encoding marginal distributions followed by\npairwise modeling. This incorporates a retrocausal flow of information from\nlater points in marginal trajectories to earlier points in joint trajectories.\nPer trajectory point, we model positional uncertainty using compressed\nexponential power distributions. Notably, our method achieves state-of-the-art\nresults in the Waymo Interaction Prediction dataset and generalizes well to the\nArgoverse 2 dataset. Additionally, our method provides an interface for issuing\ninstructions through trajectory modifications. Our experiments show that\nregular training of motion forecasting leads to the ability to follow\ngoal-based instructions and to adapt basic directional instructions to the\nscene context. Code: https://github.com/kit-mrt/future-motion", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20323", "pdf": "https://arxiv.org/pdf/2505.20323", "abs": "https://arxiv.org/abs/2505.20323", "authors": ["Shahriar Noroozizadeh", "Sayantan Kumar", "George H. Chen", "Jeremy C. Weiss"], "title": "PMOA-TTS: Introducing the PubMed Open Access Textual Times Series Corpus", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": null, "summary": "Understanding temporal dynamics in clinical narratives is essential for\nmodeling patient trajectories, yet large-scale temporally annotated resources\nremain limited. We present PMOA-TTS, the first openly available dataset of\n124,699 PubMed Open Access (PMOA) case reports, each converted into structured\n(event, time) timelines via a scalable LLM-based pipeline. Our approach\ncombines heuristic filtering with Llama 3.3 to identify single-patient case\nreports, followed by prompt-driven extraction using Llama 3.3 and DeepSeek R1,\nresulting in over 5.6 million timestamped clinical events. To assess timeline\nquality, we evaluate against a clinician-curated reference set using three\nmetrics: (i) event-level matching (80% match at a cosine similarity threshold\nof 0.1), (ii) temporal concordance (c-index > 0.90), and (iii) Area Under the\nLog-Time CDF (AULTC) for timestamp alignment. Corpus-level analysis shows wide\ndiagnostic and demographic coverage. In a downstream survival prediction task,\nembeddings from extracted timelines achieve time-dependent concordance indices\nup to 0.82 $\\pm$ 0.01, demonstrating the predictive value of temporally\nstructured narratives. PMOA-TTS provides a scalable foundation for timeline\nextraction, temporal reasoning, and longitudinal modeling in biomedical NLP.\nThe dataset is available at: https://huggingface.co/datasets/snoroozi/pmoa-tts .", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20325", "pdf": "https://arxiv.org/pdf/2505.20325", "abs": "https://arxiv.org/abs/2505.20325", "authors": ["Amirhosein Ghasemabadi", "Keith G. Mills", "Baochun Li", "Di Niu"], "title": "Guided by Gut: Efficient Test-Time Scaling with Reinforced Intrinsic Confidence", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Test-Time Scaling (TTS) methods for enhancing Large Language Model (LLM)\nreasoning often incur substantial computational costs, primarily due to\nextensive reliance on external Process Reward Models (PRMs) or sampling methods\nlike Best-of-N (BoN). This paper introduces Guided by Gut (GG), an efficient\nself-guided TTS framework that achieves PRM-level performance without costly\nexternal verifier models. Our method employs a lightweight tree search guided\nsolely by intrinsic LLM signals, token-level confidence and step novelty. One\ncritical innovation is improving the reliability of internal confidence\nestimates via a targeted reinforcement learning fine-tuning phase. Empirical\nevaluations on challenging mathematical reasoning benchmarks demonstrate that\nGG enables smaller models (e.g., 1.5B parameters) to achieve accuracy matching\nor surpassing significantly larger models (e.g., 32B-70B parameters), while\nreducing GPU memory usage by up to 10x. Compared to PRM-based methods, GG\nachieves comparable accuracy with 8x faster inference speeds and 4-5x lower\nmemory usage. Additionally, GG reduces KV cache memory usage by approximately\n50% compared to the BoN strategy, facilitating more efficient and practical\ndeployment of TTS techniques.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "accuracy", "mathematical reasoning"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20333", "pdf": "https://arxiv.org/pdf/2505.20333", "abs": "https://arxiv.org/abs/2505.20333", "authors": ["Yukun Zhang", "Qi Dong"], "title": "Multi-Scale Manifold Alignment: A Unified Framework for Enhanced Explainability of Large Language Models", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent advances in Large Language Models (LLMs) have achieved strong\nperformance, yet their internal reasoning remains opaque, limiting\ninterpretability and trust in critical applications. We propose a novel\nMulti_Scale Manifold Alignment framework that decomposes the latent space into\nglobal, intermediate, and local semantic manifolds capturing themes, context,\nand word-level details. Our method introduces cross_scale mapping functions\nthat jointly enforce geometric alignment (e.g., Procrustes analysis) and\ninformation preservation (via mutual information constraints like MINE or VIB).\nWe further incorporate curvature regularization and hyperparameter tuning for\nstable optimization. Theoretical analysis shows that alignment error, measured\nby KL divergence, can be bounded under mild assumptions. This framework offers\na unified explanation of how LLMs structure multi-scale semantics, advancing\ninterpretability and enabling applications such as bias detection and\nrobustness enhancement.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20335", "pdf": "https://arxiv.org/pdf/2505.20335", "abs": "https://arxiv.org/abs/2505.20335", "authors": ["Zishun Yu", "Shangzhe Li", "Xinhua Zhang"], "title": "Language Model Distillation: A Temporal Difference Imitation Learning Perspective", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large language models have led to significant progress across many NLP tasks,\nalthough their massive sizes often incur substantial computational costs.\nDistillation has become a common practice to compress these large and highly\ncapable models into smaller, more efficient ones. Many existing language model\ndistillation methods can be viewed as behavior cloning from the perspective of\nimitation learning or inverse reinforcement learning. This viewpoint has\ninspired subsequent studies that leverage (inverse) reinforcement learning\ntechniques, including variations of behavior cloning and temporal difference\nlearning methods. Rather than proposing yet another specific temporal\ndifference method, we introduce a general framework for temporal\ndifference-based distillation by exploiting the distributional sparsity of the\nteacher model. Specifically, it is often observed that language models assign\nmost probability mass to a small subset of tokens. Motivated by this\nobservation, we design a temporal difference learning framework that operates\non a reduced action space (a subset of vocabulary), and demonstrate how\npractical algorithms can be derived and the resulting performance improvements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21488", "pdf": "https://arxiv.org/pdf/2505.21488", "abs": "https://arxiv.org/abs/2505.21488", "authors": ["Omer Dahary", "Yehonathan Cohen", "Or Patashnik", "Kfir Aberman", "Daniel Cohen-Or"], "title": "Be Decisive: Noise-Induced Layouts for Multi-Subject Generation", "categories": ["cs.CV", "cs.AI", "cs.GR", "cs.LG"], "comment": "SIGGRAPH 2025. Project page: https://omer11a.github.io/be-decisive/", "summary": "Generating multiple distinct subjects remains a challenge for existing\ntext-to-image diffusion models. Complex prompts often lead to subject leakage,\ncausing inaccuracies in quantities, attributes, and visual features. Preventing\nleakage among subjects necessitates knowledge of each subject's spatial\nlocation. Recent methods provide these spatial locations via an external layout\ncontrol. However, enforcing such a prescribed layout often conflicts with the\ninnate layout dictated by the sampled initial noise, leading to misalignment\nwith the model's prior. In this work, we introduce a new approach that predicts\na spatial layout aligned with the prompt, derived from the initial noise, and\nrefines it throughout the denoising process. By relying on this noise-induced\nlayout, we avoid conflicts with externally imposed layouts and better preserve\nthe model's prior. Our method employs a small neural network to predict and\nrefine the evolving noise-induced layout at each denoising step, ensuring clear\nboundaries between subjects while maintaining consistency. Experimental results\nshow that this noise-aligned strategy achieves improved text-image alignment\nand more stable multi-subject generation compared to existing layout-guided\ntechniques, while preserving the rich diversity of the model's original\ndistribution.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20611", "pdf": "https://arxiv.org/pdf/2505.20611", "abs": "https://arxiv.org/abs/2505.20611", "authors": ["Zenghao Zheng", "Lianping Yang", "Jinshan Pan", "Hegui Zhu"], "title": "Mamba-Driven Topology Fusion for Monocular 3-D Human Pose Estimation", "categories": ["cs.CV"], "comment": null, "summary": "Transformer-based methods for 3-D human pose estimation face significant\ncomputational challenges due to the quadratic growth of self-attention\nmechanism complexity with sequence length. Recently, the Mamba model has\nsubstantially reduced computational overhead and demonstrated outstanding\nperformance in modeling long sequences by leveraging state space model (SSM).\nHowever, the ability of SSM to process sequential data is not suitable for 3-D\njoint sequences with topological structures, and the causal convolution\nstructure in Mamba also lacks insight into local joint relationships. To\naddress these issues, we propose the Mamba-Driven Topology Fusion framework in\nthis paper. Specifically, the proposed Bone Aware Module infers the direction\nand length of bone vectors in the spherical coordinate system, providing\neffective topological guidance for the Mamba model in processing joint\nsequences. Furthermore, we enhance the convolutional structure within the Mamba\nmodel by integrating forward and backward graph convolutional network, enabling\nit to better capture local joint dependencies. Finally, we design a\nSpatiotemporal Refinement Module to model both temporal and spatial\nrelationships within the sequence. Through the incorporation of skeletal\ntopology, our approach effectively alleviates Mamba's limitations in capturing\nhuman structural relationships. We conduct extensive experiments on the\nHuman3.6M and MPI-INF-3DHP datasets for testing and comparison, and the results\nshow that the proposed method greatly reduces computational cost while\nachieving higher accuracy. Ablation studies further demonstrate the\neffectiveness of each proposed module. The code and models will be released.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20347", "pdf": "https://arxiv.org/pdf/2505.20347", "abs": "https://arxiv.org/abs/2505.20347", "authors": ["Wenkai Fang", "Shunyu Liu", "Yang Zhou", "Kongcheng Zhang", "Tongya Zheng", "Kaixuan Chen", "Mingli Song", "Dacheng Tao"], "title": "SeRL: Self-Play Reinforcement Learning for Large Language Models with Limited Data", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Recent advances have demonstrated the effectiveness of Reinforcement Learning\n(RL) in improving the reasoning capabilities of Large Language Models (LLMs).\nHowever, existing works inevitably rely on high-quality instructions and\nverifiable rewards for effective training, both of which are often difficult to\nobtain in specialized domains. In this paper, we propose Self-play\nReinforcement Learning(SeRL) to bootstrap LLM training with limited initial\ndata. Specifically, SeRL comprises two complementary modules: self-instruction\nand self-rewarding. The former module generates additional instructions based\non the available data at each training step, employing robust online filtering\nstrategies to ensure instruction quality, diversity, and difficulty. The latter\nmodule introduces a simple yet effective majority-voting mechanism to estimate\nresponse rewards for additional instructions, eliminating the need for external\nannotations. Finally, SeRL performs conventional RL based on the generated\ndata, facilitating iterative self-play learning. Extensive experiments on\nvarious reasoning benchmarks and across different LLM backbones demonstrate\nthat the proposed SeRL yields results superior to its counterparts and achieves\nperformance on par with those obtained by high-quality data with verifiable\nrewards. Our code is available at https://github.com/wantbook-book/SeRL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20354", "pdf": "https://arxiv.org/pdf/2505.20354", "abs": "https://arxiv.org/abs/2505.20354", "authors": ["Juntong Wu", "Zijing Liu", "He Cao", "Hao Li", "Bin Feng", "Zishan Shu", "Ke Yu", "Li Yuan", "Yu Li"], "title": "Rethinking Text-based Protein Understanding: Retrieval or LLM?", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "In recent years, protein-text models have gained significant attention for\ntheir potential in protein generation and understanding. Current approaches\nfocus on integrating protein-related knowledge into large language models\nthrough continued pretraining and multi-modal alignment, enabling simultaneous\ncomprehension of textual descriptions and protein sequences. Through a thorough\nanalysis of existing model architectures and text-based protein understanding\nbenchmarks, we identify significant data leakage issues present in current\nbenchmarks. Moreover, conventional metrics derived from natural language\nprocessing fail to accurately assess the model's performance in this domain. To\naddress these limitations, we reorganize existing datasets and introduce a\nnovel evaluation framework based on biological entities. Motivated by our\nobservation, we propose a retrieval-enhanced method, which significantly\noutperforms fine-tuned LLMs for protein-to-text generation and shows accuracy\nand efficiency in training-free scenarios. Our code and data can be seen at\nhttps://github.com/IDEA-XL/RAPM.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20415", "pdf": "https://arxiv.org/pdf/2505.20415", "abs": "https://arxiv.org/abs/2505.20415", "authors": ["Xingwei Tan", "Marco Valentino", "Mahmud Akhter", "Maria Liakata", "Nikolaos Aletras"], "title": "Enhancing Logical Reasoning in Language Models via Symbolically-Guided Monte Carlo Process Supervision", "categories": ["cs.CL"], "comment": "Work in progress", "summary": "Large language models (LLMs) have shown promising performance in mathematical\nand logical reasoning benchmarks. However, recent studies have pointed to\nmemorization, rather than generalization, as one of the leading causes for such\nperformance. LLMs, in fact, are susceptible to content variations,\ndemonstrating a lack of robust symbolic abstractions supporting their reasoning\nprocess. To improve reliability, many attempts have been made to combine LLMs\nwith symbolic methods. Nevertheless, existing approaches fail to effectively\nleverage symbolic representations due to the challenges involved in developing\nreliable and scalable verification mechanisms. In this paper, we propose to\novercome such limitations by generating symbolic reasoning trajectories and\nselect the high-quality ones using a process reward model automatically tuned\nbased on Monte Carlo estimation. The trajectories are then employed via\nfine-tuning methods to improve logical reasoning and generalization. Our\nresults on logical reasoning benchmarks such as FOLIO and LogicAsker show the\neffectiveness of the proposed method with large gains on frontier and\nopen-weight models. Moreover, additional experiments on claim verification\nreveal that fine-tuning on the generated symbolic reasoning trajectories\nenhances out-of-domain generalizability, suggesting the potential impact of\nsymbolically-guided process supervision in alleviating the effect of\nmemorization on LLM reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20626", "pdf": "https://arxiv.org/pdf/2505.20626", "abs": "https://arxiv.org/abs/2505.20626", "authors": ["Yohai Mazuz", "Janna Bruner", "Lior Wolf"], "title": "ConsiStyle: Style Diversity in Training-Free Consistent T2I Generation", "categories": ["cs.CV"], "comment": null, "summary": "In text-to-image models, consistent character generation is the task of\nachieving text alignment while maintaining the subject's appearance across\ndifferent prompts. However, since style and appearance are often entangled, the\nexisting methods struggle to preserve consistent subject characteristics while\nadhering to varying style prompts. Current approaches for consistent\ntext-to-image generation typically rely on large-scale fine-tuning on curated\nimage sets or per-subject optimization, which either fail to generalize across\nprompts or do not align well with textual descriptions. Meanwhile,\ntraining-free methods often fail to maintain subject consistency across\ndifferent styles. In this work, we introduce a training-free method that\nachieves both style alignment and subject consistency. The attention matrices\nare manipulated such that Queries and Keys are obtained from the anchor\nimage(s) that are used to define the subject, while the Values are imported\nfrom a parallel copy that is not subject-anchored. Additionally, cross-image\ncomponents are added to the self-attention mechanism by expanding the Key and\nValue matrices. To do without shifting from the target style, we align the\nstatistics of the Value matrices. As is demonstrated in a comprehensive battery\nof qualitative and quantitative experiments, our method effectively decouples\nstyle from subject appearance and enables faithful generation of text-aligned\nimages with consistent characters across diverse styles.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20639", "pdf": "https://arxiv.org/pdf/2505.20639", "abs": "https://arxiv.org/abs/2505.20639", "authors": ["Guiping Cao", "Tao Wang", "Wenjian Huang", "Xiangyuan Lan", "Jianguo Zhang", "Dongmei Jiang"], "title": "Open-Det: An Efficient Learning Framework for Open-Ended Detection", "categories": ["cs.CV"], "comment": "ICML 2025", "summary": "Open-Ended object Detection (OED) is a novel and challenging task that\ndetects objects and generates their category names in a free-form manner,\nwithout requiring additional vocabularies during inference. However, the\nexisting OED models, such as GenerateU, require large-scale datasets for\ntraining, suffer from slow convergence, and exhibit limited performance. To\naddress these issues, we present a novel and efficient Open-Det framework,\nconsisting of four collaborative parts. Specifically, Open-Det accelerates\nmodel training in both the bounding box and object name generation process by\nreconstructing the Object Detector and the Object Name Generator. To bridge the\nsemantic gap between Vision and Language modalities, we propose a\nVision-Language Aligner with V-to-L and L-to-V alignment mechanisms,\nincorporating with the Prompts Distiller to transfer knowledge from the VLM\ninto VL-prompts, enabling accurate object name generation for the LLM. In\naddition, we design a Masked Alignment Loss to eliminate contradictory\nsupervision and introduce a Joint Loss to enhance classification, resulting in\nmore efficient training. Compared to GenerateU, Open-Det, using only 1.5% of\nthe training data (0.077M vs. 5.077M), 20.8% of the training epochs (31 vs.\n149), and fewer GPU resources (4 V100 vs. 16 A100), achieves even higher\nperformance (+1.0% in APr). The source codes are available at:\nhttps://github.com/Med-Process/Open-Det.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20451", "pdf": "https://arxiv.org/pdf/2505.20451", "abs": "https://arxiv.org/abs/2505.20451", "authors": ["Sahana Ramnath", "Anurag Mudgil", "Brihi Joshi", "Skyler Hallinan", "Xiang Ren"], "title": "Amulet: Putting Complex Multi-Turn Conversations on the Stand with LLM Juries", "categories": ["cs.CL"], "comment": null, "summary": "Today, large language models are widely used as judges to evaluate responses\nfrom other language models. Hence, it is imperative to benchmark and improve\nthese LLM-judges on real-world language model usage: a typical human-assistant\nconversation is lengthy, and shows significant diversity in topics, intents,\nand requirements across turns, e.g. social interactions, task requests,\nfeedback. We present Amulet, a framework that leverages pertinent linguistic\nconcepts of dialog-acts and maxims to improve the accuracy of LLM-judges on\npreference data with complex, multi-turn conversational context. Amulet\npresents valuable insights about (a) the communicative structures and intents\npresent in the conversation (dialog acts), and (b) the satisfaction of\nconversational principles (maxims) by the preference responses, and uses them\nto make judgments. On four challenging datasets, Amulet shows that (a) humans\nfrequently (60 to 70 percent of the time) change their intents from one turn of\nthe conversation to the next, and (b) in 75 percent of instances, the\npreference responses can be differentiated via dialog acts and/or maxims,\nreiterating the latter's significance in judging such data. Amulet can be used\neither as a judge by applying the framework to a single LLM, or integrated into\na jury with different LLM judges; our judges and juries show strong\nimprovements on relevant baselines for all four datasets.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20653", "pdf": "https://arxiv.org/pdf/2505.20653", "abs": "https://arxiv.org/abs/2505.20653", "authors": ["Lingyu Qiu", "Ke Jiang", "Xiaoyang Tan"], "title": "RoGA: Towards Generalizable Deepfake Detection through Robust Gradient Alignment", "categories": ["cs.CV", "cs.AI"], "comment": "Accepted to ICME2025", "summary": "Recent advancements in domain generalization for deepfake detection have\nattracted significant attention, with previous methods often incorporating\nadditional modules to prevent overfitting to domain-specific patterns. However,\nsuch regularization can hinder the optimization of the empirical risk\nminimization (ERM) objective, ultimately degrading model performance. In this\npaper, we propose a novel learning objective that aligns generalization\ngradient updates with ERM gradient updates. The key innovation is the\napplication of perturbations to model parameters, aligning the ascending points\nacross domains, which specifically enhances the robustness of deepfake\ndetection models to domain shifts. This approach effectively preserves\ndomain-invariant features while managing domain-specific characteristics,\nwithout introducing additional regularization. Experimental results on multiple\nchallenging deepfake detection datasets demonstrate that our gradient alignment\nstrategy outperforms state-of-the-art domain generalization techniques,\nconfirming the efficacy of our method. The code is available at\nhttps://github.com/Lynn0925/RoGA.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20500", "pdf": "https://arxiv.org/pdf/2505.20500", "abs": "https://arxiv.org/abs/2505.20500", "authors": ["Naba Rizvi", "Harper Strickland", "Saleha Ahmedi", "Aekta Kallepalli", "Isha Khirwadkar", "William Wu", "Imani N. S. Munyaka", "Nedjma Ousidhoum"], "title": "Beyond Keywords: Evaluating Large Language Model Classification of Nuanced Ableism", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Large language models (LLMs) are increasingly used in decision-making tasks\nlike r\\'esum\\'e screening and content moderation, giving them the power to\namplify or suppress certain perspectives. While previous research has\nidentified disability-related biases in LLMs, little is known about how they\nconceptualize ableism or detect it in text. We evaluate the ability of four\nLLMs to identify nuanced ableism directed at autistic individuals. We examine\nthe gap between their understanding of relevant terminology and their\neffectiveness in recognizing ableist content in context. Our results reveal\nthat LLMs can identify autism-related language but often miss harmful or\noffensive connotations. Further, we conduct a qualitative comparison of human\nand LLM explanations. We find that LLMs tend to rely on surface-level keyword\nmatching, leading to context misinterpretations, in contrast to human\nannotators who consider context, speaker identity, and potential impact. On the\nother hand, both LLMs and humans agree on the annotation scheme, suggesting\nthat a binary classification is adequate for evaluating LLM performance, which\nis consistent with findings from prior studies involving human annotators.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20710", "pdf": "https://arxiv.org/pdf/2505.20710", "abs": "https://arxiv.org/abs/2505.20710", "authors": ["Kui Wu", "Hao Chen", "Churan Wang", "Fakhri Karray", "Zhoujun Li", "Yizhou Wang", "Fangwei Zhong"], "title": "Hierarchical Instruction-aware Embodied Visual Tracking", "categories": ["cs.CV"], "comment": null, "summary": "User-Centric Embodied Visual Tracking (UC-EVT) presents a novel challenge for\nreinforcement learning-based models due to the substantial gap between\nhigh-level user instructions and low-level agent actions. While recent\nadvancements in language models (e.g., LLMs, VLMs, VLAs) have improved\ninstruction comprehension, these models face critical limitations in either\ninference speed (LLMs, VLMs) or generalizability (VLAs) for UC-EVT tasks. To\naddress these challenges, we propose \\textbf{Hierarchical Instruction-aware\nEmbodied Visual Tracking (HIEVT)} agent, which bridges instruction\ncomprehension and action generation using \\textit{spatial goals} as\nintermediaries. HIEVT first introduces \\textit{LLM-based Semantic-Spatial Goal\nAligner} to translate diverse human instructions into spatial goals that\ndirectly annotate the desired spatial position. Then the \\textit{RL-based\nAdaptive Goal-Aligned Policy}, a general offline policy, enables the tracker to\nposition the target as specified by the spatial goal. To benchmark UC-EVT\ntasks, we collect over ten million trajectories for training and evaluate\nacross one seen environment and nine unseen challenging environments. Extensive\nexperiments and real-world deployments demonstrate the robustness and\ngeneralizability of HIEVT across diverse environments, varying target dynamics,\nand complex instruction combinations. The complete project is available at\nhttps://sites.google.com/view/hievt.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20715", "pdf": "https://arxiv.org/pdf/2505.20715", "abs": "https://arxiv.org/abs/2505.20715", "authors": ["Fuwen Luo", "Shengfeng Lou", "Chi Chen", "Ziyue Wang", "Chenliang Li", "Weizhou Shen", "Jiyue Guo", "Peng Li", "Ming Yan", "Ji Zhang", "Fei Huang", "Yang Liu"], "title": "MUSEG: Reinforcing Video Temporal Understanding via Timestamp-Aware Multi-Segment Grounding", "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Video temporal understanding is crucial for multimodal large language models\n(MLLMs) to reason over events in videos. Despite recent advances in general\nvideo understanding, current MLLMs still struggle with fine-grained temporal\nreasoning. While reinforcement learning (RL) has been explored to address this\nissue recently, existing RL approaches remain limited in effectiveness. In this\nwork, we propose MUSEG, a novel RL-based method that enhances temporal\nunderstanding by introducing timestamp-aware multi-segment grounding. MUSEG\nenables MLLMs to align queries with multiple relevant video segments, promoting\nmore comprehensive temporal reasoning. To facilitate effective learning, we\ndesign a customized RL training recipe with phased rewards that progressively\nguides the model toward temporally grounded reasoning. Extensive experiments on\ntemporal grounding and time-sensitive video QA tasks demonstrate that MUSEG\nsignificantly outperforms existing methods and generalizes well across diverse\ntemporal understanding scenarios. View our project at\nhttps://github.com/THUNLP-MT/MUSEG.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20645", "pdf": "https://arxiv.org/pdf/2505.20645", "abs": "https://arxiv.org/abs/2505.20645", "authors": ["Kai Chen", "Zihao He", "Taiwei Shi", "Kristina Lerman"], "title": "STEER-BENCH: A Benchmark for Evaluating the Steerability of Large Language Models", "categories": ["cs.CL"], "comment": null, "summary": "Steerability, or the ability of large language models (LLMs) to adapt outputs\nto align with diverse community-specific norms, perspectives, and communication\nstyles, is critical for real-world applications but remains under-evaluated. We\nintroduce Steer-Bench, a benchmark for assessing population-specific steering\nusing contrasting Reddit communities. Covering 30 contrasting subreddit pairs\nacross 19 domains, Steer-Bench includes over 10,000 instruction-response pairs\nand validated 5,500 multiple-choice question with corresponding silver labels\nto test alignment with diverse community norms. Our evaluation of 13 popular\nLLMs using Steer-Bench reveals that while human experts achieve an accuracy of\n81% with silver labels, the best-performing models reach only around 65%\naccuracy depending on the domain and configuration. Some models lag behind\nhuman-level alignment by over 15 percentage points, highlighting significant\ngaps in community-sensitive steerability. Steer-Bench is a benchmark to\nsystematically assess how effectively LLMs understand community-specific\ninstructions, their resilience to adversarial steering attempts, and their\nability to accurately represent diverse cultural and ideological perspectives.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20777", "pdf": "https://arxiv.org/pdf/2505.20777", "abs": "https://arxiv.org/abs/2505.20777", "authors": ["Zhehan Kan", "Yanlin Liu", "Kun Yin", "Xinghua Jiang", "Xin Li", "Haoyu Cao", "Yinsong Liu", "Deqiang Jiang", "Xing Sun", "Qingmin Liao", "Wenming Yang"], "title": "TACO: Think-Answer Consistency for Optimized Long-Chain Reasoning and Efficient Data Learning via Reinforcement Learning in LVLMs", "categories": ["cs.CV"], "comment": null, "summary": "DeepSeek R1 has significantly advanced complex reasoning for large language\nmodels (LLMs). While recent methods have attempted to replicate R1's reasoning\ncapabilities in multimodal settings, they face limitations, including\ninconsistencies between reasoning and final answers, model instability and\ncrashes during long-chain exploration, and low data learning efficiency. To\naddress these challenges, we propose TACO, a novel reinforcement learning\nalgorithm for visual reasoning. Building on Generalized Reinforcement Policy\nOptimization (GRPO), TACO introduces Think-Answer Consistency, which tightly\ncouples reasoning with answer consistency to ensure answers are grounded in\nthoughtful reasoning. We also introduce the Rollback Resample Strategy, which\nadaptively removes problematic samples and reintroduces them to the sampler,\nenabling stable long-chain exploration and future learning opportunities.\nAdditionally, TACO employs an adaptive learning schedule that focuses on\nmoderate difficulty samples to optimize data efficiency. Furthermore, we\npropose the Test-Time-Resolution-Scaling scheme to address performance\ndegradation due to varying resolutions during reasoning while balancing\ncomputational overhead. Extensive experiments on in-distribution and\nout-of-distribution benchmarks for REC and VQA tasks show that fine-tuning\nLVLMs leads to significant performance improvements.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20650", "pdf": "https://arxiv.org/pdf/2505.20650", "abs": "https://arxiv.org/abs/2505.20650", "authors": ["Yan Wang", "Yang Ren", "Lingfei Qian", "Xueqing Peng", "Keyi Wang", "Yi Han", "Dongji Feng", "Xiao-Yang Liu", "Jimin Huang", "Qianqian Xie"], "title": "FinTagging: An LLM-ready Benchmark for Extracting and Structuring Financial Information", "categories": ["cs.CL", "cs.AI", "cs.CE"], "comment": null, "summary": "We introduce FinTagging, the first full-scope, table-aware XBRL benchmark\ndesigned to evaluate the structured information extraction and semantic\nalignment capabilities of large language models (LLMs) in the context of\nXBRL-based financial reporting. Unlike prior benchmarks that oversimplify XBRL\ntagging as flat multi-class classification and focus solely on narrative text,\nFinTagging decomposes the XBRL tagging problem into two subtasks: FinNI for\nfinancial entity extraction and FinCL for taxonomy-driven concept alignment. It\nrequires models to jointly extract facts and align them with the full 10k+\nUS-GAAP taxonomy across both unstructured text and structured tables, enabling\nrealistic, fine-grained evaluation. We assess a diverse set of LLMs under\nzero-shot settings, systematically analyzing their performance on both subtasks\nand overall tagging accuracy. Our results reveal that, while LLMs demonstrate\nstrong generalization in information extraction, they struggle with\nfine-grained concept alignment, particularly in disambiguating closely related\ntaxonomy entries. These findings highlight the limitations of existing LLMs in\nfully automating XBRL tagging and underscore the need for improved semantic\nreasoning and schema-aware modeling to meet the demands of accurate financial\ndisclosure. Code is available at our GitHub repository and data is at our\nHugging Face repository.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20793", "pdf": "https://arxiv.org/pdf/2505.20793", "abs": "https://arxiv.org/abs/2505.20793", "authors": ["Juan A. Rodriguez", "Haotian Zhang", "Abhay Puri", "Aarash Feizi", "Rishav Pramanik", "Pascal Wichmann", "Arnab Mondal", "Mohammad Reza Samsami", "Rabiul Awal", "Perouz Taslakian", "Spandana Gella", "Sai Rajeswar", "David Vazquez", "Christopher Pal", "Marco Pedersoli"], "title": "Rendering-Aware Reinforcement Learning for Vector Graphics Generation", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "Scalable Vector Graphics (SVG) offer a powerful format for representing\nvisual designs as interpretable code. Recent advances in vision-language models\n(VLMs) have enabled high-quality SVG generation by framing the problem as a\ncode generation task and leveraging large-scale pretraining. VLMs are\nparticularly suitable for this task as they capture both global semantics and\nfine-grained visual patterns, while transferring knowledge across vision,\nnatural language, and code domains. However, existing VLM approaches often\nstruggle to produce faithful and efficient SVGs because they never observe the\nrendered images during training. Although differentiable rendering for\nautoregressive SVG code generation remains unavailable, rendered outputs can\nstill be compared to original inputs, enabling evaluative feedback suitable for\nreinforcement learning (RL). We introduce RLRF(Reinforcement Learning from\nRendering Feedback), an RL method that enhances SVG generation in\nautoregressive VLMs by leveraging feedback from rendered SVG outputs. Given an\ninput image, the model generates SVG roll-outs that are rendered and compared\nto the original image to compute a reward. This visual fidelity feedback guides\nthe model toward producing more accurate, efficient, and semantically coherent\nSVGs. RLRF significantly outperforms supervised fine-tuning, addressing common\nfailure modes and enabling precise, high-quality SVG generation with strong\nstructural understanding and generalization.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["code generation", "fine-grained"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20700", "pdf": "https://arxiv.org/pdf/2505.20700", "abs": "https://arxiv.org/abs/2505.20700", "authors": ["Yong Wu", "Weihang Pan", "Ke Li", "Chen Binhui", "Ping Li", "Binbin Lin"], "title": "Beyond Templates: Dynamic Adaptation of Reasoning Demonstrations via Feasibility-Aware Exploration", "categories": ["cs.CL"], "comment": null, "summary": "Large language models (LLMs) have shown remarkable reasoning capabilities,\nyet aligning such abilities to small language models (SLMs) remains a challenge\ndue to distributional mismatches and limited model capacity. Existing reasoning\ndatasets, typically designed for powerful LLMs, often lead to degraded\nperformance when directly applied to weaker models. In this work, we introduce\nDynamic Adaptation of Reasoning Trajectories (DART), a novel data adaptation\nframework that bridges the capability gap between expert reasoning trajectories\nand diverse SLMs. Instead of uniformly imitating expert steps, DART employs a\nselective imitation strategy guided by step-wise adaptability estimation via\nsolution simulation. When expert steps surpass the student's capacity --\nsignaled by an Imitation Gap -- the student autonomously explores alternative\nreasoning paths, constrained by outcome consistency. We validate DART across\nmultiple reasoning benchmarks and model scales, demonstrating that it\nsignificantly improves generalization and data efficiency over static\nfine-tuning. Our method enhances supervision quality by aligning training\nsignals with the student's reasoning capabilities, offering a scalable solution\nfor reasoning alignment in resource-constrained models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20809", "pdf": "https://arxiv.org/pdf/2505.20809", "abs": "https://arxiv.org/abs/2505.20809", "authors": ["Zhengxuan Wu", "Qinan Yu", "Aryaman Arora", "Christopher D. Manning", "Christopher Potts"], "title": "Improved Representation Steering for Language Models", "categories": ["cs.CL"], "comment": "46 pages, 23 figures, preprint", "summary": "Steering methods for language models (LMs) seek to provide fine-grained and\ninterpretable control over model generations by variously changing model\ninputs, weights, or representations to adjust behavior. Recent work has shown\nthat adjusting weights or representations is often less effective than steering\nby prompting, for instance when wanting to introduce or suppress a particular\nconcept. We demonstrate how to improve representation steering via our new\nReference-free Preference Steering (RePS), a bidirectional\npreference-optimization objective that jointly does concept steering and\nsuppression. We train three parameterizations of RePS and evaluate them on\nAxBench, a large-scale model steering benchmark. On Gemma models with sizes\nranging from 2B to 27B, RePS outperforms all existing steering methods trained\nwith a language modeling objective and substantially narrows the gap with\nprompting -- while promoting interpretability and minimizing parameter count.\nIn suppression, RePS matches the language-modeling objective on Gemma-2 and\noutperforms it on the larger Gemma-3 variants while remaining resilient to\nprompt-based jailbreaking attacks that defeat prompting. Overall, our results\nsuggest that RePS provides an interpretable and robust alternative to prompting\nfor both steering and suppression.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "fine-grained"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20920", "pdf": "https://arxiv.org/pdf/2505.20920", "abs": "https://arxiv.org/abs/2505.20920", "authors": ["Qihang Fang", "Chengcheng Tang", "Bugra Tekin", "Shugao Ma", "Yanchao Yang"], "title": "HuMoCon: Concept Discovery for Human Motion Understanding", "categories": ["cs.CV", "68T07", "I.2.10; I.2.7"], "comment": "18 pages, 10 figures", "summary": "We present HuMoCon, a novel motion-video understanding framework designed for\nadvanced human behavior analysis. The core of our method is a human motion\nconcept discovery framework that efficiently trains multi-modal encoders to\nextract semantically meaningful and generalizable features. HuMoCon addresses\nkey challenges in motion concept discovery for understanding and reasoning,\nincluding the lack of explicit multi-modality feature alignment and the loss of\nhigh-frequency information in masked autoencoding frameworks. Our approach\nintegrates a feature alignment strategy that leverages video for contextual\nunderstanding and motion for fine-grained interaction modeling, further with a\nvelocity reconstruction mechanism to enhance high-frequency feature expression\nand mitigate temporal over-smoothing. Comprehensive experiments on standard\nbenchmarks demonstrate that HuMoCon enables effective motion concept discovery\nand significantly outperforms state-of-the-art methods in training large models\nfor human motion understanding. We will open-source the associated code with\nour paper.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20826", "pdf": "https://arxiv.org/pdf/2505.20826", "abs": "https://arxiv.org/abs/2505.20826", "authors": ["Soichiro Murakami", "Peinan Zhang", "Hidetaka Kamigaito", "Hiroya Takamura", "Manabu Okumura"], "title": "AdParaphrase v2.0: Generating Attractive Ad Texts Using a Preference-Annotated Paraphrase Dataset", "categories": ["cs.CL"], "comment": "Accepted to ACL2025 Findings", "summary": "Identifying factors that make ad text attractive is essential for advertising\nsuccess. This study proposes AdParaphrase v2.0, a dataset for ad text\nparaphrasing, containing human preference data, to enable the analysis of the\nlinguistic factors and to support the development of methods for generating\nattractive ad texts. Compared with v1.0, this dataset is 20 times larger,\ncomprising 16,460 ad text paraphrase pairs, each annotated with preference data\nfrom ten evaluators, thereby enabling a more comprehensive and reliable\nanalysis. Through the experiments, we identified multiple linguistic features\nof engaging ad texts that were not observed in v1.0 and explored various\nmethods for generating attractive ad texts. Furthermore, our analysis\ndemonstrated the relationships between human preference and ad performance, and\nhighlighted the potential of reference-free metrics based on large language\nmodels for evaluating ad text attractiveness. The dataset is publicly available\nat: https://github.com/CyberAgentAILab/AdParaphrase-v2.0.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "human preference"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20841", "pdf": "https://arxiv.org/pdf/2505.20841", "abs": "https://arxiv.org/abs/2505.20841", "authors": ["Xinbo Wu", "Abhishek Umrawal", "Lav R. Varshney"], "title": "Concealment of Intent: A Game-Theoretic Analysis", "categories": ["cs.CL"], "comment": null, "summary": "As large language models (LLMs) grow more capable, concerns about their safe\ndeployment have also grown. Although alignment mechanisms have been introduced\nto deter misuse, they remain vulnerable to carefully designed adversarial\nprompts. In this work, we present a scalable attack strategy: intent-hiding\nadversarial prompting, which conceals malicious intent through the composition\nof skills. We develop a game-theoretic framework to model the interaction\nbetween such attacks and defense systems that apply both prompt and response\nfiltering. Our analysis identifies equilibrium points and reveals structural\nadvantages for the attacker. To counter these threats, we propose and analyze a\ndefense mechanism tailored to intent-hiding attacks. Empirically, we validate\nthe attack's effectiveness on multiple real-world LLMs across a range of\nmalicious behaviors, demonstrating clear advantages over existing adversarial\nprompting techniques.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20880", "pdf": "https://arxiv.org/pdf/2505.20880", "abs": "https://arxiv.org/abs/2505.20880", "authors": ["Baraa Hikal", "Ahmed Nasreldin", "Ali Hamdi"], "title": "MSA at SemEval-2025 Task 3: High Quality Weak Labeling and LLM Ensemble Verification for Multilingual Hallucination Detection", "categories": ["cs.CL"], "comment": null, "summary": "This paper describes our submission for SemEval-2025 Task 3: Mu-SHROOM, the\nMultilingual Shared-task on Hallucinations and Related Observable\nOvergeneration Mistakes. The task involves detecting hallucinated spans in text\ngenerated by instruction-tuned Large Language Models (LLMs) across multiple\nlanguages. Our approach combines task-specific prompt engineering with an LLM\nensemble verification mechanism, where a primary model extracts hallucination\nspans and three independent LLMs adjudicate their validity through\nprobability-based voting. This framework simulates the human annotation\nworkflow used in the shared task validation and test data. Additionally, fuzzy\nmatching refines span alignment. Our system ranked 1st in Arabic and Basque,\n2nd in German, Swedish, and Finnish, and 3rd in Czech, Farsi, and French.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20888", "pdf": "https://arxiv.org/pdf/2505.20888", "abs": "https://arxiv.org/abs/2505.20888", "authors": ["Chengyu Wang", "Junbing Yan", "Wenrui Cai", "Yuanhao Yue", "Jun Huang"], "title": "EasyDistill: A Comprehensive Toolkit for Effective Knowledge Distillation of Large Language Models", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "In this paper, we present EasyDistill, a comprehensive toolkit designed for\neffective black-box and white-box knowledge distillation (KD) of large language\nmodels (LLMs). Our framework offers versatile functionalities, including data\nsynthesis, supervised fine-tuning, ranking optimization, and reinforcement\nlearning techniques specifically tailored for KD scenarios. The toolkit\naccommodates KD functionalities for both System 1 (fast, intuitive) and System\n2 (slow, analytical) models. With its modular design and user-friendly\ninterface, EasyDistill empowers researchers and industry practitioners to\nseamlessly experiment with and implement state-of-the-art KD strategies for\nLLMs. In addition, EasyDistill provides a series of robust distilled models and\nKD-based industrial solutions developed by us, along with the corresponding\nopen-sourced datasets, catering to a variety of use cases. Furthermore, we\ndescribe the seamless integration of EasyDistill into Alibaba Cloud's Platform\nfor AI (PAI). Overall, the EasyDistill toolkit makes advanced KD techniques for\nLLMs more accessible and impactful within the NLP community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21010", "pdf": "https://arxiv.org/pdf/2505.21010", "abs": "https://arxiv.org/abs/2505.21010", "authors": ["Sabbir Ahmed", "Mamshad Nayeem Rizve", "Abdullah Al Arafat", "Jacqueline Liu", "Rahim Hossain", "Mohaiminul Al Nahian", "Adnan Siraj Rakin"], "title": "Unified Alignment Protocol: Making Sense of the Unlabeled Data in New Domains", "categories": ["cs.CV", "cs.LG"], "comment": null, "summary": "Semi-Supervised Federated Learning (SSFL) is gaining popularity over\nconventional Federated Learning in many real-world applications. Due to the\npractical limitation of limited labeled data on the client side, SSFL considers\nthat participating clients train with unlabeled data, and only the central\nserver has the necessary resources to access limited labeled data, making it an\nideal fit for real-world applications (e.g., healthcare). However, traditional\nSSFL assumes that the data distributions in the training phase and testing\nphase are the same. In practice, however, domain shifts frequently occur,\nmaking it essential for SSFL to incorporate generalization capabilities and\nenhance their practicality. The core challenge is improving model\ngeneralization to new, unseen domains while the client participate in SSFL.\nHowever, the decentralized setup of SSFL and unsupervised client training\nnecessitates innovation to achieve improved generalization across domains. To\nachieve this, we propose a novel framework called the Unified Alignment\nProtocol (UAP), which consists of an alternating two-stage training process.\nThe first stage involves training the server model to learn and align the\nfeatures with a parametric distribution, which is subsequently communicated to\nclients without additional communication overhead. The second stage proposes a\nnovel training algorithm that utilizes the server feature distribution to align\nclient features accordingly. Our extensive experiments on standard domain\ngeneralization benchmark datasets across multiple model architectures reveal\nthat proposed UAP successfully achieves SOTA generalization performance in SSFL\nsetting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20966", "pdf": "https://arxiv.org/pdf/2505.20966", "abs": "https://arxiv.org/abs/2505.20966", "authors": ["Zhibo Wang", "Xiaoze Jiang", "Zhiheng Qin", "Enyun Yu", "Han Li"], "title": "Personalized Query Auto-Completion for Long and Short-Term Interests with Adaptive Detoxification Generation", "categories": ["cs.CL", "cs.IR"], "comment": "KDD 2025", "summary": "Query auto-completion (QAC) plays a crucial role in modern search systems.\nHowever, in real-world applications, there are two pressing challenges that\nstill need to be addressed. First, there is a need for hierarchical\npersonalized representations for users. Previous approaches have typically used\nusers' search behavior as a single, overall representation, which proves\ninadequate in more nuanced generative scenarios. Additionally, query prefixes\nare typically short and may contain typos or sensitive information, increasing\nthe likelihood of generating toxic content compared to traditional text\ngeneration tasks. Such toxic content can degrade user experience and lead to\npublic relations issues. Therefore, the second critical challenge is\ndetoxifying QAC systems.\n  To address these two limitations, we propose a novel model (LaD) that\ncaptures personalized information from both long-term and short-term interests,\nincorporating adaptive detoxification. In LaD, personalized information is\ncaptured hierarchically at both coarse-grained and fine-grained levels. This\napproach preserves as much personalized information as possible while enabling\nonline generation within time constraints. To move a futher step, we propose an\nonline training method based on Reject Preference Optimization (RPO). By\nincorporating a special token [Reject] during both the training and inference\nprocesses, the model achieves adaptive detoxification. Consequently, the\ngenerated text presented to users is both non-toxic and relevant to the given\nprefix. We conduct comprehensive experiments on industrial-scale datasets and\nperform online A/B tests, delivering the largest single-experiment metric\nimprovement in nearly two years of our product. Our model has been deployed on\nKuaishou search, driving the primary traffic for hundreds of millions of active\nusers. The code is available at https://github.com/JXZe/LaD.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21062", "pdf": "https://arxiv.org/pdf/2505.21062", "abs": "https://arxiv.org/abs/2505.21062", "authors": ["Davide Lobba", "Fulvio Sanguigni", "Bin Ren", "Marcella Cornia", "Rita Cucchiara", "Nicu Sebe"], "title": "Inverse Virtual Try-On: Generating Multi-Category Product-Style Images from Clothed Individuals", "categories": ["cs.CV"], "comment": null, "summary": "While virtual try-on (VTON) systems aim to render a garment onto a target\nperson image, this paper tackles the novel task of virtual try-off (VTOFF),\nwhich addresses the inverse problem: generating standardized product images of\ngarments from real-world photos of clothed individuals. Unlike VTON, which must\nresolve diverse pose and style variations, VTOFF benefits from a consistent and\nwell-defined output format -- typically a flat, lay-down-style representation\nof the garment -- making it a promising tool for data generation and dataset\nenhancement. However, existing VTOFF approaches face two major limitations: (i)\ndifficulty in disentangling garment features from occlusions and complex poses,\noften leading to visual artifacts, and (ii) restricted applicability to\nsingle-category garments (e.g., upper-body clothes only), limiting\ngeneralization. To address these challenges, we present Text-Enhanced\nMUlti-category Virtual Try-Off (TEMU-VTOFF), a novel architecture featuring a\ndual DiT-based backbone with a modified multimodal attention mechanism for\nrobust garment feature extraction. Our architecture is designed to receive\ngarment information from multiple modalities like images, text, and masks to\nwork in a multi-category setting. Finally, we propose an additional alignment\nmodule to further refine the generated visual details. Experiments on VITON-HD\nand Dress Code datasets show that TEMU-VTOFF sets a new state-of-the-art on the\nVTOFF task, significantly improving both visual quality and fidelity to the\ntarget garments.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20977", "pdf": "https://arxiv.org/pdf/2505.20977", "abs": "https://arxiv.org/abs/2505.20977", "authors": ["Yu Zhang", "Jinlong Ma", "Yongshuai Hou", "Xuefeng Bai", "Kehai Chen", "Yang Xiang", "Jun Yu", "Min Zhang"], "title": "Evaluating and Steering Modality Preferences in Multimodal Large Language Model", "categories": ["cs.CL"], "comment": "Modality Preference", "summary": "Multimodal large language models (MLLMs) have achieved remarkable performance\non complex tasks with multimodal context. However, it is still understudied\nwhether they exhibit modality preference when processing multimodal contexts.\nTo study this question, we first build a \\textbf{MC\\textsuperscript{2}}\nbenchmark under controlled evidence conflict scenarios to systematically\nevaluate modality preference, which is the tendency to favor one modality over\nanother when making decisions based on multimodal conflicting evidence. Our\nextensive evaluation reveals that all 18 tested MLLMs generally demonstrate\nclear modality bias, and modality preference can be influenced by external\ninterventions. An in-depth analysis reveals that the preference direction can\nbe captured within the latent representations of MLLMs. Built on this, we\npropose a probing and steering method based on representation engineering to\nexplicitly control modality preference without additional fine-tuning or\ncarefully crafted prompts. Our method effectively amplifies modality preference\ntoward a desired direction and applies to downstream tasks such as\nhallucination mitigation and multimodal machine translation, yielding promising\nimprovements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21043", "pdf": "https://arxiv.org/pdf/2505.21043", "abs": "https://arxiv.org/abs/2505.21043", "authors": ["Sam O'Connor Russell", "Naomi Harte"], "title": "Visual Cues Enhance Predictive Turn-Taking for Two-Party Human Interaction", "categories": ["cs.CL", "cs.RO"], "comment": null, "summary": "Turn-taking is richly multimodal. Predictive turn-taking models (PTTMs)\nfacilitate naturalistic human-robot interaction, yet most rely solely on\nspeech. We introduce MM-VAP, a multimodal PTTM which combines speech with\nvisual cues including facial expression, head pose and gaze. We find that it\noutperforms the state-of-the-art audio-only in videoconferencing interactions\n(84% vs. 79% hold/shift prediction accuracy). Unlike prior work which\naggregates all holds and shifts, we group by duration of silence between turns.\nThis reveals that through the inclusion of visual features, MM-VAP outperforms\na state-of-the-art audio-only turn-taking model across all durations of speaker\ntransitions. We conduct a detailed ablation study, which reveals that facial\nexpression features contribute the most to model performance. Thus, our working\nhypothesis is that when interlocutors can see one another, visual cues are\nvital for turn-taking and must therefore be included for accurate turn-taking\nprediction. We additionally validate the suitability of automatic speech\nalignment for PTTM training using telephone speech. This work represents the\nfirst comprehensive analysis of multimodal PTTMs. We discuss implications for\nfuture work and make all code publicly available.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21097", "pdf": "https://arxiv.org/pdf/2505.21097", "abs": "https://arxiv.org/abs/2505.21097", "authors": ["Stephen Chung", "Wenyu Du", "Jie Fu"], "title": "Thinker: Learning to Think Fast and Slow", "categories": ["cs.CL", "cs.AI", "cs.LG", "I.2.6; I.2.8; I.5.1"], "comment": "21 pages", "summary": "Recent studies show that the reasoning capabilities of Large Language Models\n(LLMs) can be improved by applying Reinforcement Learning (RL) to\nquestion-answering (QA) tasks in areas such as math and coding. With a long\ncontext length, LLMs may learn to perform search, as indicated by the\nself-correction behavior observed in DeepSeek R1. However, this search behavior\nis often imprecise and lacks confidence, resulting in long, redundant responses\nand highlighting deficiencies in intuition and verification. Inspired by the\nDual Process Theory in psychology, we introduce a simple modification to the QA\ntask that includes four stages: Fast Thinking, where the LLM must answer within\na strict token budget; Verification, where the model evaluates its initial\nresponse; Slow Thinking, where it refines the initial response with more\ndeliberation; and Summarization, where it distills the refinement from the\nprevious stage into precise steps. Our proposed task improves average accuracy\nfrom 24.9% to 27.9% for Qwen2.5-1.5B, and from 45.9% to 49.8% for\nDeepSeek-R1-Qwen-1.5B. Notably, for Qwen2.5-1.5B, the Fast Thinking mode alone\nachieves 26.8% accuracy using fewer than 1000 tokens, demonstrating substantial\ninference efficiency gains. These findings suggest that intuition and\ndeliberative reasoning are distinct, complementary systems benefiting from\ntargeted training.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["self-correction"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "summarization"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21138", "pdf": "https://arxiv.org/pdf/2505.21138", "abs": "https://arxiv.org/abs/2505.21138", "authors": ["Tianyi Xu", "Hongjie Chen", "Wang Qing", "Lv Hang", "Jian Kang", "Li Jie", "Zhennan Lin", "Yongxiang Li", "Xie Lei"], "title": "Leveraging LLM and Self-Supervised Training Models for Speech Recognition in Chinese Dialects: A Comparative Analysis", "categories": ["cs.CL", "cs.SD", "eess.AS"], "comment": null, "summary": "Large-scale training corpora have significantly improved the performance of\nASR models. Unfortunately, due to the relative scarcity of data, Chinese\naccents and dialects remain a challenge for most ASR models. Recent\nadvancements in self-supervised learning have shown that self-supervised pre-\ntraining, combined with large language models (LLM), can effectively enhance\nASR performance in low-resource scenarios. We aim to investigate the\neffectiveness of this paradigm for Chinese dialects. Specifically, we pre-train\na Data2vec2 model on 300,000 hours of unlabeled dialect and accented speech\ndata and do alignment training on a supervised dataset of 40,000 hours. Then,\nwe systematically examine the impact of various projectors and LLMs on\nMandarin, dialect, and accented speech recognition performance under this\nparadigm. Our method achieved SOTA results on multiple dialect datasets,\nincluding Kespeech. We will open-source our work to promote reproducible\nresearch", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21258", "pdf": "https://arxiv.org/pdf/2505.21258", "abs": "https://arxiv.org/abs/2505.21258", "authors": ["Changguanng Wu", "Jiangxin Dong", "Chengjian Li", "Jinhui Tang"], "title": "Plenodium: UnderWater 3D Scene Reconstruction with Plenoptic Medium Representation", "categories": ["cs.CV"], "comment": null, "summary": "We present Plenodium (plenoptic medium), an effective and efficient 3D\nrepresentation framework capable of jointly modeling both objects and\nparticipating media. In contrast to existing medium representations that rely\nsolely on view-dependent modeling, our novel plenoptic medium representation\nincorporates both directional and positional information through spherical\nharmonics encoding, enabling highly accurate underwater scene reconstruction.\nTo address the initialization challenge in degraded underwater environments, we\npropose the pseudo-depth Gaussian complementation to augment COLMAP-derived\npoint clouds with robust depth priors. In addition, a depth ranking regularized\nloss is developed to optimize the geometry of the scene and improve the ordinal\nconsistency of the depth maps. Extensive experiments on real-world underwater\ndatasets demonstrate that our method achieves significant improvements in 3D\nreconstruction. Furthermore, we conduct a simulated dataset with ground truth\nand the controllable scattering medium to demonstrate the restoration\ncapability of our method in underwater scenarios. Our code and dataset are\navailable at https://plenodium.github.io/.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21191", "pdf": "https://arxiv.org/pdf/2505.21191", "abs": "https://arxiv.org/abs/2505.21191", "authors": ["Junyan Zhang", "Yubo Gao", "Yibo Yan", "Jungang Li", "Zhaorui Hou", "Sicheng Tao", "Shuliang Liu", "Song Dai", "Yonghua Hei", "Junzhuo Li", "Xuming Hu"], "title": "Unveiling Instruction-Specific Neurons & Experts: An Analytical Framework for LLM's Instruction-Following Capabilities", "categories": ["cs.CL", "cs.LG"], "comment": null, "summary": "The finetuning of Large Language Models (LLMs) has significantly advanced\ntheir instruction-following capabilities, yet the underlying computational\nmechanisms driving these improvements remain poorly understood. This study\nsystematically examines how fine-tuning reconfigures LLM computations by\nisolating and analyzing instruction-specific sparse components, i.e., neurons\nin dense models and both neurons and experts in Mixture-of-Experts (MoE)\narchitectures. In particular, we introduce HexaInst, a carefully curated and\nbalanced instructional dataset spanning six distinct categories, and propose\nSPARCOM, a novel analytical framework comprising three key contributions: (1) a\nmethod for identifying these sparse components, (2) an evaluation of their\nfunctional generality and uniqueness, and (3) a systematic comparison of their\nalterations. Through experiments, we demonstrate functional generality,\nuniqueness, and the critical role of these components in instruction execution.\nBy elucidating the relationship between fine-tuning-induced adaptations and\nsparse computational substrates, this work provides deeper insights into how\nLLMs internalize instruction-following behavior for the trustworthy LLM\ncommunity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21338", "pdf": "https://arxiv.org/pdf/2505.21338", "abs": "https://arxiv.org/abs/2505.21338", "authors": ["Katarzyna Filus", "Mateusz arski"], "title": "Beyond Accuracy: Uncovering the Role of Similarity Perception and its Alignment with Semantics in Supervised Learning", "categories": ["cs.CV"], "comment": null, "summary": "Similarity manifests in various forms, including semantic similarity that is\nparticularly important, serving as an approximation of human object\ncategorization based on e.g. shared functionalities and evolutionary traits. It\nalso offers practical advantages in computational modeling via lexical\nstructures such as WordNet with constant and interpretable similarity. As in\nthe domain of deep vision, there is still not enough focus on the phenomena\nregarding the similarity perception emergence. We introduce Deep Similarity\nInspector (DSI) -- a systematic framework to inspect how deep vision networks\ndevelop their similarity perception and its alignment with semantic similarity.\nOur experiments show that both Convolutional Neural Networks' (CNNs) and Vision\nTransformers' (ViTs) develop a rich similarity perception during training with\n3 phases (initial similarity surge, refinement, stabilization), with clear\ndifferences between CNNs and ViTs. Besides the gradual mistakes elimination,\nthe mistakes refinement phenomenon can be observed.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21301", "pdf": "https://arxiv.org/pdf/2505.21301", "abs": "https://arxiv.org/abs/2505.21301", "authors": ["Andrea Pedrotti", "Giulia Rambelli", "Caterina Villani", "Marianna Bolognesi"], "title": "How Humans and LLMs Organize Conceptual Knowledge: Exploring Subordinate Categories in Italian", "categories": ["cs.CL", "cs.AI"], "comment": "Accepted at ACL 2025", "summary": "People can categorize the same entity at multiple taxonomic levels, such as\nbasic (bear), superordinate (animal), and subordinate (grizzly bear). While\nprior research has focused on basic-level categories, this study is the first\nattempt to examine the organization of categories by analyzing exemplars\nproduced at the subordinate level. We present a new Italian psycholinguistic\ndataset of human-generated exemplars for 187 concrete words. We then use these\ndata to evaluate whether textual and vision LLMs produce meaningful exemplars\nthat align with human category organization across three key tasks: exemplar\ngeneration, category induction, and typicality judgment. Our findings show a\nlow alignment between humans and LLMs, consistent with previous studies.\nHowever, their performance varies notably across different semantic domains.\nUltimately, this study highlights both the promises and the constraints of\nusing AI-generated exemplars to support psychological and linguistic research.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21362", "pdf": "https://arxiv.org/pdf/2505.21362", "abs": "https://arxiv.org/abs/2505.21362", "authors": ["Qishuai Zhong", "Zongmin Li", "Siqi Fan", "Aixin Sun"], "title": "Evaluating LLM Adaptation to Sociodemographic Factors: User Profile vs. Dialogue History", "categories": ["cs.CL", "cs.AI", "cs.HC"], "comment": null, "summary": "Effective engagement by large language models (LLMs) requires adapting\nresponses to users' sociodemographic characteristics, such as age, occupation,\nand education level. While many real-world applications leverage dialogue\nhistory for contextualization, existing evaluations of LLMs' behavioral\nadaptation often focus on single-turn prompts. In this paper, we propose a\nframework to evaluate LLM adaptation when attributes are introduced either (1)\nexplicitly via user profiles in the prompt or (2) implicitly through multi-turn\ndialogue history. We assess the consistency of model behavior across these\nmodalities. Using a multi-agent pipeline, we construct a synthetic dataset\npairing dialogue histories with distinct user profiles and employ questions\nfrom the Value Survey Module (VSM 2013) (Hofstede and Hofstede, 2016) to probe\nvalue expression. Our findings indicate that most models adjust their expressed\nvalues in response to demographic changes, particularly in age and education\nlevel, but consistency varies. Models with stronger reasoning capabilities\ndemonstrate greater alignment, indicating the importance of reasoning in robust\nsociodemographic adaptation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "dialogue"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21457", "pdf": "https://arxiv.org/pdf/2505.21457", "abs": "https://arxiv.org/abs/2505.21457", "authors": ["Muzhi Zhu", "Hao Zhong", "Canyu Zhao", "Zongze Du", "Zheng Huang", "Mingyu Liu", "Hao Chen", "Cheng Zou", "Jingdong Chen", "Ming Yang", "Chunhua Shen"], "title": "Active-O3: Empowering Multimodal Large Language Models with Active Perception via GRPO", "categories": ["cs.CV", "cs.AI"], "comment": "Project Page: https://aim-uofa.github.io/ACTIVE-o3", "summary": "Active vision, also known as active perception, refers to the process of\nactively selecting where and how to look in order to gather task-relevant\ninformation. It is a critical component of efficient perception and\ndecision-making in humans and advanced embodied agents. Recently, the use of\nMultimodal Large Language Models (MLLMs) as central planning and\ndecision-making modules in robotic systems has gained extensive attention.\nHowever, despite the importance of active perception in embodied intelligence,\nthere is little to no exploration of how MLLMs can be equipped with or learn\nactive perception capabilities. In this paper, we first provide a systematic\ndefinition of MLLM-based active perception tasks. We point out that the\nrecently proposed GPT-o3 model's zoom-in search strategy can be regarded as a\nspecial case of active perception; however, it still suffers from low search\nefficiency and inaccurate region selection. To address these issues, we propose\nACTIVE-O3, a purely reinforcement learning based training framework built on\ntop of GRPO, designed to equip MLLMs with active perception capabilities. We\nfurther establish a comprehensive benchmark suite to evaluate ACTIVE-O3 across\nboth general open-world tasks, such as small-object and dense object grounding,\nand domain-specific scenarios, including small object detection in remote\nsensing and autonomous driving, as well as fine-grained interactive\nsegmentation. In addition, ACTIVE-O3 also demonstrates strong zero-shot\nreasoning abilities on the V* Benchmark, without relying on any explicit\nreasoning data. We hope that our work can provide a simple codebase and\nevaluation protocol to facilitate future research on active perception in\nMLLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "fine-grained"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21472", "pdf": "https://arxiv.org/pdf/2505.21472", "abs": "https://arxiv.org/abs/2505.21472", "authors": ["Mehrdad Fazli", "Bowen Wei", "Ziwei Zhu"], "title": "Mitigating Hallucination in Large Vision-Language Models via Adaptive Attention Calibration", "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Large vision-language models (LVLMs) achieve impressive performance on\nmultimodal tasks but often suffer from hallucination, and confidently describe\nobjects or attributes not present in the image. Current inference-time\ninterventions, while training-free, struggle to maintain accuracy in open-ended\nand long-form generation scenarios. We introduce the Confidence-Aware Attention\nCalibration (CAAC) framework to address this challenge by targeting two key\nbiases: spatial perception bias, which distributes attention disproportionately\nacross image tokens, and modality bias, which shifts focus from visual to\ntextual inputs over time. CAAC employs a two-step approach: Visual-Token\nCalibration (VTC) to balance attention across visual tokens, and Adaptive\nAttention Re-Scaling (AAR) to reinforce visual grounding based on the model's\nconfidence. This confidence-driven adjustment ensures consistent visual\nalignment during generation. Experiments on CHAIR, AMBER, and POPE benchmarks\ndemonstrate that CAAC outperforms baselines, particularly in long-form\ngenerations, effectively reducing hallucination.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21389", "pdf": "https://arxiv.org/pdf/2505.21389", "abs": "https://arxiv.org/abs/2505.21389", "authors": ["Xuanwen Ding", "Chengjun Pan", "Zejun Li", "Jiwen Zhang", "Siyuan Wang", "Zhongyu Wei"], "title": "AutoJudger: An Agent-Driven Framework for Efficient Benchmarking of MLLMs", "categories": ["cs.CL"], "comment": null, "summary": "Evaluating multimodal large language models (MLLMs) is increasingly\nexpensive, as the growing size and cross-modality complexity of benchmarks\ndemand significant scoring efforts. To tackle with this difficulty, we\nintroduce AutoJudger, an agent-driven framework for efficient and adaptive\nbenchmarking of MLLMs that tackles this escalating cost. AutoJudger employs the\nItem Response Theory (IRT) to estimate the question difficulty and an\nautonomous evaluation agent to dynamically select the most informative test\nquestions based on the model's real-time performance. Specifically, AutoJudger\nincorporates two pivotal components: a semantic-aware retrieval mechanism to\nensure that selected questions cover diverse and challenging scenarios across\nboth vision and language modalities, and a dynamic memory that maintains\ncontextual statistics of previously evaluated questions to guide coherent and\nglobally informed question selection throughout the evaluation process.\nExtensive experiments on four representative multimodal benchmarks demonstrate\nthat our adaptive framework dramatically reduces evaluation expenses, i.e.\nAutoJudger uses only 4% of the data to achieve over 90% ranking accuracy with\nthe full benchmark evaluation on MMT-Bench.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21478", "pdf": "https://arxiv.org/pdf/2505.21478", "abs": "https://arxiv.org/abs/2505.21478", "authors": ["Uri Gadot", "Rinon Gal", "Yftah Ziser", "Gal Chechik", "Shie Mannor"], "title": "Policy Optimized Text-to-Image Pipeline Design", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "Text-to-image generation has evolved beyond single monolithic models to\ncomplex multi-component pipelines. These combine fine-tuned generators,\nadapters, upscaling blocks and even editing steps, leading to significant\nimprovements in image quality. However, their effective design requires\nsubstantial expertise. Recent approaches have shown promise in automating this\nprocess through large language models (LLMs), but they suffer from two critical\nlimitations: extensive computational requirements from generating images with\nhundreds of predefined pipelines, and poor generalization beyond memorized\ntraining examples. We introduce a novel reinforcement learning-based framework\nthat addresses these inefficiencies. Our approach first trains an ensemble of\nreward models capable of predicting image quality scores directly from\nprompt-workflow combinations, eliminating the need for costly image generation\nduring training. We then implement a two-phase training strategy: initial\nworkflow vocabulary training followed by GRPO-based optimization that guides\nthe model toward higher-performing regions of the workflow space. Additionally,\nwe incorporate a classifier-free guidance based enhancement technique that\nextrapolates along the path between the initial and GRPO-tuned models, further\nimproving output quality. We validate our approach through a set of\ncomparisons, showing that it can successfully create new flows with greater\ndiversity and lead to superior image quality compared to existing baselines.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21397", "pdf": "https://arxiv.org/pdf/2505.21397", "abs": "https://arxiv.org/abs/2505.21397", "authors": ["Xiusi Chen", "Shanyong Wang", "Cheng Qian", "Hongru Wang", "Peixuan Han", "Heng Ji"], "title": "DecisionFlow: Advancing Large Language Model as Principled Decision Maker", "categories": ["cs.CL"], "comment": "24 pages, 13 figures", "summary": "In high-stakes domains such as healthcare and finance, effective\ndecision-making demands not just accurate outcomes but transparent and\nexplainable reasoning. However, current language models often lack the\nstructured deliberation needed for such tasks, instead generating decisions and\njustifications in a disconnected, post-hoc manner. To address this, we propose\nDecisionFlow, a novel decision modeling framework that guides models to reason\nover structured representations of actions, attributes, and constraints. Rather\nthan predicting answers directly from prompts, DecisionFlow builds a\nsemantically grounded decision space and infers a latent utility function to\nevaluate trade-offs in a transparent, utility-driven manner. This process\nproduces decisions tightly coupled with interpretable rationales reflecting the\nmodel's reasoning. Empirical results on two high-stakes benchmarks show that\nDecisionFlow not only achieves up to 30% accuracy gains over strong prompting\nbaselines but also enhances alignment in outcomes. Our work is a critical step\ntoward integrating symbolic reasoning with LLMs, enabling more accountable,\nexplainable, and reliable LLM decision support systems. We release the data and\ncode at https://github.com/xiusic/DecisionFlow.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21488", "pdf": "https://arxiv.org/pdf/2505.21488", "abs": "https://arxiv.org/abs/2505.21488", "authors": ["Omer Dahary", "Yehonathan Cohen", "Or Patashnik", "Kfir Aberman", "Daniel Cohen-Or"], "title": "Be Decisive: Noise-Induced Layouts for Multi-Subject Generation", "categories": ["cs.CV", "cs.AI", "cs.GR", "cs.LG"], "comment": "SIGGRAPH 2025. Project page: https://omer11a.github.io/be-decisive/", "summary": "Generating multiple distinct subjects remains a challenge for existing\ntext-to-image diffusion models. Complex prompts often lead to subject leakage,\ncausing inaccuracies in quantities, attributes, and visual features. Preventing\nleakage among subjects necessitates knowledge of each subject's spatial\nlocation. Recent methods provide these spatial locations via an external layout\ncontrol. However, enforcing such a prescribed layout often conflicts with the\ninnate layout dictated by the sampled initial noise, leading to misalignment\nwith the model's prior. In this work, we introduce a new approach that predicts\na spatial layout aligned with the prompt, derived from the initial noise, and\nrefines it throughout the denoising process. By relying on this noise-induced\nlayout, we avoid conflicts with externally imposed layouts and better preserve\nthe model's prior. Our method employs a small neural network to predict and\nrefine the evolving noise-induced layout at each denoising step, ensuring clear\nboundaries between subjects while maintaining consistency. Experimental results\nshow that this noise-aligned strategy achieves improved text-image alignment\nand more stable multi-subject generation compared to existing layout-guided\ntechniques, while preserving the rich diversity of the model's original\ndistribution.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21494", "pdf": "https://arxiv.org/pdf/2505.21494", "abs": "https://arxiv.org/abs/2505.21494", "authors": ["Xiaojun Jia", "Sensen Gao", "Simeng Qin", "Tianyu Pang", "Chao Du", "Yihao Huang", "Xinfeng Li", "Yiming Li", "Bo Li", "Yang Liu"], "title": "Adversarial Attacks against Closed-Source MLLMs via Feature Optimal Alignment", "categories": ["cs.CV"], "comment": null, "summary": "Multimodal large language models (MLLMs) remain vulnerable to transferable\nadversarial examples. While existing methods typically achieve targeted attacks\nby aligning global features-such as CLIP's [CLS] token-between adversarial and\ntarget samples, they often overlook the rich local information encoded in patch\ntokens. This leads to suboptimal alignment and limited transferability,\nparticularly for closed-source models. To address this limitation, we propose a\ntargeted transferable adversarial attack method based on feature optimal\nalignment, called FOA-Attack, to improve adversarial transfer capability.\nSpecifically, at the global level, we introduce a global feature loss based on\ncosine similarity to align the coarse-grained features of adversarial samples\nwith those of target samples. At the local level, given the rich local\nrepresentations within Transformers, we leverage clustering techniques to\nextract compact local patterns to alleviate redundant local features. We then\nformulate local feature alignment between adversarial and target samples as an\noptimal transport (OT) problem and propose a local clustering optimal transport\nloss to refine fine-grained feature alignment. Additionally, we propose a\ndynamic ensemble model weighting strategy to adaptively balance the influence\nof multiple models during adversarial example generation, thereby further\nimproving transferability. Extensive experiments across various models\ndemonstrate the superiority of the proposed method, outperforming\nstate-of-the-art methods, especially in transferring to closed-source MLLMs.\nThe code is released at https://github.com/jiaxiaojunQAQ/FOA-Attack.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21497", "pdf": "https://arxiv.org/pdf/2505.21497", "abs": "https://arxiv.org/abs/2505.21497", "authors": ["Wei Pang", "Kevin Qinghong Lin", "Xiangru Jian", "Xi He", "Philip Torr"], "title": "Paper2Poster: Towards Multimodal Poster Automation from Scientific Papers", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.MA"], "comment": "Project Page: https://github.com/Paper2Poster/Paper2Poster", "summary": "Academic poster generation is a crucial yet challenging task in scientific\ncommunication, requiring the compression of long-context interleaved documents\ninto a single, visually coherent page. To address this challenge, we introduce\nthe first benchmark and metric suite for poster generation, which pairs recent\nconference papers with author-designed posters and evaluates outputs on\n(i)Visual Quality-semantic alignment with human posters, (ii)Textual\nCoherence-language fluency, (iii)Holistic Assessment-six fine-grained aesthetic\nand informational criteria scored by a VLM-as-judge, and notably\n(iv)PaperQuiz-the poster's ability to convey core paper content as measured by\nVLMs answering generated quizzes. Building on this benchmark, we propose\nPosterAgent, a top-down, visual-in-the-loop multi-agent pipeline: the (a)Parser\ndistills the paper into a structured asset library; the (b)Planner aligns\ntext-visual pairs into a binary-tree layout that preserves reading order and\nspatial balance; and the (c)Painter-Commenter loop refines each panel by\nexecuting rendering code and using VLM feedback to eliminate overflow and\nensure alignment. In our comprehensive evaluation, we find that GPT-4o\noutputs-though visually appealing at first glance-often exhibit noisy text and\npoor PaperQuiz scores, and we find that reader engagement is the primary\naesthetic bottleneck, as human-designed posters rely largely on visual\nsemantics to convey meaning. Our fully open-source variants (e.g. based on the\nQwen-2.5 series) outperform existing 4o-driven multi-agent systems across\nnearly all metrics, while using 87% fewer tokens. It transforms a 22-page paper\ninto a finalized yet editable .pptx poster - all for just $0.005. These\nfindings chart clear directions for the next generation of fully automated\nposter-generation models. The code and datasets are available at\nhttps://github.com/Paper2Poster/Paper2Poster.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "fine-grained", "criteria"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21496", "pdf": "https://arxiv.org/pdf/2505.21496", "abs": "https://arxiv.org/abs/2505.21496", "authors": ["Han Xiao", "Guozhi Wang", "Yuxiang Chai", "Zimu Lu", "Weifeng Lin", "Hao He", "Lue Fan", "Liuyang Bian", "Rui Hu", "Liang Liu", "Shuai Ren", "Yafei Wen", "Xiaoxin Chen", "Aojun Zhou", "Hongsheng Li"], "title": "UI-Genie: A Self-Improving Approach for Iteratively Boosting MLLM-based Mobile GUI Agents", "categories": ["cs.CL", "cs.CV", "cs.LG"], "comment": "https://github.com/Euphoria16/UI-Genie", "summary": "In this paper, we introduce UI-Genie, a self-improving framework addressing\ntwo key challenges in GUI agents: verification of trajectory outcome is\nchallenging and high-quality training data are not scalable. These challenges\nare addressed by a reward model and a self-improving pipeline, respectively.\nThe reward model, UI-Genie-RM, features an image-text interleaved architecture\nthat efficiently pro- cesses historical context and unifies action-level and\ntask-level rewards. To sup- port the training of UI-Genie-RM, we develop\ndeliberately-designed data genera- tion strategies including rule-based\nverification, controlled trajectory corruption, and hard negative mining. To\naddress the second challenge, a self-improvement pipeline progressively expands\nsolvable complex GUI tasks by enhancing both the agent and reward models\nthrough reward-guided exploration and outcome verification in dynamic\nenvironments. For training the model, we generate UI- Genie-RM-517k and\nUI-Genie-Agent-16k, establishing the first reward-specific dataset for GUI\nagents while demonstrating high-quality synthetic trajectory gen- eration\nwithout manual annotation. Experimental results show that UI-Genie achieves\nstate-of-the-art performance across multiple GUI agent benchmarks with three\ngenerations of data-model self-improvement. We open-source our complete\nframework implementation and generated datasets to facilitate further research\nin https://github.com/Euphoria16/UI-Genie.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21505", "pdf": "https://arxiv.org/pdf/2505.21505", "abs": "https://arxiv.org/abs/2505.21505", "authors": ["Shimao Zhang", "Zhejian Lai", "Xiang Liu", "Shuaijie She", "Xiao Liu", "Yeyun Gong", "Shujian Huang", "Jiajun Chen"], "title": "How does Alignment Enhance LLMs' Multilingual Capabilities? A Language Neurons Perspective", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Multilingual Alignment is an effective and representative paradigm to enhance\nLLMs' multilingual capabilities, which transfers the capabilities from the\nhigh-resource languages to the low-resource languages. Meanwhile, some\nresearches on language-specific neurons reveal that there are language-specific\nneurons that are selectively activated in LLMs when processing different\nlanguages. This provides a new perspective to analyze and understand LLMs'\nmechanisms more specifically in multilingual scenarios. In this work, we\npropose a new finer-grained neuron identification algorithm, which detects\nlanguage neurons~(including language-specific neurons and language-related\nneurons) and language-agnostic neurons. Furthermore, based on the\ndistributional characteristics of different types of neurons, we divide the\nLLMs' internal process for multilingual inference into four parts: (1)\nmultilingual understanding, (2) shared semantic space reasoning, (3)\nmultilingual output space transformation, and (4) vocabulary space outputting.\nAdditionally, we systematically analyze the models before and after alignment\nwith a focus on different types of neurons. We also analyze the phenomenon of\n''Spontaneous Multilingual Alignment''. Overall, our work conducts a\ncomprehensive investigation based on different types of neurons, providing\nempirical results and valuable insights for better understanding multilingual\nalignment and multilingual capabilities of LLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20405", "pdf": "https://arxiv.org/pdf/2505.20405", "abs": "https://arxiv.org/abs/2505.20405", "authors": ["Lorenzo Baraldi", "Davide Bucciarelli", "Federico Betti", "Marcella Cornia", "Lorenzo Baraldi", "Nicu Sebe", "Rita Cucchiara"], "title": "What Changed? Detecting and Evaluating Instruction-Guided Image Edits with Multimodal Large Language Models", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.MM"], "comment": null, "summary": "Instruction-based image editing models offer increased personalization\nopportunities in generative tasks. However, properly evaluating their results\nis challenging, and most of the existing metrics lag in terms of alignment with\nhuman judgment and explainability. To tackle these issues, we introduce DICE\n(DIfference Coherence Estimator), a model designed to detect localized\ndifferences between the original and the edited image and to assess their\nrelevance to the given modification request. DICE consists of two key\ncomponents: a difference detector and a coherence estimator, both built on an\nautoregressive Multimodal Large Language Model (MLLM) and trained using a\nstrategy that leverages self-supervision, distillation from inpainting\nnetworks, and full supervision. Through extensive experiments, we evaluate each\nstage of our pipeline, comparing different MLLMs within the proposed framework.\nWe demonstrate that DICE effectively identifies coherent edits, effectively\nevaluating images generated by different editing models with a strong\ncorrelation with human judgment. We publicly release our source code, models,\nand data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20411", "pdf": "https://arxiv.org/pdf/2505.20411", "abs": "https://arxiv.org/abs/2505.20411", "authors": ["Ibragim Badertdinov", "Alexander Golubev", "Maksim Nekrashevich", "Anton Shevtsov", "Simon Karasik", "Andrei Andriushchenko", "Maria Trofimova", "Daria Litvintseva", "Boris Yangel"], "title": "SWE-rebench: An Automated Pipeline for Task Collection and Decontaminated Evaluation of Software Engineering Agents", "categories": ["cs.SE", "cs.CL"], "comment": "Dataset: https://huggingface.co/datasets/nebius/SWE-rebench,\n  SWE-rebench leaderboard https://swe-rebench.com", "summary": "LLM-based agents have shown promising capabilities in a growing range of\nsoftware engineering (SWE) tasks. However, advancing this field faces two\ncritical challenges. First, high-quality training data is scarce, especially\ndata that reflects real-world SWE scenarios, where agents must interact with\ndevelopment environments, execute code and adapt behavior based on the outcomes\nof their actions. Existing datasets are either limited to one-shot code\ngeneration or comprise small, manually curated collections of interactive\ntasks, lacking both scale and diversity. Second, the lack of fresh interactive\nSWE tasks affects evaluation of rapidly improving models, as static benchmarks\nquickly become outdated due to contamination issues. To address these\nlimitations, we introduce a novel, automated, and scalable pipeline to\ncontinuously extract real-world interactive SWE tasks from diverse GitHub\nrepositories. Using this pipeline, we construct SWE-rebench, a public dataset\ncomprising over 21,000 interactive Python-based SWE tasks, suitable for\nreinforcement learning of SWE agents at scale. Additionally, we use continuous\nsupply of fresh tasks collected using SWE-rebench methodology to build a\ncontamination-free benchmark for agentic software engineering. We compare\nresults of various LLMs on this benchmark to results on SWE-bench Verified and\nshow that performance of some language models might be inflated due to\ncontamination issues.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20521", "pdf": "https://arxiv.org/pdf/2505.20521", "abs": "https://arxiv.org/abs/2505.20521", "authors": ["Ana Rita Ortigoso", "Gabriel Vieira", "Daniel Fuentes", "Luis Frazo", "Nuno Costa", "Antnio Pereira"], "title": "Project Riley: Multimodal Multi-Agent LLM Collaboration with Emotional Reasoning and Voting", "categories": ["cs.AI", "cs.CL", "I.2.7; I.2.1; H.5.2"], "comment": "28 pages, 5 figures. Submitted for review to Information Fusion", "summary": "This paper presents Project Riley, a novel multimodal and multi-model\nconversational AI architecture oriented towards the simulation of reasoning\ninfluenced by emotional states. Drawing inspiration from Pixar's Inside Out,\nthe system comprises five distinct emotional agents - Joy, Sadness, Fear,\nAnger, and Disgust - that engage in structured multi-round dialogues to\ngenerate, criticise, and iteratively refine responses. A final reasoning\nmechanism synthesises the contributions of these agents into a coherent output\nthat either reflects the dominant emotion or integrates multiple perspectives.\nThe architecture incorporates both textual and visual large language models\n(LLMs), alongside advanced reasoning and self-refinement processes. A\nfunctional prototype was deployed locally in an offline environment, optimised\nfor emotional expressiveness and computational efficiency. From this initial\nprototype, another one emerged, called Armando, which was developed for use in\nemergency contexts, delivering emotionally calibrated and factually accurate\ninformation through the integration of Retrieval-Augmented Generation (RAG) and\ncumulative context tracking. The Project Riley prototype was evaluated through\nuser testing, in which participants interacted with the chatbot and completed a\nstructured questionnaire assessing three dimensions: Emotional Appropriateness,\nClarity and Utility, and Naturalness and Human-likeness. The results indicate\nstrong performance in structured scenarios, particularly with respect to\nemotional alignment and communicative clarity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20561", "pdf": "https://arxiv.org/pdf/2505.20561", "abs": "https://arxiv.org/abs/2505.20561", "authors": ["Shenao Zhang", "Yaqing Wang", "Yinxiao Liu", "Tianqi Liu", "Peter Grabowski", "Eugene Ie", "Zhaoran Wang", "Yunxuan Li"], "title": "Beyond Markovian: Reflective Exploration via Bayes-Adaptive RL for LLM Reasoning", "categories": ["cs.LG", "cs.AI", "cs.CL", "stat.ML"], "comment": null, "summary": "Large Language Models (LLMs) trained via Reinforcement Learning (RL) have\nexhibited strong reasoning capabilities and emergent reflective behaviors, such\nas backtracking and error correction. However, conventional Markovian RL\nconfines exploration to the training phase to learn an optimal deterministic\npolicy and depends on the history contexts only through the current state.\nTherefore, it remains unclear whether reflective reasoning will emerge during\nMarkovian RL training, or why they are beneficial at test time. To remedy this,\nwe recast reflective exploration within the Bayes-Adaptive RL framework, which\nexplicitly optimizes the expected return under a posterior distribution over\nMarkov decision processes. This Bayesian formulation inherently incentivizes\nboth reward-maximizing exploitation and information-gathering exploration via\nbelief updates. Our resulting algorithm, BARL, instructs the LLM to stitch and\nswitch strategies based on the observed outcomes, offering principled guidance\non when and how the model should reflectively explore. Empirical results on\nboth synthetic and mathematical reasoning tasks demonstrate that BARL\noutperforms standard Markovian RL approaches at test time, achieving superior\ntoken efficiency with improved exploration effectiveness. Our code is available\nat https://github.com/shenao-zhang/BARL.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["mathematical reasoning"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20962", "pdf": "https://arxiv.org/pdf/2505.20962", "abs": "https://arxiv.org/abs/2505.20962", "authors": ["Nikos Giannakakis", "Argyris Manetas", "Panagiotis P. Filntisis", "Petros Maragos", "George Retsinas"], "title": "Object-Centric Action-Enhanced Representations for Robot Visuo-Motor Policy Learning", "categories": ["cs.RO", "cs.CV"], "comment": null, "summary": "Learning visual representations from observing actions to benefit robot\nvisuo-motor policy generation is a promising direction that closely resembles\nhuman cognitive function and perception. Motivated by this, and further\ninspired by psychological theories suggesting that humans process scenes in an\nobject-based fashion, we propose an object-centric encoder that performs\nsemantic segmentation and visual representation generation in a coupled manner,\nunlike other works, which treat these as separate processes. To achieve this,\nwe leverage the Slot Attention mechanism and use the SOLV model, pretrained in\nlarge out-of-domain datasets, to bootstrap fine-tuning on human action video\ndata. Through simulated robotic tasks, we demonstrate that visual\nrepresentations can enhance reinforcement and imitation learning training,\nhighlighting the effectiveness of our integrated approach for semantic\nsegmentation and encoding. Furthermore, we show that exploiting models\npretrained on out-of-domain datasets can benefit this process, and that\nfine-tuning on datasets depicting human actions -- although still out-of-domain\n-- , can significantly improve performance due to close alignment with robotic\ntasks. These findings show the capability to reduce reliance on annotated or\nrobot-specific action datasets and the potential to build on existing visual\nencoders to accelerate training and improve generalizability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20692", "pdf": "https://arxiv.org/pdf/2505.20692", "abs": "https://arxiv.org/abs/2505.20692", "authors": ["Saharsh Barve", "Andy Mao", "Jiayue Melissa Shi", "Prerna Juneja", "Koustuv Saha"], "title": "Can we Debias Social Stereotypes in AI-Generated Images? Examining Text-to-Image Outputs and User Perceptions", "categories": ["cs.HC", "cs.AI", "cs.CL"], "comment": null, "summary": "Recent advances in generative AI have enabled visual content creation through\ntext-to-image (T2I) generation. However, despite their creative potential, T2I\nmodels often replicate and amplify societal stereotypes -- particularly those\nrelated to gender, race, and culture -- raising important ethical concerns.\nThis paper proposes a theory-driven bias detection rubric and a Social\nStereotype Index (SSI) to systematically evaluate social biases in T2I outputs.\nWe audited three major T2I model outputs -- DALL-E-3, Midjourney-6.1, and\nStability AI Core -- using 100 queries across three categories -- geocultural,\noccupational, and adjectival. Our analysis reveals that initial outputs are\nprone to include stereotypical visual cues, including gendered professions,\ncultural markers, and western beauty norms. To address this, we adopted our\nrubric to conduct targeted prompt refinement using LLMs, which significantly\nreduced bias -- SSI dropped by 61% for geocultural, 69% for occupational, and\n51% for adjectival queries. We complemented our quantitative analysis through a\nuser study examining perceptions, awareness, and preferences around\nAI-generated biased imagery. Our findings reveal a key tension -- although\nprompt refinement can mitigate stereotypes, it can limit contextual alignment.\nInterestingly, users often perceived stereotypical images to be more aligned\nwith their expectations. We discuss the need to balance ethical debiasing with\ncontextual relevance and call for T2I systems that support global diversity and\ninclusivity while not compromising the reflection of real-world social\ncomplexity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["rubric"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20715", "pdf": "https://arxiv.org/pdf/2505.20715", "abs": "https://arxiv.org/abs/2505.20715", "authors": ["Fuwen Luo", "Shengfeng Lou", "Chi Chen", "Ziyue Wang", "Chenliang Li", "Weizhou Shen", "Jiyue Guo", "Peng Li", "Ming Yan", "Ji Zhang", "Fei Huang", "Yang Liu"], "title": "MUSEG: Reinforcing Video Temporal Understanding via Timestamp-Aware Multi-Segment Grounding", "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Video temporal understanding is crucial for multimodal large language models\n(MLLMs) to reason over events in videos. Despite recent advances in general\nvideo understanding, current MLLMs still struggle with fine-grained temporal\nreasoning. While reinforcement learning (RL) has been explored to address this\nissue recently, existing RL approaches remain limited in effectiveness. In this\nwork, we propose MUSEG, a novel RL-based method that enhances temporal\nunderstanding by introducing timestamp-aware multi-segment grounding. MUSEG\nenables MLLMs to align queries with multiple relevant video segments, promoting\nmore comprehensive temporal reasoning. To facilitate effective learning, we\ndesign a customized RL training recipe with phased rewards that progressively\nguides the model toward temporally grounded reasoning. Extensive experiments on\ntemporal grounding and time-sensitive video QA tasks demonstrate that MUSEG\nsignificantly outperforms existing methods and generalizes well across diverse\ntemporal understanding scenarios. View our project at\nhttps://github.com/THUNLP-MT/MUSEG.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.20730", "pdf": "https://arxiv.org/pdf/2505.20730", "abs": "https://arxiv.org/abs/2505.20730", "authors": ["Shahrooz Pouryousef"], "title": "What LLMs Miss in Recommendations: Bridging the Gap with Retrieval-Augmented Collaborative Signals", "categories": ["cs.IR", "cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "User-item interactions contain rich collaborative signals that form the\nbackbone of many successful recommender systems. While recent work has explored\nthe use of large language models (LLMs) for recommendation, it remains unclear\nwhether LLMs can effectively reason over this type of collaborative\ninformation. In this paper, we conduct a systematic comparison between LLMs and\nclassical matrix factorization (MF) models to assess LLMs' ability to leverage\nuser-item interaction data. We further introduce a simple retrieval-augmented\ngeneration (RAG) method that enhances LLMs by grounding their predictions in\nstructured interaction data. Our experiments reveal that current LLMs often\nfall short in capturing collaborative patterns inherent to MF models, but that\nour RAG-based approach substantially improves recommendation\nquality-highlighting a promising direction for future LLM-based recommenders.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21074", "pdf": "https://arxiv.org/pdf/2505.21074", "abs": "https://arxiv.org/abs/2505.21074", "authors": ["Yichuan Cao", "Yibo Miao", "Xiao-Shan Gao", "Yinpeng Dong"], "title": "Red-Teaming Text-to-Image Systems by Rule-based Preference Modeling", "categories": ["cs.LG", "cs.AI", "cs.CR", "cs.CV", "stat.ML"], "comment": null, "summary": "Text-to-image (T2I) models raise ethical and safety concerns due to their\npotential to generate inappropriate or harmful images. Evaluating these models'\nsecurity through red-teaming is vital, yet white-box approaches are limited by\ntheir need for internal access, complicating their use with closed-source\nmodels. Moreover, existing black-box methods often assume knowledge about the\nmodel's specific defense mechanisms, limiting their utility in real-world\ncommercial API scenarios. A significant challenge is how to evade unknown and\ndiverse defense mechanisms. To overcome this difficulty, we propose a novel\nRule-based Preference modeling Guided Red-Teaming (RPG-RT), which iteratively\nemploys LLM to modify prompts to query and leverages feedback from T2I systems\nfor fine-tuning the LLM. RPG-RT treats the feedback from each iteration as a\nprior, enabling the LLM to dynamically adapt to unknown defense mechanisms.\nGiven that the feedback is often labeled and coarse-grained, making it\ndifficult to utilize directly, we further propose rule-based preference\nmodeling, which employs a set of rules to evaluate desired or undesired\nfeedback, facilitating finer-grained control over the LLM's dynamic adaptation\nprocess. Extensive experiments on nineteen T2I systems with varied safety\nmechanisms, three online commercial API services, and T2V models verify the\nsuperiority and practicality of our approach.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21162", "pdf": "https://arxiv.org/pdf/2505.21162", "abs": "https://arxiv.org/abs/2505.21162", "authors": ["Davi A. Bezerra", "Filipi N. Silva", "Diego R. Amancio"], "title": "Leveraging GANs for citation intent classification and its impact on citation network analysis", "categories": ["cs.DL", "cs.CL", "cs.SI"], "comment": null, "summary": "Citations play a fundamental role in the scientific ecosystem, serving as a\nfoundation for tracking the flow of knowledge, acknowledging prior work, and\nassessing scholarly influence. In scientometrics, they are also central to the\nconstruction of quantitative indicators. Not all citations, however, serve the\nsame function: some provide background, others introduce methods, or compare\nresults. Therefore, understanding citation intent allows for a more nuanced\ninterpretation of scientific impact. In this paper, we adopted a GAN-based\nmethod to classify citation intents. Our results revealed that the proposed\nmethod achieves competitive classification performance, closely matching\nstate-of-the-art results with substantially fewer parameters. This demonstrates\nthe effectiveness and efficiency of leveraging GAN architectures combined with\ncontextual embeddings in intent classification task. We also investigated\nwhether filtering citation intents affects the centrality of papers in citation\nnetworks. Analyzing the network constructed from the unArXiv dataset, we found\nthat paper rankings can be significantly influenced by citation intent. All\nfour centrality metrics examined- degree, PageRank, closeness, and betweenness\n- were sensitive to the filtering of citation types. The betweenness centrality\ndisplayed the greatest sensitivity, showing substantial changes in ranking when\nspecific citation intents were removed.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21184", "pdf": "https://arxiv.org/pdf/2505.21184", "abs": "https://arxiv.org/abs/2505.21184", "authors": ["Yu Yan", "Sheng Sun", "Zhifei Zheng", "Ziji Hao", "Teli Liu", "Min Liu"], "title": "PoisonSwarm: Universal Harmful Information Synthesis via Model Crowdsourcing", "categories": ["cs.LG", "cs.AI", "cs.CL"], "comment": null, "summary": "To construct responsible and secure AI applications, harmful information data\nis widely utilized for adversarial testing and the development of safeguards.\nExisting studies mainly leverage Large Language Models (LLMs) to synthesize\ndata to obtain high-quality task datasets at scale, thereby avoiding costly\nhuman annotation. However, limited by the safety alignment mechanisms of LLMs,\nthe synthesis of harmful data still faces challenges in generation reliability\nand content diversity. In this study, we propose a novel harmful information\nsynthesis framework, PoisonSwarm, which applies the model crowdsourcing\nstrategy to generate diverse harmful data while maintaining a high success\nrate. Specifically, we generate abundant benign data as the based templates in\na counterfactual manner. Subsequently, we decompose each based template into\nmultiple semantic units and perform unit-by-unit toxification and final\nrefinement through dynamic model switching, thus ensuring the success of\nsynthesis. Experimental results demonstrate that PoisonSwarm achieves\nstate-of-the-art performance in synthesizing different categories of harmful\ndata with high scalability and diversity.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation", "safety", "reliability"], "score": 3}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21496", "pdf": "https://arxiv.org/pdf/2505.21496", "abs": "https://arxiv.org/abs/2505.21496", "authors": ["Han Xiao", "Guozhi Wang", "Yuxiang Chai", "Zimu Lu", "Weifeng Lin", "Hao He", "Lue Fan", "Liuyang Bian", "Rui Hu", "Liang Liu", "Shuai Ren", "Yafei Wen", "Xiaoxin Chen", "Aojun Zhou", "Hongsheng Li"], "title": "UI-Genie: A Self-Improving Approach for Iteratively Boosting MLLM-based Mobile GUI Agents", "categories": ["cs.CL", "cs.CV", "cs.LG"], "comment": "https://github.com/Euphoria16/UI-Genie", "summary": "In this paper, we introduce UI-Genie, a self-improving framework addressing\ntwo key challenges in GUI agents: verification of trajectory outcome is\nchallenging and high-quality training data are not scalable. These challenges\nare addressed by a reward model and a self-improving pipeline, respectively.\nThe reward model, UI-Genie-RM, features an image-text interleaved architecture\nthat efficiently pro- cesses historical context and unifies action-level and\ntask-level rewards. To sup- port the training of UI-Genie-RM, we develop\ndeliberately-designed data genera- tion strategies including rule-based\nverification, controlled trajectory corruption, and hard negative mining. To\naddress the second challenge, a self-improvement pipeline progressively expands\nsolvable complex GUI tasks by enhancing both the agent and reward models\nthrough reward-guided exploration and outcome verification in dynamic\nenvironments. For training the model, we generate UI- Genie-RM-517k and\nUI-Genie-Agent-16k, establishing the first reward-specific dataset for GUI\nagents while demonstrating high-quality synthetic trajectory gen- eration\nwithout manual annotation. Experimental results show that UI-Genie achieves\nstate-of-the-art performance across multiple GUI agent benchmarks with three\ngenerations of data-model self-improvement. We open-source our complete\nframework implementation and generated datasets to facilitate further research\nin https://github.com/Euphoria16/UI-Genie.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "annotation"], "score": 2}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21472", "pdf": "https://arxiv.org/pdf/2505.21472", "abs": "https://arxiv.org/abs/2505.21472", "authors": ["Mehrdad Fazli", "Bowen Wei", "Ziwei Zhu"], "title": "Mitigating Hallucination in Large Vision-Language Models via Adaptive Attention Calibration", "categories": ["cs.CV", "cs.CL"], "comment": null, "summary": "Large vision-language models (LVLMs) achieve impressive performance on\nmultimodal tasks but often suffer from hallucination, and confidently describe\nobjects or attributes not present in the image. Current inference-time\ninterventions, while training-free, struggle to maintain accuracy in open-ended\nand long-form generation scenarios. We introduce the Confidence-Aware Attention\nCalibration (CAAC) framework to address this challenge by targeting two key\nbiases: spatial perception bias, which distributes attention disproportionately\nacross image tokens, and modality bias, which shifts focus from visual to\ntextual inputs over time. CAAC employs a two-step approach: Visual-Token\nCalibration (VTC) to balance attention across visual tokens, and Adaptive\nAttention Re-Scaling (AAR) to reinforce visual grounding based on the model's\nconfidence. This confidence-driven adjustment ensures consistent visual\nalignment during generation. Experiments on CHAIR, AMBER, and POPE benchmarks\ndemonstrate that CAAC outperforms baselines, particularly in long-form\ngenerations, effectively reducing hallucination.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-05-28.jsonl"}
{"id": "2505.21497", "pdf": "https://arxiv.org/pdf/2505.21497", "abs": "https://arxiv.org/abs/2505.21497", "authors": ["Wei Pang", "Kevin Qinghong Lin", "Xiangru Jian", "Xi He", "Philip Torr"], "title": "Paper2Poster: Towards Multimodal Poster Automation from Scientific Papers", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.MA"], "comment": "Project Page: https://github.com/Paper2Poster/Paper2Poster", "summary": "Academic poster generation is a crucial yet challenging task in scientific\ncommunication, requiring the compression of long-context interleaved documents\ninto a single, visually coherent page. To address this challenge, we introduce\nthe first benchmark and metric suite for poster generation, which pairs recent\nconference papers with author-designed posters and evaluates outputs on\n(i)Visual Quality-semantic alignment with human posters, (ii)Textual\nCoherence-language fluency, (iii)Holistic Assessment-six fine-grained aesthetic\nand informational criteria scored by a VLM-as-judge, and notably\n(iv)PaperQuiz-the poster's ability to convey core paper content as measured by\nVLMs answering generated quizzes. Building on this benchmark, we propose\nPosterAgent, a top-down, visual-in-the-loop multi-agent pipeline: the (a)Parser\ndistills the paper into a structured asset library; the (b)Planner aligns\ntext-visual pairs into a binary-tree layout that preserves reading order and\nspatial balance; and the (c)Painter-Commenter loop refines each panel by\nexecuting rendering code and using VLM feedback to eliminate overflow and\nensure alignment. In our comprehensive evaluation, we find that GPT-4o\noutputs-though visually appealing at first glance-often exhibit noisy text and\npoor PaperQuiz scores, and we find that reader engagement is the primary\naesthetic bottleneck, as human-designed posters rely largely on visual\nsemantics to convey meaning. Our fully open-source variants (e.g. based on the\nQwen-2.5 series) outperform existing 4o-driven multi-agent systems across\nnearly all metrics, while using 87% fewer tokens. It transforms a 22-page paper\ninto a finalized yet editable .pptx poster - all for just $0.005. These\nfindings chart clear directions for the next generation of fully automated\nposter-generation models. The code and datasets are available at\nhttps://github.com/Paper2Poster/Paper2Poster.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "fine-grained", "criteria"], "score": 4}}, "source_file": "2025-05-28.jsonl"}
