{"id": "2506.05598", "pdf": "https://arxiv.org/pdf/2506.05598", "abs": "https://arxiv.org/abs/2506.05598", "authors": ["Michael J Ryan", "Omar Shaikh", "Aditri Bhagirath", "Daniel Frees", "William Held", "Diyi Yang"], "title": "SynthesizeMe! Inducing Persona-Guided Prompts for Personalized Reward Models in LLMs", "categories": ["cs.CL", "cs.AI"], "comment": "ACL 2025 Main Conference", "summary": "Recent calls for pluralistic alignment of Large Language Models (LLMs)\nencourage adapting models to diverse user preferences. However, most prior work\non personalized reward models heavily rely on additional identity information,\nsuch as demographic details or a predefined set of preference categories. To\nthis end, we introduce SynthesizeMe, an approach to inducing synthetic user\npersonas from user interactions for personalized reward modeling. SynthesizeMe\nfirst generates and verifies reasoning to explain user preferences, then\ninduces synthetic user personas from that reasoning, and finally filters to\ninformative prior user interactions in order to build personalized prompts for\na particular user. We show that using SynthesizeMe induced prompts improves\npersonalized LLM-as-a-judge accuracy by 4.4% on Chatbot Arena. Combining\nSynthesizeMe derived prompts with a reward model achieves top performance on\nPersonalRewardBench: a new curation of user-stratified interactions with\nchatbots collected from 854 users of Chatbot Arena and PRISM.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reward modeling", "preference", "alignment"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05760", "pdf": "https://arxiv.org/pdf/2506.05760", "abs": "https://arxiv.org/abs/2506.05760", "authors": ["Xuanyu Lei", "Chenliang Li", "Yuning Wu", "Kaiming Liu", "Weizhou Shen", "Peng Li", "Ming Yan", "Ji Zhang", "Fei Huang", "Yang Liu"], "title": "Writing-RL: Advancing Long-form Writing via Adaptive Curriculum Reinforcement Learning", "categories": ["cs.CL"], "comment": "Work in progress", "summary": "Recent advances in Large Language Models (LLMs) have enabled strong\nperformance in long-form writing, yet existing supervised fine-tuning (SFT)\napproaches suffer from limitations such as data saturation and restricted\nlearning capacity bounded by teacher signals. In this work, we present\nWriting-RL: an Adaptive Curriculum Reinforcement Learning framework to advance\nlong-form writing capabilities beyond SFT. The framework consists of three key\ncomponents: Margin-aware Data Selection strategy that prioritizes samples with\nhigh learning potential, Pairwise Comparison Reward mechanism that provides\ndiscriminative learning signals in the absence of verifiable rewards, and\nDynamic Reference Scheduling approach, which plays a particularly critical role\nby adaptively adjusting task difficulty based on evolving model performance.\nExperiments on 7B-scale writer models show that our RL framework largely\nimproves long-form writing performance over strong SFT baselines. Furthermore,\nwe observe that models trained with long-output RL generalize surprisingly well\nto long-input reasoning tasks, potentially offering a promising perspective for\nrethinking long-context training.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "comparison", "pairwise"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06231", "pdf": "https://arxiv.org/pdf/2506.06231", "abs": "https://arxiv.org/abs/2506.06231", "authors": ["Mohammad Jalali", "Bahar Dibaei Nia", "Farzan Farnia"], "title": "Towards an Explainable Comparison and Alignment of Feature Embeddings", "categories": ["cs.LG", "cs.AI", "cs.CV", "math.SP"], "comment": null, "summary": "While several feature embedding models have been developed in the literature,\ncomparisons of these embeddings have largely focused on their numerical\nperformance in classification-related downstream applications. However, an\ninterpretable comparison of different embeddings requires identifying and\nanalyzing mismatches between sample groups clustered within the embedding\nspaces. In this work, we propose the \\emph{Spectral Pairwise Embedding\nComparison (SPEC)} framework to compare embeddings and identify their\ndifferences in clustering a reference dataset. Our approach examines the kernel\nmatrices derived from two embeddings and leverages the eigendecomposition of\nthe difference kernel matrix to detect sample clusters that are captured\ndifferently by the two embeddings. We present a scalable implementation of this\nkernel-based approach, with computational complexity that grows linearly with\nthe sample size. Furthermore, we introduce an optimization problem using this\nframework to align two embeddings, ensuring that clusters identified in one\nembedding are also captured in the other model. We provide numerical results\ndemonstrating the SPEC's application to compare and align embeddings on\nlarge-scale datasets such as ImageNet and MS-COCO. The code is available at\n[https://github.com/mjalali/embedding-comparison](github.com/mjalali/embedding-comparison).", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison", "pairwise", "alignment"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05384", "pdf": "https://arxiv.org/pdf/2506.05384", "abs": "https://arxiv.org/abs/2506.05384", "authors": ["Zhuoxuan Cai", "Jian Zhang", "Xinbin Yuan", "Pengtao Jiang", "Wenxiang Chen", "Bowen Tang", "Lujian Yao", "Qiyuan Wang", "Jinwen Chen", "Bo Li"], "title": "Q-Ponder: A Unified Training Pipeline for Reasoning-based Visual Quality Assessment", "categories": ["cs.CV", "cs.AI", "cs.MM"], "comment": null, "summary": "Recent studies demonstrate that multimodal large language models (MLLMs) can\nproficiently evaluate visual quality through interpretable assessments.\nHowever, existing approaches typically treat quality scoring and reasoning\ndescriptions as separate tasks with disjoint optimization objectives, leading\nto a trade-off: models adept at quality reasoning descriptions struggle with\nprecise score regression, while score-focused models lack interpretability.\nThis limitation hinders the full potential of MLLMs in visual quality\nassessment, where accuracy and interpretability should be mutually reinforcing.\nTo address this, we propose a unified two-stage training framework comprising a\ncold-start stage and a reinforcement learning-based fine-tuning stage.\nSpecifically, in the first stage, we distill high-quality data from a teacher\nmodel through expert-designed prompts, initializing reasoning capabilities via\ncross-entropy loss supervision. In the second stage, we introduce a novel\nreward with Group Relative Policy Optimization (GRPO) to jointly optimize\nscoring accuracy and reasoning consistency. We designate the models derived\nfrom these two stages as Q-Ponder-CI and Q-Ponder. Extensive experiments show\nthat Q-Ponder achieves state-of-the-art (SOTA) performance on quality score\nregression benchmarks, delivering up to 6.5% higher SRCC on cross-domain\ndatasets. Furthermore, Q-Ponder significantly outperforms description-based\nSOTA models, including its teacher model Qwen-2.5-VL-72B, particularly in\ndescription accuracy and reasonableness, demonstrating the generalization\npotential over diverse tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05501", "pdf": "https://arxiv.org/pdf/2506.05501", "abs": "https://arxiv.org/abs/2506.05501", "authors": ["Kaihang Pan", "Wendong Bu", "Yuruo Wu", "Yang Wu", "Kai Shen", "Yunfei Li", "Hang Zhao", "Juncheng Li", "Siliang Tang", "Yueting Zhuang"], "title": "FocusDiff: Advancing Fine-Grained Text-Image Alignment for Autoregressive Visual Generation through RL", "categories": ["cs.CV"], "comment": "15 pages, 8 figures. Project Page: https://focusdiff.github.io/", "summary": "Recent studies extend the autoregression paradigm to text-to-image\ngeneration, achieving performance comparable to diffusion models. However, our\nnew PairComp benchmark -- featuring test cases of paired prompts with similar\nsyntax but different fine-grained semantics -- reveals that existing models\nstruggle with fine-grained text-image alignment thus failing to realize precise\ncontrol over visual tokens. To address this, we propose FocusDiff, which\nenhances fine-grained text-image semantic alignment by focusing on subtle\ndifferences between similar text-image pairs. We construct a new dataset of\npaired texts and images with similar overall expressions but distinct local\nsemantics, further introducing a novel reinforcement learning algorithm to\nemphasize such fine-grained semantic differences for desired image generation.\nOur approach achieves state-of-the-art performance on existing text-to-image\nbenchmarks and significantly outperforms prior methods on PairComp.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "fine-grained"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05850", "pdf": "https://arxiv.org/pdf/2506.05850", "abs": "https://arxiv.org/abs/2506.05850", "authors": ["Cheonbok Park", "Jeonghoon Kim", "Joosung Lee", "Sanghwan Bae", "Jaegul Choo", "Kangmin Yoo"], "title": "Cross-lingual Collapse: How Language-Centric Foundation Models Shape Reasoning in Large Language Models", "categories": ["cs.CL", "cs.AI"], "comment": "Preprint", "summary": "We identify \\textbf{Cross-lingual Collapse}, a systematic drift in which the\nchain-of-thought (CoT) of a multilingual language model reverts to its dominant\npre-training language even when the prompt is expressed in a different\nlanguage. Recent large language models (LLMs) with reinforcement learning with\nverifiable reward (RLVR) have achieved strong logical reasoning performances by\nexposing their intermediate reasoning traces, giving rise to large reasoning\nmodels (LRMs). However, the mechanism behind multilingual reasoning in LRMs is\nnot yet fully explored. To investigate the issue, we fine-tune multilingual\nLRMs with Group-Relative Policy Optimization (GRPO) on translated versions of\nthe GSM$8$K and SimpleRL-Zoo datasets in three different languages: Chinese,\nKorean, and Ukrainian. During training, we monitor both task accuracy and\nlanguage consistency of the reasoning chains. Our experiments reveal three key\nfindings: (i) GRPO rapidly amplifies pre-training language imbalances, leading\nto the erosion of low-resource languages within just a few hundred updates;\n(ii) language consistency reward mitigates this drift but does so at the\nexpense of an almost 5 - 10 pp drop in accuracy. and (iii) the resulting\nlanguage collapse is severely damaging and largely irreversible, as subsequent\nfine-tuning struggles to steer the model back toward its original\ntarget-language reasoning capabilities. Together, these findings point to a\nremarkable conclusion: \\textit{not all languages are trained equally for\nreasoning}. Furthermore, our paper sheds light on the roles of reward shaping,\ndata difficulty, and pre-training priors in eliciting multilingual reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05901", "pdf": "https://arxiv.org/pdf/2506.05901", "abs": "https://arxiv.org/abs/2506.05901", "authors": ["Chenyang Shao", "Xinyang Liu", "Yutang Lin", "Fengli Xu", "Yong Li"], "title": "Route-and-Reason: Scaling Large Language Model Reasoning with Reinforced Model Router", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Multi-step reasoning has proven essential for enhancing the problem-solving\ncapabilities of Large Language Models (LLMs) by decomposing complex tasks into\nintermediate steps, either explicitly or implicitly. Extending the reasoning\nchain at test time through deeper thought processes or broader exploration, can\nfurthur improve performance, but often incurs substantial costs due to the\nexplosion in token usage. Yet, many reasoning steps are relatively simple and\ncan be handled by more efficient smaller-scale language models (SLMs). This\nmotivates hybrid approaches that allocate subtasks across models of varying\ncapacities. However, realizing such collaboration requires accurate task\ndecomposition and difficulty-aware subtask allocation, which is challenging. To\naddress this, we propose R2-Reasoner, a novel framework that enables\ncollaborative reasoning across heterogeneous LLMs by dynamically routing\nsub-tasks based on estimated complexity. At the core of our framework is a\nReinforced Model Router, composed of a task decomposer and a subtask allocator.\nThe task decomposer segments complex input queries into logically ordered\nsubtasks, while the subtask allocator assigns each subtask to the most\nappropriate model, ranging from lightweight SLMs to powerful LLMs, balancing\naccuracy and efficiency. To train this router, we introduce a staged pipeline\nthat combines supervised fine-tuning on task-specific datasets with Group\nRelative Policy Optimization algorithm, enabling self-supervised refinement\nthrough iterative reinforcement learning. Extensive experiments across four\nchallenging benchmarks demonstrate that R2-Reasoner reduces API costs by 86.85%\nwhile maintaining or surpassing baseline accuracy. Our framework paves the way\nfor more cost-effective and adaptive LLM reasoning. The code is open-source at\nhttps://anonymous.4open.science/r/R2_Reasoner .", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test time", "scaling", "scale", "multi-step reasoning"], "score": 4}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06009", "pdf": "https://arxiv.org/pdf/2506.06009", "abs": "https://arxiv.org/abs/2506.06009", "authors": ["Haoke Zhang", "Xiaobo Liang", "Cunxiang Wang", "Juntao Li", "Min Zhang"], "title": "Unlocking Recursive Thinking of LLMs: Alignment via Refinement", "categories": ["cs.CL", "cs.AI"], "comment": "Accepted to the Findings of ACL 2025", "summary": "The OpenAI o1-series models have demonstrated that leveraging long-form Chain\nof Thought (CoT) can substantially enhance performance. However, the recursive\nthinking capabilities of Large Language Models (LLMs) remain limited,\nparticularly in the absence of expert-curated data for distillation. In this\npaper, we propose \\textbf{AvR}: \\textbf{Alignment via Refinement}, a novel\nmethod aimed at unlocking the potential of LLMs for recursive reasoning through\nlong-form CoT. AvR introduces a refinement process that integrates criticism\nand improvement actions, guided by differentiable learning techniques to\noptimize \\textbf{refinement-aware rewards}. As a result, the synthesized\nmulti-round data can be organized as a long refinement thought, further\nenabling test-time scaling. Experimental results show that AvR significantly\noutperforms conventional preference optimization methods. Notably, with only 3k\nsynthetic samples, our method boosts the performance of the LLaMA-3-8B-Instruct\nmodel by over 20\\% in win rate on AlpacaEval 2.0. Our code is available at\nGithub (https://github.com/Banner-Z/AvR.git).", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling", "o1"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06093", "pdf": "https://arxiv.org/pdf/2506.06093", "abs": "https://arxiv.org/abs/2506.06093", "authors": ["Atharv Kulkarni", "Vivek Srikumar"], "title": "Reinforcing Code Generation: Improving Text-to-SQL with Execution-Based Learning", "categories": ["cs.CL"], "comment": "Under review at EMNLP 2025", "summary": "In this work, we study the problem of code generation with a large language\nmodel (LLM), with a focus on generating SQL queries from natural language\nquestions. We ask: Instead of using supervised fine tuning with text-code\npairs, can we tune a model by having it interact with a database engine? We\nframe this problem as a reinforcement learning problem where the model receives\nexecution-based feedback from the environment in the form of scalar rewards.\nThese rewards penalize execution failures and assign positive values when a\nquery returns a correct answer. We use the rewards within the Group Relative\nPolicy Optimization (GRPO) framework. We use a tabular reasoning benchmark to\ntest and evaluate our findings. We find that with only weak supervision in the\nform of question-answer pairs, RL-tuning improves the accuracy of model\ngenerated SQL code from 31.49 to 49.83 while reducing error percentage from\n25.43% to 14.71%. This improvement allowed the model nearly match the\nperformance performance to the larger SQLCoder-70B model. Our work demonstrates\nthe potential of using execution-based feedback to improve symbolic reasoning\ncapabilities of LLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "code generation"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06137", "pdf": "https://arxiv.org/pdf/2506.06137", "abs": "https://arxiv.org/abs/2506.06137", "authors": ["Rihui Jin", "Zheyu Xin", "Xing Xie", "Zuoyi Li", "Guilin Qi", "Yongrui Chen", "Xinbang Dai", "Tongtong Wu", "Gholamreza Haffari"], "title": "Table-r1: Self-supervised and Reinforcement Learning for Program-based Table Reasoning in Small Language Models", "categories": ["cs.LG", "cs.CL"], "comment": null, "summary": "Table reasoning (TR) requires structured reasoning over semi-structured\ntabular data and remains challenging, particularly for small language models\n(SLMs, e.g., LLaMA-8B) due to their limited capacity compared to large LMs\n(LLMs, e.g., GPT-4o). To narrow this gap, we explore program-based TR (P-TR),\nwhich circumvents key limitations of text-based TR (T-TR), notably in numerical\nreasoning, by generating executable programs. However, applying P-TR to SLMs\nintroduces two challenges: (i) vulnerability to heterogeneity in table layouts,\nand (ii) inconsistency in reasoning due to limited code generation capability.\nWe propose Table-r1, a two-stage P-TR method designed for SLMs. Stage 1\nintroduces an innovative self-supervised learning task, Layout Transformation\nInference, to improve tabular layout generalization from a programmatic view.\nStage 2 adopts a mix-paradigm variant of Group Relative Policy Optimization,\nenhancing P-TR consistency while allowing dynamic fallback to T-TR when needed.\nExperiments on four TR benchmarks demonstrate that Table-r1 outperforms all\nSLM-based methods, achieving at least a 15% accuracy improvement over the base\nmodel (LLaMA-8B) across all datasets and reaching performance competitive with\nLLMs.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy", "code generation"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06254", "pdf": "https://arxiv.org/pdf/2506.06254", "abs": "https://arxiv.org/abs/2506.06254", "authors": ["Weizhi Zhang", "Xinyang Zhang", "Chenwei Zhang", "Liangwei Yang", "Jingbo Shang", "Zhepei Wei", "Henry Peng Zou", "Zijie Huang", "Zhengyang Wang", "Yifan Gao", "Xiaoman Pan", "Lian Xiong", "Jingguo Liu", "Philip S. Yu", "Xian Li"], "title": "PersonaAgent: When Large Language Model Agents Meet Personalization at Test Time", "categories": ["cs.AI", "cs.CL", "cs.LG"], "comment": null, "summary": "Large Language Model (LLM) empowered agents have recently emerged as advanced\nparadigms that exhibit impressive capabilities in a wide range of domains and\ntasks. Despite their potential, current LLM agents often adopt a\none-size-fits-all approach, lacking the flexibility to respond to users'\nvarying needs and preferences. This limitation motivates us to develop\nPersonaAgent, the first personalized LLM agent framework designed to address\nversatile personalization tasks. Specifically, PersonaAgent integrates two\ncomplementary components - a personalized memory module that includes episodic\nand semantic memory mechanisms; a personalized action module that enables the\nagent to perform tool actions tailored to the user. At the core, the persona\n(defined as unique system prompt for each user) functions as an intermediary:\nit leverages insights from personalized memory to control agent actions, while\nthe outcomes of these actions in turn refine the memory. Based on the\nframework, we propose a test-time user-preference alignment strategy that\nsimulate the latest n interactions to optimize the persona prompt, ensuring\nreal-time user preference alignment through textual loss feedback between\nsimulated and ground-truth responses. Experimental evaluations demonstrate that\nPersonaAgent significantly outperforms other baseline methods by not only\npersonalizing the action space effectively but also scaling during test-time\nreal-world applications. These results underscore the feasibility and potential\nof our approach in delivering tailored, dynamic user experiences.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "test time", "scaling"], "score": 3}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05869", "pdf": "https://arxiv.org/pdf/2506.05869", "abs": "https://arxiv.org/abs/2506.05869", "authors": ["Han Ji", "Yuqi Feng", "Jiahao Fan", "Yanan Sun"], "title": "Loss Functions for Predictor-based Neural Architecture Search", "categories": ["cs.LG", "cs.AI", "cs.CV"], "comment": null, "summary": "Evaluation is a critical but costly procedure in neural architecture search\n(NAS). Performance predictors have been widely adopted to reduce evaluation\ncosts by directly estimating architecture performance. The effectiveness of\npredictors is heavily influenced by the choice of loss functions. While\ntraditional predictors employ regression loss functions to evaluate the\nabsolute accuracy of architectures, recent approaches have explored various\nranking-based loss functions, such as pairwise and listwise ranking losses, to\nfocus on the ranking of architecture performance. Despite their success in NAS,\nthe effectiveness and characteristics of these loss functions have not been\nthoroughly investigated. In this paper, we conduct the first comprehensive\nstudy on loss functions in performance predictors, categorizing them into three\nmain types: regression, ranking, and weighted loss functions. Specifically, we\nassess eight loss functions using a range of NAS-relevant metrics on 13 tasks\nacross five search spaces. Our results reveal that specific categories of loss\nfunctions can be effectively combined to enhance predictor-based NAS.\nFurthermore, our findings could provide practical guidance for selecting\nappropriate loss functions for various tasks. We hope this work provides\nmeaningful insights to guide the development of loss functions for\npredictor-based methods in the NAS community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking", "pairwise"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05380", "pdf": "https://arxiv.org/pdf/2506.05380", "abs": "https://arxiv.org/abs/2506.05380", "authors": ["Yiliang Zhou", "Abigail M. Newbury", "Gongbo Zhang", "Betina Ross Idnay", "Hao Liu", "Chunhua Weng", "Yifan Peng"], "title": "EvidenceOutcomes: a Dataset of Clinical Trial Publications with Clinically Meaningful Outcomes", "categories": ["cs.CL"], "comment": null, "summary": "The fundamental process of evidence extraction and synthesis in\nevidence-based medicine involves extracting PICO (Population, Intervention,\nComparison, and Outcome) elements from biomedical literature. However,\nOutcomes, being the most complex elements, are often neglected or\noversimplified in existing benchmarks. To address this issue, we present\nEvidenceOutcomes, a novel, large, annotated corpus of clinically meaningful\noutcomes extracted from biomedical literature. We first developed a robust\nannotation guideline for extracting clinically meaningful outcomes from text\nthrough iteration and discussion with clinicians and Natural Language\nProcessing experts. Then, three independent annotators annotated the Results\nand Conclusions sections of a randomly selected sample of 500 PubMed abstracts\nand 140 PubMed abstracts from the existing EBM-NLP corpus. This resulted in\nEvidenceOutcomes with high-quality annotations of an inter-rater agreement of\n0.76. Additionally, our fine-tuned PubMedBERT model, applied to these 500\nPubMed abstracts, achieved an F1-score of 0.69 at the entity level and 0.76 at\nthe token level on the subset of 140 PubMed abstracts from the EBM-NLP corpus.\nEvidenceOutcomes can serve as a shared benchmark to develop and test future\nmachine learning algorithms to extract clinically meaningful outcomes from\nbiomedical abstracts.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "annotation", "agreement"], "score": 4}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05367", "pdf": "https://arxiv.org/pdf/2506.05367", "abs": "https://arxiv.org/abs/2506.05367", "authors": ["Aakash Garg", "Libing Zeng", "Andrii Tsarov", "Nima Khademi Kalantari"], "title": "Text2Stereo: Repurposing Stable Diffusion for Stereo Generation with Consistency Rewards", "categories": ["cs.CV"], "comment": null, "summary": "In this paper, we propose a novel diffusion-based approach to generate stereo\nimages given a text prompt. Since stereo image datasets with large baselines\nare scarce, training a diffusion model from scratch is not feasible. Therefore,\nwe propose leveraging the strong priors learned by Stable Diffusion and\nfine-tuning it on stereo image datasets to adapt it to the task of stereo\ngeneration. To improve stereo consistency and text-to-image alignment, we\nfurther tune the model using prompt alignment and our proposed stereo\nconsistency reward functions. Comprehensive experiments demonstrate the\nsuperiority of our approach in generating high-quality stereo images across\ndiverse scenarios, outperforming existing methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05449", "pdf": "https://arxiv.org/pdf/2506.05449", "abs": "https://arxiv.org/abs/2506.05449", "authors": ["Miguel Silva", "Alexandre Valle de Carvalho"], "title": "AI-powered Contextual 3D Environment Generation: A Systematic Review", "categories": ["cs.GR", "cs.CV", "cs.LG"], "comment": null, "summary": "The generation of high-quality 3D environments is crucial for industries such\nas gaming, virtual reality, and cinema, yet remains resource-intensive due to\nthe reliance on manual processes. This study performs a systematic review of\nexisting generative AI techniques for 3D scene generation, analyzing their\ncharacteristics, strengths, limitations, and potential for improvement. By\nexamining state-of-the-art approaches, it presents key challenges such as scene\nauthenticity and the influence of textual inputs. Special attention is given to\nhow AI can blend different stylistic domains while maintaining coherence, the\nimpact of training data on output quality, and the limitations of current\nmodels. In addition, this review surveys existing evaluation metrics for\nassessing realism and explores how industry professionals incorporate AI into\ntheir workflows. The findings of this study aim to provide a comprehensive\nunderstanding of the current landscape and serve as a foundation for future\nresearch on AI-driven 3D content generation. Key findings include that advanced\ngenerative architectures enable high-quality 3D content creation at a high\ncomputational cost, effective multi-modal integration techniques like\ncross-attention and latent space alignment facilitate text-to-3D tasks, and the\nquality and diversity of training data combined with comprehensive evaluation\nmetrics are critical to achieving scalable, robust 3D scene generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05386", "pdf": "https://arxiv.org/pdf/2506.05386", "abs": "https://arxiv.org/abs/2506.05386", "authors": ["Lo Pang-Yun Ting", "Chengshuai Zhao", "Yu-Hua Zeng", "Yuan Jee Lim", "Kun-Ta Chuang"], "title": "Beyond RAG: Reinforced Reasoning Augmented Generation for Clinical Notes", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "Clinical note generation aims to automatically produce free-text summaries of\na patient's condition and diagnostic process, with discharge instructions being\na representative long-form example. While recent large language model\n(LLM)-based methods pre-trained on general clinical corpora show promise in\nclinical text generation, they fall short in producing long-form notes from\nlimited patient information. In this paper, we propose R2AG, the first\nreinforced retriever for long-form discharge instruction generation based on\npre-admission data. R2AG is trained with reinforcement learning to retrieve\nreasoning paths from a medical knowledge graph, providing explicit semantic\nguidance to the LLM. To bridge the information gap, we propose Group-Based\nRetriever Optimization (GRO) which improves retrieval quality with\ngroup-relative rewards, encouraging reasoning leaps for deeper inference by the\nLLM. Comprehensive experiments on the MIMIC-IV-Note dataset show that R2AG\noutperforms baselines in both clinical efficacy and natural language generation\nmetrics. Further analysis reveals that R2AG fills semantic gaps in sparse input\nscenarios, and retrieved reasoning paths help LLMs avoid clinical\nmisinterpretation by focusing on key evidence and following coherent reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05387", "pdf": "https://arxiv.org/pdf/2506.05387", "abs": "https://arxiv.org/abs/2506.05387", "authors": ["Jaydip Sen", "Saptarshi Sengupta. Subhasis Dasgupta"], "title": "Advancing Decoding Strategies: Enhancements in Locally Typical Sampling for LLMs", "categories": ["cs.CL", "cs.AI"], "comment": "This is the accepted but pre-reviewed version of the chapter that has\n  been accepted for publication in the Springer volume 'Decision-Making in\n  Computational Intelligence-Based Systems,' edited by Witold Pedrycz, Gilberto\n  Rivera, Rose Ma Rodriguez, and Salvador Ibarra Martinez. The chapter is 39\n  pages long, and it contains 2 figures and 6 tables. This is NOT the final\n  camera-ready version", "summary": "This chapter explores advancements in decoding strategies for large language\nmodels (LLMs), focusing on enhancing the Locally Typical Sampling (LTS)\nalgorithm. Traditional decoding methods, such as top-k and nucleus sampling,\noften struggle to balance fluency, diversity, and coherence in text generation.\nTo address these challenges, Adaptive Semantic-Aware Typicality Sampling (ASTS)\nis proposed as an improved version of LTS, incorporating dynamic entropy\nthresholding, multi-objective scoring, and reward-penalty adjustments. ASTS\nensures contextually coherent and diverse text generation while maintaining\ncomputational efficiency. Its performance is evaluated across multiple\nbenchmarks, including story generation and abstractive summarization, using\nmetrics such as perplexity, MAUVE, and diversity scores. Experimental results\ndemonstrate that ASTS outperforms existing sampling techniques by reducing\nrepetition, enhancing semantic alignment, and improving fluency.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05375", "pdf": "https://arxiv.org/pdf/2506.05375", "abs": "https://arxiv.org/abs/2506.05375", "authors": ["Ashik E Rasul", "Hyung-Jin Yoon"], "title": "State Estimation and Control of Dynamic Systems from High-Dimensional Image Data", "categories": ["cs.CV"], "comment": null, "summary": "Accurate state estimation is critical for optimal policy design in dynamic\nsystems. However, obtaining true system states is often impractical or\ninfeasible, complicating the policy learning process. This paper introduces a\nnovel neural architecture that integrates spatial feature extraction using\nconvolutional neural networks (CNNs) and temporal modeling through gated\nrecurrent units (GRUs), enabling effective state representation from sequences\nof images and corresponding actions. These learned state representations are\nused to train a reinforcement learning agent with a Deep Q-Network (DQN).\nExperimental results demonstrate that our proposed approach enables real-time,\naccurate estimation and control without direct access to ground-truth states.\nAdditionally, we provide a quantitative evaluation methodology for assessing\nthe accuracy of the learned states, highlighting their impact on policy\nperformance and control stability.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05418", "pdf": "https://arxiv.org/pdf/2506.05418", "abs": "https://arxiv.org/abs/2506.05418", "authors": ["Kyungsoo Kim", "Jeongsoo Ha", "Yusung Kim"], "title": "Self-Predictive Dynamics for Generalization of Vision-based Reinforcement Learning", "categories": ["cs.CV", "cs.AI", "cs.LG"], "comment": "IJCAI 2022", "summary": "Vision-based reinforcement learning requires efficient and robust\nrepresentations of image-based observations, especially when the images contain\ndistracting (task-irrelevant) elements such as shadows, clouds, and light. It\nbecomes more important if those distractions are not exposed during training.\nWe design a Self-Predictive Dynamics (SPD) method to extract task-relevant\nfeatures efficiently, even in unseen observations after training. SPD uses weak\nand strong augmentations in parallel, and learns representations by predicting\ninverse and forward transitions across the two-way augmented versions. In a set\nof MuJoCo visual control tasks and an autonomous driving task (CARLA), SPD\noutperforms previous studies in complex observations, and significantly\nimproves the generalization performance for unseen observations. Our code is\navailable at https://github.com/unigary/SPD.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05419", "pdf": "https://arxiv.org/pdf/2506.05419", "abs": "https://arxiv.org/abs/2506.05419", "authors": ["Jeongsoo Ha", "Kyungsoo Kim", "Yusung Kim"], "title": "Dream to Generalize: Zero-Shot Model-Based Reinforcement Learning for Unseen Visual Distractions", "categories": ["cs.CV", "cs.AI"], "comment": "AAAI 2023", "summary": "Model-based reinforcement learning (MBRL) has been used to efficiently solve\nvision-based control tasks in highdimensional image observations. Although\nrecent MBRL algorithms perform well in trained observations, they fail when\nfaced with visual distractions in observations. These task-irrelevant\ndistractions (e.g., clouds, shadows, and light) may be constantly present in\nreal-world scenarios. In this study, we propose a novel self-supervised method,\nDream to Generalize (Dr. G), for zero-shot MBRL. Dr. G trains its encoder and\nworld model with dual contrastive learning which efficiently captures\ntask-relevant features among multi-view data augmentations. We also introduce a\nrecurrent state inverse dynamics model that helps the world model to better\nunderstand the temporal structure. The proposed methods can enhance the\nrobustness of the world model against visual distractions. To evaluate the\ngeneralization performance, we first train Dr. G on simple backgrounds and then\ntest it on complex natural video backgrounds in the DeepMind Control suite, and\nthe randomizing environments in Robosuite. Dr. G yields a performance\nimprovement of 117% and 14% over prior works, respectively. Our code is\nopen-sourced and available at https://github.com/JeongsooHa/DrG.git", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05670", "pdf": "https://arxiv.org/pdf/2506.05670", "abs": "https://arxiv.org/abs/2506.05670", "authors": ["Priyanka Dey", "Yugal Khanter", "Aayush Bothra", "Jieyu Zhao", "Emilio Ferrara"], "title": "Can LLMs Express Personality Across Cultures? Introducing CulturalPersonas for Evaluating Trait Alignment", "categories": ["cs.CL"], "comment": null, "summary": "As LLMs become central to interactive applications, ranging from tutoring to\nmental health, the ability to express personality in culturally appropriate\nways is increasingly important. While recent works have explored personality\nevaluation of LLMs, they largely overlook the interplay between culture and\npersonality. To address this, we introduce CulturalPersonas, the first\nlarge-scale benchmark with human validation for evaluating LLMs' personality\nexpression in culturally grounded, behaviorally rich contexts. Our dataset\nspans 3,000 scenario-based questions across six diverse countries, designed to\nelicit personality through everyday scenarios rooted in local values. We\nevaluate three LLMs, using both multiple-choice and open-ended response\nformats. Our results show that CulturalPersonas improves alignment with\ncountry-specific human personality distributions (over a 20% reduction in\nWasserstein distance across models and countries) and elicits more expressive,\nculturally coherent outputs compared to existing benchmarks. CulturalPersonas\nsurfaces meaningful modulated trait outputs in response to culturally grounded\nprompts, offering new directions for aligning LLMs to global norms of behavior.\nBy bridging personality expression and cultural nuance, we envision that\nCulturalPersonas will pave the way for more socially intelligent and globally\nadaptive LLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05431", "pdf": "https://arxiv.org/pdf/2506.05431", "abs": "https://arxiv.org/abs/2506.05431", "authors": ["Ashwin Ramesh Babu", "Sajad Mousavi", "Vineet Gundecha", "Sahand Ghorbanpour", "Avisek Naug", "Antonio Guillen", "Ricardo Luna Gutierrez", "Soumyendu Sarkar"], "title": "Robustness Evaluation for Video Models with Reinforcement Learning", "categories": ["cs.CV", "cs.AI", "cs.LG"], "comment": "Accepted at the IEEE/CVF Conference on Computer Vision and Pattern\n  Recognition Workshops (CVPRW) 2025", "summary": "Evaluating the robustness of Video classification models is very challenging,\nspecifically when compared to image-based models. With their increased temporal\ndimension, there is a significant increase in complexity and computational\ncost. One of the key challenges is to keep the perturbations to a minimum to\ninduce misclassification. In this work, we propose a multi-agent reinforcement\nlearning approach (spatial and temporal) that cooperatively learns to identify\nthe given video's sensitive spatial and temporal regions. The agents consider\ntemporal coherence in generating fine perturbations, leading to a more\neffective and visually imperceptible attack. Our method outperforms the\nstate-of-the-art solutions on the Lp metric and the average queries. Our method\nenables custom distortion types, making the robustness evaluation more relevant\nto the use case. We extensively evaluate 4 popular models for video action\nrecognition on two popular datasets, HMDB-51 and UCF-101.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dimension"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05533", "pdf": "https://arxiv.org/pdf/2506.05533", "abs": "https://arxiv.org/abs/2506.05533", "authors": ["Tomasz Michalski", "Adam Wróbel", "Andrea Bontempelli", "Jakub Luśtyk", "Mikolaj Kniejski", "Stefano Teso", "Andrea Passerini", "Bartosz Zieliński", "Dawid Rymarczyk"], "title": "Personalized Interpretability -- Interactive Alignment of Prototypical Parts Networks", "categories": ["cs.CV", "cs.HC"], "comment": "20 pages, 11 figures", "summary": "Concept-based interpretable neural networks have gained significant attention\ndue to their intuitive and easy-to-understand explanations based on case-based\nreasoning, such as \"this bird looks like those sparrows\". However, a major\nlimitation is that these explanations may not always be comprehensible to users\ndue to concept inconsistency, where multiple visual features are\ninappropriately mixed (e.g., a bird's head and wings treated as a single\nconcept). This inconsistency breaks the alignment between model reasoning and\nhuman understanding. Furthermore, users have specific preferences for how\nconcepts should look, yet current approaches provide no mechanism for\nincorporating their feedback. To address these issues, we introduce\nYoursProtoP, a novel interactive strategy that enables the personalization of\nprototypical parts - the visual concepts used by the model - according to user\nneeds. By incorporating user supervision, YoursProtoP adapts and splits\nconcepts used for both prediction and explanation to better match the user's\npreferences and understanding. Through experiments on both the synthetic\nFunnyBirds dataset and a real-world scenario using the CUB, CARS, and PETS\ndatasets in a comprehensive user study, we demonstrate the effectiveness of\nYoursProtoP in achieving concept consistency without compromising the accuracy\nof the model.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "accuracy"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05660", "pdf": "https://arxiv.org/pdf/2506.05660", "abs": "https://arxiv.org/abs/2506.05660", "authors": ["Markian Mandzak", "Elvira Yang", "Anna Zapaishchykova", "Yu-Hui Chen", "Lucas Heilbroner", "John Zielke", "Divyanshu Tak", "Reza Mojahed-Yazdi", "Francesca Romana Mussa", "Zezhong Ye", "Sridhar Vajapeyam", "Viviana Benitez", "Ralph Salloum", "Susan N. Chi", "Houman Sotoudeh", "Jakob Seidlitz", "Sabine Mueller", "Hugo J. W. L. Aerts", "Tina Y. Poussaint", "Benjamin H. Kann"], "title": "TissUnet: Improved Extracranial Tissue and Cranium Segmentation for Children through Adulthood", "categories": ["cs.CV", "cs.AI"], "comment": "44 pages, 4 tables, 6 figures, supplementary material", "summary": "Extracranial tissues visible on brain magnetic resonance imaging (MRI) may\nhold significant value for characterizing health conditions and clinical\ndecision-making, yet they are rarely quantified. Current tools have not been\nwidely validated, particularly in settings of developing brains or underlying\npathology. We present TissUnet, a deep learning model that segments skull bone,\nsubcutaneous fat, and muscle from routine three-dimensional T1-weighted MRI,\nwith or without contrast enhancement. The model was trained on 155 paired\nMRI-computed tomography (CT) scans and validated across nine datasets covering\na wide age range and including individuals with brain tumors. In comparison to\nAI-CT-derived labels from 37 MRI-CT pairs, TissUnet achieved a median Dice\ncoefficient of 0.79 [IQR: 0.77-0.81] in a healthy adult cohort. In a second\nvalidation using expert manual annotations, median Dice was 0.83 [IQR:\n0.83-0.84] in healthy individuals and 0.81 [IQR: 0.78-0.83] in tumor cases,\noutperforming previous state-of-the-art method. Acceptability testing resulted\nin an 89% acceptance rate after adjudication by a tie-breaker(N=108 MRIs), and\nTissUnet demonstrated excellent performance in the blinded comparative review\n(N=45 MRIs), including both healthy and tumor cases in pediatric populations.\nTissUnet enables fast, accurate, and reproducible segmentation of extracranial\ntissues, supporting large-scale studies on craniofacial morphology, treatment\neffects, and cardiometabolic risk using standard brain T1w MRI.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05696", "pdf": "https://arxiv.org/pdf/2506.05696", "abs": "https://arxiv.org/abs/2506.05696", "authors": ["Ana Carolina Condez", "Diogo Tavares", "João Magalhães"], "title": "MoralCLIP: Contrastive Alignment of Vision-and-Language Representations with Moral Foundations Theory", "categories": ["cs.CV"], "comment": null, "summary": "Recent advances in vision-language models have enabled rich semantic\nunderstanding across modalities. However, these encoding methods lack the\nability to interpret or reason about the moral dimensions of content-a crucial\naspect of human cognition. In this paper, we address this gap by introducing\nMoralCLIP, a novel embedding representation method that extends multimodal\nlearning with explicit moral grounding based on Moral Foundations Theory (MFT).\nOur approach integrates visual and textual moral cues into a unified embedding\nspace, enabling cross-modal moral alignment. MoralCLIP is grounded on the\nmulti-label dataset Social-Moral Image Database to identify co-occurring moral\nfoundations in visual content. For MoralCLIP training, we design a moral data\naugmentation strategy to scale our annotated dataset to 15,000 image-text pairs\nlabeled with MFT-aligned dimensions. Our results demonstrate that explicit\nmoral supervision improves both unimodal and multimodal understanding of moral\ncontent, establishing a foundation for morally-aware AI systems capable of\nrecognizing and aligning with human moral values.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06113", "pdf": "https://arxiv.org/pdf/2506.06113", "abs": "https://arxiv.org/abs/2506.06113", "authors": ["Benedetta Muscato", "Yue Li", "Gizem Gezici", "Zhixue Zhao", "Fosca Giannotti"], "title": "Bridging the Gap: In-Context Learning for Modeling Human Disagreement", "categories": ["cs.CL"], "comment": null, "summary": "Large Language Models (LLMs) have shown strong performance on NLP\nclassification tasks. However, they typically rely on aggregated labels-often\nvia majority voting-which can obscure the human disagreement inherent in\nsubjective annotations. This study examines whether LLMs can capture multiple\nperspectives and reflect annotator disagreement in subjective tasks such as\nhate speech and offensive language detection. We use in-context learning (ICL)\nin zero-shot and few-shot settings, evaluating four open-source LLMs across\nthree label modeling strategies: aggregated hard labels, and disaggregated hard\nand soft labels. In few-shot prompting, we assess demonstration selection\nmethods based on textual similarity (BM25, PLM-based), annotation disagreement\n(entropy), a combined ranking, and example ordering strategies (random vs.\ncurriculum-based). Results show that multi-perspective generation is viable in\nzero-shot settings, while few-shot setups often fail to capture the full\nspectrum of human judgments. Prompt design and demonstration selection notably\naffect performance, though example ordering has limited impact. These findings\nhighlight the challenges of modeling subjectivity with LLMs and the importance\nof building more perspective-aware, socially intelligent models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06175", "pdf": "https://arxiv.org/pdf/2506.06175", "abs": "https://arxiv.org/abs/2506.06175", "authors": ["James Ford", "Anthony Rios"], "title": "Does It Run and Is That Enough? Revisiting Text-to-Chart Generation with a Multi-Agent Approach", "categories": ["cs.CL"], "comment": "8 pages", "summary": "Large language models can translate natural-language chart descriptions into\nrunnable code, yet approximately 15\\% of the generated scripts still fail to\nexecute, even after supervised fine-tuning and reinforcement learning. We\ninvestigate whether this persistent error rate stems from model limitations or\nfrom reliance on a single-prompt design. To explore this, we propose a\nlightweight multi-agent pipeline that separates drafting, execution, repair,\nand judgment, using only an off-the-shelf GPT-4o-mini model. On the\n\\textsc{Text2Chart31} benchmark, our system reduces execution errors to 4.5\\%\nwithin three repair iterations, outperforming the strongest fine-tuned baseline\nby nearly 5 percentage points while requiring significantly less compute.\nSimilar performance is observed on the \\textsc{ChartX} benchmark, with an error\nrate of 4.6\\%, demonstrating strong generalization. Under current benchmarks,\nexecution success appears largely solved. However, manual review reveals that 6\nout of 100 sampled charts contain hallucinations, and an LLM-based\naccessibility audit shows that only 33.3\\% (\\textsc{Text2Chart31}) and 7.2\\%\n(\\textsc{ChartX}) of generated charts satisfy basic colorblindness guidelines.\nThese findings suggest that future work should shift focus from execution\nreliability toward improving chart aesthetics, semantic fidelity, and\naccessibility.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "reliability"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05856", "pdf": "https://arxiv.org/pdf/2506.05856", "abs": "https://arxiv.org/abs/2506.05856", "authors": ["Yuqian Fu", "Runze Wang", "Yanwei Fu", "Danda Pani Paudel", "Luc Van Gool"], "title": "Cross-View Multi-Modal Segmentation @ Ego-Exo4D Challenges 2025", "categories": ["cs.CV", "cs.AI"], "comment": "The 2nd Price Award of EgoExo4D Relations, Second Joint EgoVis\n  Workshop with CVPR2025, technical report paper is accepted by CVPRW 25", "summary": "In this report, we present a cross-view multi-modal object segmentation\napproach for the object correspondence task in the Ego-Exo4D Correspondence\nChallenges 2025. Given object queries from one perspective (e.g., ego view),\nthe goal is to predict the corresponding object masks in another perspective\n(e.g., exo view). To tackle this task, we propose a multimodal condition fusion\nmodule that enhances object localization by leveraging both visual masks and\ntextual descriptions as segmentation conditions. Furthermore, to address the\nvisual domain gap between ego and exo views, we introduce a cross-view object\nalignment module that enforces object-level consistency across perspectives,\nthereby improving the model's robustness to viewpoint changes. Our proposed\nmethod ranked second on the leaderboard of the large-scale Ego-Exo4D object\ncorrespondence benchmark. Code will be made available at\nhttps://github.com/lovelyqian/ObjectRelator.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05858", "pdf": "https://arxiv.org/pdf/2506.05858", "abs": "https://arxiv.org/abs/2506.05858", "authors": ["Jinjuan Wang", "Wenzhang Sun", "Ming Li", "Yun Zheng", "Fanyao Li", "Zhulin Tao", "Donglin Di", "Hao Li", "Wei Chen", "Xianglin Huang"], "title": "ChronoTailor: Harnessing Attention Guidance for Fine-Grained Video Virtual Try-On", "categories": ["cs.CV"], "comment": null, "summary": "Video virtual try-on aims to seamlessly replace the clothing of a person in a\nsource video with a target garment. Despite significant progress in this field,\nexisting approaches still struggle to maintain continuity and reproduce garment\ndetails. In this paper, we introduce ChronoTailor, a diffusion-based framework\nthat generates temporally consistent videos while preserving fine-grained\ngarment details. By employing a precise spatio-temporal attention mechanism to\nguide the integration of fine-grained garment features, ChronoTailor achieves\nrobust try-on performance. First, ChronoTailor leverages region-aware spatial\nguidance to steer the evolution of spatial attention and employs an\nattention-driven temporal feature fusion mechanism to generate more continuous\ntemporal features. This dual approach not only enables fine-grained local\nediting but also effectively mitigates artifacts arising from video dynamics.\nSecond, ChronoTailor integrates multi-scale garment features to preserve\nlow-level visual details and incorporates a garment-pose feature alignment to\nensure temporal continuity during dynamic motion. Additionally, we collect\nStyleDress, a new dataset featuring intricate garments, varied environments,\nand diverse poses, offering advantages over existing public datasets, and will\nbe publicly available for research. Extensive experiments show that\nChronoTailor maintains spatio-temporal continuity and preserves garment details\nduring motion, significantly outperforming previous methods.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05872", "pdf": "https://arxiv.org/pdf/2506.05872", "abs": "https://arxiv.org/abs/2506.05872", "authors": ["Yu Li", "Xingyu Qiu", "Yuqian Fu", "Jie Chen", "Tianwen Qian", "Xu Zheng", "Danda Pani Paudel", "Yanwei Fu", "Xuanjing Huang", "Luc Van Gool", "Yu-Gang Jiang"], "title": "Domain-RAG: Retrieval-Guided Compositional Image Generation for Cross-Domain Few-Shot Object Detection", "categories": ["cs.CV"], "comment": null, "summary": "Cross-Domain Few-Shot Object Detection (CD-FSOD) aims to detect novel objects\nwith only a handful of labeled samples from previously unseen domains. While\ndata augmentation and generative methods have shown promise in few-shot\nlearning, their effectiveness for CD-FSOD remains unclear due to the need for\nboth visual realism and domain alignment. Existing strategies, such as\ncopy-paste augmentation and text-to-image generation, often fail to preserve\nthe correct object category or produce backgrounds coherent with the target\ndomain, making them non-trivial to apply directly to CD-FSOD. To address these\nchallenges, we propose Domain-RAG, a training-free, retrieval-guided\ncompositional image generation framework tailored for CD-FSOD. Domain-RAG\nconsists of three stages: domain-aware background retrieval, domain-guided\nbackground generation, and foreground-background composition. Specifically, the\ninput image is first decomposed into foreground and background regions. We then\nretrieve semantically and stylistically similar images to guide a generative\nmodel in synthesizing a new background, conditioned on both the original and\nretrieved contexts. Finally, the preserved foreground is composed with the\nnewly generated domain-aligned background to form the generated image. Without\nrequiring any additional supervision or training, Domain-RAG produces\nhigh-quality, domain-consistent samples across diverse tasks, including\nCD-FSOD, remote sensing FSOD, and camouflaged FSOD. Extensive experiments show\nconsistent improvements over strong baselines and establish new\nstate-of-the-art results. Codes will be released upon acceptance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05934", "pdf": "https://arxiv.org/pdf/2506.05934", "abs": "https://arxiv.org/abs/2506.05934", "authors": ["Yixuan Zhu", "Haolin Wang", "Shilin Ma", "Wenliang Zhao", "Yansong Tang", "Lei Chen", "Jie Zhou"], "title": "FADE: Frequency-Aware Diffusion Model Factorization for Video Editing", "categories": ["cs.CV", "cs.AI"], "comment": "Accepted by IEEE/CVF Conference on Computer Vision and Pattern\n  Recognition (CVPR) 2025", "summary": "Recent advancements in diffusion frameworks have significantly enhanced video\nediting, achieving high fidelity and strong alignment with textual prompts.\nHowever, conventional approaches using image diffusion models fall short in\nhandling video dynamics, particularly for challenging temporal edits like\nmotion adjustments. While current video diffusion models produce high-quality\nresults, adapting them for efficient editing remains difficult due to the heavy\ncomputational demands that prevent the direct application of previous image\nediting techniques. To overcome these limitations, we introduce FADE, a\ntraining-free yet highly effective video editing approach that fully leverages\nthe inherent priors from pre-trained video diffusion models via frequency-aware\nfactorization. Rather than simply using these models, we first analyze the\nattention patterns within the video model to reveal how video priors are\ndistributed across different components. Building on these insights, we propose\na factorization strategy to optimize each component's specialized role.\nFurthermore, we devise spectrum-guided modulation to refine the sampling\ntrajectory with frequency domain cues, preventing information leakage and\nsupporting efficient, versatile edits while preserving the basic spatial and\ntemporal structure. Extensive experiments on real-world videos demonstrate that\nour method consistently delivers high-quality, realistic and temporally\ncoherent editing results both qualitatively and quantitatively. Code is\navailable at https://github.com/EternalEvan/FADE .", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05952", "pdf": "https://arxiv.org/pdf/2506.05952", "abs": "https://arxiv.org/abs/2506.05952", "authors": ["Dongjie Fu", "Tengjiao Sun", "Pengcheng Fang", "Xiaohao Cai", "Hansung Kim"], "title": "MOGO: Residual Quantized Hierarchical Causal Transformer for High-Quality and Real-Time 3D Human Motion Generation", "categories": ["cs.CV", "cs.AI"], "comment": "9 pages, 4 figures, conference", "summary": "Recent advances in transformer-based text-to-motion generation have led to\nimpressive progress in synthesizing high-quality human motion. Nevertheless,\njointly achieving high fidelity, streaming capability, real-time\nresponsiveness, and scalability remains a fundamental challenge. In this paper,\nwe propose MOGO (Motion Generation with One-pass), a novel autoregressive\nframework tailored for efficient and real-time 3D motion generation. MOGO\ncomprises two key components: (1) MoSA-VQ, a motion scale-adaptive residual\nvector quantization module that hierarchically discretizes motion sequences\nwith learnable scaling to produce compact yet expressive representations; and\n(2) RQHC-Transformer, a residual quantized hierarchical causal transformer that\ngenerates multi-layer motion tokens in a single forward pass, significantly\nreducing inference latency. To enhance semantic fidelity, we further introduce\na text condition alignment mechanism that improves motion decoding under\ntextual control. Extensive experiments on benchmark datasets including\nHumanML3D, KIT-ML, and CMP demonstrate that MOGO achieves competitive or\nsuperior generation quality compared to state-of-the-art transformer-based\nmethods, while offering substantial improvements in real-time performance,\nstreaming generation, and generalization under zero-shot settings.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling", "scale"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05623", "pdf": "https://arxiv.org/pdf/2506.05623", "abs": "https://arxiv.org/abs/2506.05623", "authors": ["Tianyi Zhang", "Shidong Pan", "Zejun Zhang", "Zhenchang Xing", "Xiaoyu Sun"], "title": "Deployability-Centric Infrastructure-as-Code Generation: An LLM-based Iterative Framework", "categories": ["cs.SE", "cs.AI", "cs.CL"], "comment": null, "summary": "Infrastructure-as-Code (IaC) generation holds significant promise for\nautomating cloud infrastructure provisioning. Recent advances in Large Language\nModels (LLMs) present a promising opportunity to democratize IaC development by\ngenerating deployable infrastructure templates from natural language\ndescriptions, but current evaluation focuses on syntactic correctness while\nignoring deployability, the fatal measure of IaC template utility. We address\nthis gap through two contributions: (1) IaCGen, an LLM-based\ndeployability-centric framework that uses iterative feedback mechanism to\ngenerate IaC templates, and (2) DPIaC-Eval, a deployability-centric IaC\ntemplate benchmark consists of 153 real-world scenarios that can evaluate\nsyntax, deployment, user intent, and security. Our evaluation reveals that\nstate-of-the-art LLMs initially performed poorly, with Claude-3.5 and\nClaude-3.7 achieving only 30.2% and 26.8% deployment success on the first\nattempt respectively. However, IaCGen transforms this performance dramatically:\nall evaluated models reach over 90% passItr@25, with Claude-3.5 and Claude-3.7\nachieving 98% success rate. Despite these improvements, critical challenges\nremain in user intent alignment (25.2% accuracy) and security compliance (8.4%\npass rate), highlighting areas requiring continued research. Our work provides\nthe first comprehensive assessment of deployability-centric IaC template\ngeneration and establishes a foundation for future research.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "accuracy", "code generation"], "score": 4}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05671", "pdf": "https://arxiv.org/pdf/2506.05671", "abs": "https://arxiv.org/abs/2506.05671", "authors": ["Yangui Fang", "Jing Peng", "Xu Li", "Yu Xi", "Chengwei Zhang", "Guohui Zhong", "Kai Yu"], "title": "Low-Resource Domain Adaptation for Speech LLMs via Text-Only Fine-Tuning", "categories": ["eess.AS", "cs.CL"], "comment": null, "summary": "Recent advances in automatic speech recognition (ASR) have combined speech\nencoders with large language models (LLMs) through projection, forming Speech\nLLMs with strong performance. However, adapting them to new domains remains\nchallenging, especially in low-resource settings where paired speech-text data\nis scarce. We propose a text-only fine-tuning strategy for Speech LLMs using\nunpaired target-domain text without requiring additional audio. To preserve\nspeech-text alignment, we introduce a real-time evaluation mechanism during\nfine-tuning. This enables effective domain adaptation while maintaining\nsource-domain performance. Experiments on LibriSpeech, SlideSpeech, and Medical\ndatasets show that our method achieves competitive recognition performance,\nwith minimal degradation compared to full audio-text fine-tuning. It also\nimproves generalization to new domains without catastrophic forgetting,\nhighlighting the potential of text-only fine-tuning for low-resource domain\nadaptation of ASR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06041", "pdf": "https://arxiv.org/pdf/2506.06041", "abs": "https://arxiv.org/abs/2506.06041", "authors": ["Joscha Diehl", "Rasheed Ibraheem", "Leonard Schmitz", "Yue Wu"], "title": "Tensor-to-Tensor Models with Fast Iterated Sum Features", "categories": ["cs.CV", "cs.LG"], "comment": null, "summary": "Data in the form of images or higher-order tensors is ubiquitous in modern\ndeep learning applications. Owing to their inherent high dimensionality, the\nneed for subquadratic layers processing such data is even more pressing than\nfor sequence data. We propose a novel tensor-to-tensor layer with linear cost\nin the input size, utilizing the mathematical gadget of ``corner trees'' from\nthe field of permutation counting. In particular, for order-two tensors, we\nprovide an image-to-image layer that can be plugged into image processing\npipelines. On the one hand, our method can be seen as a higher-order\ngeneralization of state-space models. On the other hand, it is based on a\nmultiparameter generalization of the signature of iterated integrals (or sums).\nThe proposed tensor-to-tensor concept is used to build a neural network layer\ncalled the Fast Iterated Sums (FIS) layer which integrates seamlessly with\nother layer types. We demonstrate the usability of the FIS layer with both\nclassification and anomaly detection tasks. By replacing some layers of a\nsmaller ResNet architecture with FIS, a similar accuracy (with a difference of\nonly 0.1\\%) was achieved in comparison to a larger ResNet while reducing the\nnumber of trainable parameters and multi-add operations. The FIS layer was also\nused to build an anomaly detection model that achieved an average AUROC of\n97.3\\% on the texture images of the popular MVTec AD dataset. The processing\nand modelling codes are publicly available at\nhttps://github.com/diehlj/fast-iterated-sums.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05817", "pdf": "https://arxiv.org/pdf/2506.05817", "abs": "https://arxiv.org/abs/2506.05817", "authors": ["Zihan Wang", "Siyao Liu", "Yang Sun", "Hongyan Li", "Kai Shen"], "title": "CodeContests+: High-Quality Test Case Generation for Competitive Programming", "categories": ["cs.SE", "cs.CL"], "comment": "28 pages, 7 figures", "summary": "Competitive programming, due to its high reasoning difficulty and precise\ncorrectness feedback, has become a key task for both training and evaluating\nthe reasoning capabilities of large language models (LLMs). However, while a\nlarge amount of public problem data, such as problem statements and solutions,\nis available, the test cases of these problems are often difficult to obtain.\nTherefore, test case generation is a necessary task for building large-scale\ndatasets, and the quality of the test cases directly determines the accuracy of\nthe evaluation. In this paper, we introduce an LLM-based agent system that\ncreates high-quality test cases for competitive programming problems. We apply\nthis system to the CodeContests dataset and propose a new version with improved\ntest cases, named CodeContests+. We evaluated the quality of test cases in\nCodeContestsPlus. First, we used 1.72 million submissions with pass/fail labels\nto examine the accuracy of these test cases in evaluation. The results\nindicated that CodeContests+ achieves significantly higher accuracy than\nCodeContests, particularly with a notably higher True Positive Rate (TPR).\nSubsequently, our experiments in LLM Reinforcement Learning (RL) further\nconfirmed that improvements in test case quality yield considerable advantages\nfor RL.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.06166", "pdf": "https://arxiv.org/pdf/2506.06166", "abs": "https://arxiv.org/abs/2506.06166", "authors": ["Tianyi Alex Qiu", "Zhonghao He", "Tejasveer Chugh", "Max Kleiman-Weiner"], "title": "The Lock-in Hypothesis: Stagnation by Algorithm", "categories": ["cs.LG", "cs.AI", "cs.CL", "cs.CY", "cs.HC"], "comment": "ICML 2025, 46 pages", "summary": "The training and deployment of large language models (LLMs) create a feedback\nloop with human users: models learn human beliefs from data, reinforce these\nbeliefs with generated content, reabsorb the reinforced beliefs, and feed them\nback to users again and again. This dynamic resembles an echo chamber. We\nhypothesize that this feedback loop entrenches the existing values and beliefs\nof users, leading to a loss of diversity and potentially the lock-in of false\nbeliefs. We formalize this hypothesis and test it empirically with agent-based\nLLM simulations and real-world GPT usage data. Analysis reveals sudden but\nsustained drops in diversity after the release of new GPT iterations,\nconsistent with the hypothesized human-AI feedback loop. Code and data\navailable at https://thelockinhypothesis.com", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["AI feedback"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05449", "pdf": "https://arxiv.org/pdf/2506.05449", "abs": "https://arxiv.org/abs/2506.05449", "authors": ["Miguel Silva", "Alexandre Valle de Carvalho"], "title": "AI-powered Contextual 3D Environment Generation: A Systematic Review", "categories": ["cs.GR", "cs.CV", "cs.LG"], "comment": null, "summary": "The generation of high-quality 3D environments is crucial for industries such\nas gaming, virtual reality, and cinema, yet remains resource-intensive due to\nthe reliance on manual processes. This study performs a systematic review of\nexisting generative AI techniques for 3D scene generation, analyzing their\ncharacteristics, strengths, limitations, and potential for improvement. By\nexamining state-of-the-art approaches, it presents key challenges such as scene\nauthenticity and the influence of textual inputs. Special attention is given to\nhow AI can blend different stylistic domains while maintaining coherence, the\nimpact of training data on output quality, and the limitations of current\nmodels. In addition, this review surveys existing evaluation metrics for\nassessing realism and explores how industry professionals incorporate AI into\ntheir workflows. The findings of this study aim to provide a comprehensive\nunderstanding of the current landscape and serve as a foundation for future\nresearch on AI-driven 3D content generation. Key findings include that advanced\ngenerative architectures enable high-quality 3D content creation at a high\ncomputational cost, effective multi-modal integration techniques like\ncross-attention and latent space alignment facilitate text-to-3D tasks, and the\nquality and diversity of training data combined with comprehensive evaluation\nmetrics are critical to achieving scalable, robust 3D scene generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
{"id": "2506.05679", "pdf": "https://arxiv.org/pdf/2506.05679", "abs": "https://arxiv.org/abs/2506.05679", "authors": ["Binghao Ye", "Wenjuan Li", "Dong Wang", "Man Yao", "Bing Li", "Weiming Hu", "Dong Liang", "Kun Shang"], "title": "Integer Binary-Range Alignment Neuron for Spiking Neural Networks", "categories": ["cs.NE", "cs.CV"], "comment": "11 pages", "summary": "Spiking Neural Networks (SNNs) are noted for their brain-like computation and\nenergy efficiency, but their performance lags behind Artificial Neural Networks\n(ANNs) in tasks like image classification and object detection due to the\nlimited representational capacity. To address this, we propose a novel spiking\nneuron, Integer Binary-Range Alignment Leaky Integrate-and-Fire to\nexponentially expand the information expression capacity of spiking neurons\nwith only a slight energy increase. This is achieved through Integer Binary\nLeaky Integrate-and-Fire and range alignment strategy. The Integer Binary Leaky\nIntegrate-and-Fire allows integer value activation during training and\nmaintains spike-driven dynamics with binary conversion expands virtual\ntimesteps during inference. The range alignment strategy is designed to solve\nthe spike activation limitation problem where neurons fail to activate high\ninteger values. Experiments show our method outperforms previous SNNs,\nachieving 74.19% accuracy on ImageNet and 66.2% mAP@50 and 49.1% mAP@50:95 on\nCOCO, surpassing previous bests with the same architecture by +3.45% and +1.6%\nand +1.8%, respectively. Notably, our SNNs match or exceed ANNs' performance\nwith the same architecture, and the energy efficiency is improved by\n6.3${\\times}$.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-09.jsonl"}
