{"id": "2506.11702", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11702", "abs": "https://arxiv.org/abs/2506.11702", "authors": ["Víctor Gallego"], "title": "Configurable Preference Tuning with Rubric-Guided Synthetic Data", "comment": "Accepted to ICML 2025 Workshop on Models of Human Feedback for AI\n  Alignment", "summary": "Models of human feedback for AI alignment, such as those underpinning Direct\nPreference Optimization (DPO), often bake in a singular, static set of\npreferences, limiting adaptability. This paper challenges the assumption of\nmonolithic preferences by introducing Configurable Preference Tuning (CPT), a\nnovel framework for endowing language models with the ability to dynamically\nadjust their behavior based on explicit, human-interpretable directives. CPT\nleverages synthetically generated preference data, conditioned on system\nprompts derived from structured, fine-grained rubrics that define desired\nattributes like writing style. By fine-tuning with these rubric-guided\npreferences, the LLM learns to modulate its outputs at inference time in\nresponse to the system prompt, without retraining. This approach not only\noffers fine-grained control but also provides a mechanism for modeling more\nnuanced and context-dependent human feedback. Several experimental artifacts,\nsuch as training code, generated datasets and fine-tuned models are released at\nhttps://github.com/vicgalle/configurable-preference-tuning", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["human feedback", "preference", "alignment", "DPO"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained", "rubric"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11430", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11430", "abs": "https://arxiv.org/abs/2506.11430", "authors": ["Jingfeng Guo", "Jian Liu", "Jinnan Chen", "Shiwei Mao", "Changrong Hu", "Puhua Jiang", "Junlin Yu", "Jing Xu", "Qi Liu", "Lixin Xu", "Zhuo Chen", "Chunchao Guo"], "title": "Auto-Connect: Connectivity-Preserving RigFormer with Direct Preference Optimization", "comment": null, "summary": "We introduce Auto-Connect, a novel approach for automatic rigging that\nexplicitly preserves skeletal connectivity through a connectivity-preserving\ntokenization scheme. Unlike previous methods that predict bone positions\nrepresented as two joints or first predict points before determining\nconnectivity, our method employs special tokens to define endpoints for each\njoint's children and for each hierarchical layer, effectively automating\nconnectivity relationships. This approach significantly enhances topological\naccuracy by integrating connectivity information directly into the prediction\nframework. To further guarantee high-quality topology, we implement a\ntopology-aware reward function that quantifies topological correctness, which\nis then utilized in a post-training phase through reward-guided Direct\nPreference Optimization. Additionally, we incorporate implicit geodesic\nfeatures for latent top-k bone selection, which substantially improves skinning\nquality. By leveraging geodesic distance information within the model's latent\nspace, our approach intelligently determines the most influential bones for\neach vertex, effectively mitigating common skinning artifacts. This combination\nof connectivity-preserving tokenization, reward-guided fine-tuning, and\ngeodesic-aware bone selection enables our model to consistently generate more\nanatomically plausible skeletal structures with superior deformation\nproperties.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "preference", "direct preference optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11144", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11144", "abs": "https://arxiv.org/abs/2506.11144", "authors": ["Chao Liang", "Jianwen Jiang", "Wang Liao", "Jiaqi Yang", "Zerong zheng", "Weihong Zeng", "Han Liang"], "title": "AlignHuman: Improving Motion and Fidelity via Timestep-Segment Preference Optimization for Audio-Driven Human Animation", "comment": "Homepage: https://alignhuman.github.io/", "summary": "Recent advancements in human video generation and animation tasks, driven by\ndiffusion models, have achieved significant progress. However, expressive and\nrealistic human animation remains challenging due to the trade-off between\nmotion naturalness and visual fidelity. To address this, we propose\n\\textbf{AlignHuman}, a framework that combines Preference Optimization as a\npost-training technique with a divide-and-conquer training strategy to jointly\noptimize these competing objectives. Our key insight stems from an analysis of\nthe denoising process across timesteps: (1) early denoising timesteps primarily\ncontrol motion dynamics, while (2) fidelity and human structure can be\neffectively managed by later timesteps, even if early steps are skipped.\nBuilding on this observation, we propose timestep-segment preference\noptimization (TPO) and introduce two specialized LoRAs as expert alignment\nmodules, each targeting a specific dimension in its corresponding timestep\ninterval. The LoRAs are trained using their respective preference data and\nactivated in the corresponding intervals during inference to enhance motion\nnaturalness and fidelity. Extensive experiments demonstrate that AlignHuman\nimproves strong baselines and reduces NFEs during inference, achieving a\n3.3$\\times$ speedup (from 100 NFEs to 30 NFEs) with minimal impact on\ngeneration quality. Homepage:\n\\href{https://alignhuman.github.io/}{https://alignhuman.github.io/}", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dimension"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11081", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11081", "abs": "https://arxiv.org/abs/2506.11081", "authors": ["Aditi", "Hyunwoo Park", "Sicheol Sung", "Yo-Sub Han", "Sang-Ki Ko"], "title": "SAGE:Specification-Aware Grammar Extraction for Automated Test Case Generation with LLMs", "comment": null, "summary": "Grammar-based test case generation has proven effective for competitive\nprogramming problems, but generating valid and general grammars from natural\nlanguage specifications remains a key challenge, especially under limited\nsupervision. Context-Free Grammars with Counters (CCFGs) have recently been\nintroduced as a formalism to represent such specifications with logical\nconstraints by storing and reusing counter values during derivation. In this\nwork, we explore the use of open-source large language models (LLMs) to induce\nCCFGs from specifications using a small number of labeled examples and\nverifiable reward-guided reinforcement learning. Our approach first fine-tunes\nan open-source LLM to perform specification-to-grammar translation, and further\napplies Group Relative Policy Optimization (GRPO) to enhance grammar validity\nand generality. We also examine the effectiveness of iterative feedback for\nopen and closed-source LLMs in correcting syntactic and semantic errors in\ngenerated grammars.\n  Experimental results show that our approach SAGE achieves stronger\ngeneralization and outperforms 17 open and closed-source LLMs in both grammar\nquality and test effectiveness, improving over the state-of-the-art by 15.92%p\nin grammar validity and 12.34%p in test effectiveness. We provide our\nimplementation and dataset at the following anonymous\nrepository:https://anonymous.4open.science/r/SAGE-5714", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11091", "categories": ["cs.CL", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2506.11091", "abs": "https://arxiv.org/abs/2506.11091", "authors": ["Shaoshi Ling", "Guoli Ye"], "title": "Customizing Speech Recognition Model with Large Language Model Feedback", "comment": null, "summary": "Automatic speech recognition (ASR) systems have achieved strong performance\non general transcription tasks. However, they continue to struggle with\nrecognizing rare named entities and adapting to domain mismatches. In contrast,\nlarge language models (LLMs), trained on massive internet-scale datasets, are\noften more effective across a wide range of domains. In this work, we propose a\nreinforcement learning based approach for unsupervised domain adaptation,\nleveraging unlabeled data to enhance transcription quality, particularly the\nnamed entities affected by domain mismatch, through feedback from a LLM. Given\ncontextual information, our framework employs a LLM as the reward model to\nscore the hypotheses from the ASR model. These scores serve as reward signals\nto fine-tune the ASR model via reinforcement learning. Our method achieves a\n21\\% improvement on entity word error rate over conventional self-training\nmethods.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reinforcement learning"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11417", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11417", "abs": "https://arxiv.org/abs/2506.11417", "authors": ["Dokyoon Yoon", "Youngsook Song", "Woomyong Park"], "title": "Stop learning it all to mitigate visual hallucination, Focus on the hallucination target", "comment": "Accepted to CVPR 2025", "summary": "Multimodal Large Language Models (MLLMs) frequently suffer from hallucination\nissues, generating information about objects that are not present in input\nimages during vision-language tasks. These hallucinations particularly\nundermine model reliability in practical applications requiring accurate object\nidentification. To address this challenge, we propose \\mymethod,\\ a preference\nlearning approach that mitigates hallucinations by focusing on targeted areas\nwhere they occur. To implement this, we build a dataset containing hallucinated\nresponses, correct responses, and target information (i.e., objects present in\nthe images and the corresponding chunk positions in responses affected by\nhallucinations). By applying a preference learning method restricted to these\nspecific targets, the model can filter out irrelevant signals and focus on\ncorrecting hallucinations. This allows the model to produce more factual\nresponses by concentrating solely on relevant information. Experimental results\ndemonstrate that \\mymethod\\ effectively reduces hallucinations across multiple\nvision hallucination tasks, improving the reliability and performance of MLLMs\nwithout diminishing overall performance.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference learning", "preference"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11425", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11425", "abs": "https://arxiv.org/abs/2506.11425", "authors": ["Jeff Da", "Clinton Wang", "Xiang Deng", "Yuntao Ma", "Nikhil Barhate", "Sean Hendryx"], "title": "Agent-RLVR: Training Software Engineering Agents via Guidance and Environment Rewards", "comment": null, "summary": "Reinforcement Learning from Verifiable Rewards (RLVR) has been widely adopted\nas the de facto method for enhancing the reasoning capabilities of large\nlanguage models and has demonstrated notable success in verifiable domains like\nmath and competitive programming tasks. However, the efficacy of RLVR\ndiminishes significantly when applied to agentic environments. These settings,\ncharacterized by multi-step, complex problem solving, lead to high failure\nrates even for frontier LLMs, as the reward landscape is too sparse for\neffective model training via conventional RLVR. In this work, we introduce\nAgent-RLVR, a framework that makes RLVR effective in challenging agentic\nsettings, with an initial focus on software engineering tasks. Inspired by\nhuman pedagogy, Agent-RLVR introduces agent guidance, a mechanism that actively\nsteers the agent towards successful trajectories by leveraging diverse\ninformational cues. These cues, ranging from high-level strategic plans to\ndynamic feedback on the agent's errors and environmental interactions, emulate\na teacher's guidance, enabling the agent to navigate difficult solution spaces\nand promotes active self-improvement via additional environment exploration. In\nthe Agent-RLVR training loop, agents first attempt to solve tasks to produce\ninitial trajectories, which are then validated by unit tests and supplemented\nwith agent guidance. Agents then reattempt with guidance, and the agent policy\nis updated with RLVR based on the rewards of these guided trajectories.\nAgent-RLVR elevates the pass@1 performance of Qwen-2.5-72B-Instruct from 9.4%\nto 22.4% on SWE-Bench Verified. We find that our guidance-augmented RLVR data\nis additionally useful for test-time reward model training, shown by further\nboosting pass@1 to 27.8%. Agent-RLVR lays the groundwork for training agents\nwith RLVR in complex, real-world environments where conventional RL methods\nstruggle.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model", "reinforcement learning"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11133", "categories": ["cs.CV", "cs.GR", "cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2506.11133", "abs": "https://arxiv.org/abs/2506.11133", "authors": ["Christos Pantazopoulos", "Spyridon Thermos", "Gerasimos Potamianos"], "title": "Monocular 3D Hand Pose Estimation with Implicit Camera Alignment", "comment": "Code is available at https://github.com/cpantazop/HandRepo", "summary": "Estimating the 3D hand articulation from a single color image is a\ncontinuously investigated problem with applications in Augmented Reality (AR),\nVirtual Reality (VR), Human-Computer Interaction (HCI), and robotics. Apart\nfrom the absence of depth information, occlusions, articulation complexity, and\nthe need for camera parameters knowledge pose additional challenges. In this\nwork, we propose an optimization pipeline for estimating the 3D hand\narticulation from 2D keypoint input, which includes a keypoint alignment step\nand a fingertip loss to overcome the need to know or estimate the camera\nparameters. We evaluate our approach on the EgoDexter and Dexter+Object\nbenchmarks to showcase that our approach performs competitively with the SotA,\nwhile also demonstrating its robustness when processing \"in-the-wild\" images\nwithout any prior camera knowledge. Our quantitative analysis highlights the\nsensitivity of the 2D keypoint estimation accuracy, despite the use of hand\npriors. Code is available at https://github.com/cpantazop/HandRepo", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11068", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11068", "abs": "https://arxiv.org/abs/2506.11068", "authors": ["Bumjin Park", "Jinsil Lee", "Jaesik Choi"], "title": "Deontological Keyword Bias: The Impact of Modal Expressions on Normative Judgments of Language Models", "comment": "20 pages including references and appendix; To appear in ACL 2025\n  main conference", "summary": "Large language models (LLMs) are increasingly engaging in moral and ethical\nreasoning, where criteria for judgment are often unclear, even for humans.\nWhile LLM alignment studies cover many areas, one important yet underexplored\narea is how LLMs make judgments about obligations. This work reveals a strong\ntendency in LLMs to judge non-obligatory contexts as obligations when prompts\nare augmented with modal expressions such as must or ought to. We introduce\nthis phenomenon as Deontological Keyword Bias (DKB). We find that LLMs judge\nover 90\\% of commonsense scenarios as obligations when modal expressions are\npresent. This tendency is consist across various LLM families, question types,\nand answer formats. To mitigate DKB, we propose a judgment strategy that\nintegrates few-shot examples with reasoning prompts. This study sheds light on\nhow modal expressions, as a form of linguistic framing, influence the normative\ndecisions of LLMs and underscores the importance of addressing such biases to\nensure judgment alignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["criteria"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11133", "categories": ["cs.CV", "cs.GR", "cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2506.11133", "abs": "https://arxiv.org/abs/2506.11133", "authors": ["Christos Pantazopoulos", "Spyridon Thermos", "Gerasimos Potamianos"], "title": "Monocular 3D Hand Pose Estimation with Implicit Camera Alignment", "comment": "Code is available at https://github.com/cpantazop/HandRepo", "summary": "Estimating the 3D hand articulation from a single color image is a\ncontinuously investigated problem with applications in Augmented Reality (AR),\nVirtual Reality (VR), Human-Computer Interaction (HCI), and robotics. Apart\nfrom the absence of depth information, occlusions, articulation complexity, and\nthe need for camera parameters knowledge pose additional challenges. In this\nwork, we propose an optimization pipeline for estimating the 3D hand\narticulation from 2D keypoint input, which includes a keypoint alignment step\nand a fingertip loss to overcome the need to know or estimate the camera\nparameters. We evaluate our approach on the EgoDexter and Dexter+Object\nbenchmarks to showcase that our approach performs competitively with the SotA,\nwhile also demonstrating its robustness when processing \"in-the-wild\" images\nwithout any prior camera knowledge. Our quantitative analysis highlights the\nsensitivity of the 2D keypoint estimation accuracy, despite the use of hand\npriors. Code is available at https://github.com/cpantazop/HandRepo", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11136", "categories": ["cs.CV", "eess.IV"], "pdf": "https://arxiv.org/pdf/2506.11136", "abs": "https://arxiv.org/abs/2506.11136", "authors": ["Paul Couairon", "Loick Chambon", "Louis Serrano", "Jean-Emmanuel Haugeard", "Matthieu Cord", "Nicolas Thome"], "title": "JAFAR: Jack up Any Feature at Any Resolution", "comment": "Code available at https://github.com/PaulCouairon/JAFAR", "summary": "Foundation Vision Encoders have become essential for a wide range of dense\nvision tasks. However, their low-resolution spatial feature outputs necessitate\nfeature upsampling to produce the high-resolution modalities required for\ndownstream tasks. In this work, we introduce JAFAR, a lightweight and flexible\nfeature upsampler that enhances the spatial resolution of visual features from\nany Foundation Vision Encoder to an arbitrary target resolution. JAFAR employs\nan attention-based module designed to promote semantic alignment between\nhigh-resolution queries, derived from low-level image features, and\nsemantically enriched low-resolution keys, using Spatial Feature Transform\n(SFT) modulation. Notably, despite the absence of high-resolution supervision,\nwe demonstrate that learning at low upsampling ratios and resolutions\ngeneralizes remarkably well to significantly higher output scales. Extensive\nexperiments show that JAFAR effectively recovers fine-grained spatial details\nand consistently outperforms existing feature upsampling methods across a\ndiverse set of downstream tasks. Project page at\nhttps://jafar-upsampler.github.io", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11073", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11073", "abs": "https://arxiv.org/abs/2506.11073", "authors": ["Zekai Ye", "Qiming Li", "Xiaocheng Feng", "Libo Qin", "Yichong Huang", "Baohang Li", "Kui Jiang", "Yang Xiang", "Zhirui Zhang", "Yunfei Lu", "Duyu Tang", "Dandan Tu", "Bing Qin"], "title": "CLAIM: Mitigating Multilingual Object Hallucination in Large Vision-Language Models with Cross-Lingual Attention Intervention", "comment": "ACL2025 Main", "summary": "Large Vision-Language Models (LVLMs) have demonstrated impressive multimodal\nabilities but remain prone to multilingual object hallucination, with a higher\nlikelihood of generating responses inconsistent with the visual input when\nutilizing queries in non-English languages compared to English. Most existing\napproaches to address these rely on pretraining or fine-tuning, which are\nresource-intensive. In this paper, inspired by observing the disparities in\ncross-modal attention patterns across languages, we propose Cross-Lingual\nAttention Intervention for Mitigating multilingual object hallucination (CLAIM)\nin LVLMs, a novel near training-free method by aligning attention patterns.\nCLAIM first identifies language-specific cross-modal attention heads, then\nestimates language shift vectors from English to the target language, and\nfinally intervenes in the attention outputs during inference to facilitate\ncross-lingual visual perception capability alignment. Extensive experiments\ndemonstrate that CLAIM achieves an average improvement of 13.56% (up to 30% in\nSpanish) on the POPE and 21.75% on the hallucination subsets of the MME\nbenchmark across various languages. Further analysis reveals that multilingual\nattention divergence is most prominent in intermediate layers, highlighting\ntheir critical role in multilingual scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11151", "categories": ["cs.CV", "cs.HC"], "pdf": "https://arxiv.org/pdf/2506.11151", "abs": "https://arxiv.org/abs/2506.11151", "authors": ["Jonathan Grizou", "Carlos de la Torre-Ortiz", "Tuukka Ruotsalo"], "title": "Self-Calibrating BCIs: Ranking and Recovery of Mental Targets Without Labels", "comment": "10 pages, 4 figures, 11 appendix pages, 7 appendix figures", "summary": "We consider the problem of recovering a mental target (e.g., an image of a\nface) that a participant has in mind from paired EEG (i.e., brain responses)\nand image (i.e., perceived faces) data collected during interactive sessions\nwithout access to labeled information. The problem has been previously explored\nwith labeled data but not via self-calibration, where labeled data is\nunavailable. Here, we present the first framework and an algorithm, CURSOR,\nthat learns to recover unknown mental targets without access to labeled data or\npre-trained decoders. Our experiments on naturalistic images of faces\ndemonstrate that CURSOR can (1) predict image similarity scores that correlate\nwith human perceptual judgments without any label information, (2) use these\nscores to rank stimuli against an unknown mental target, and (3) generate new\nstimuli indistinguishable from the unknown mental target (validated via a user\nstudy, N=53).", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11097", "categories": ["cs.CL", "cs.AI", "cs.IR"], "pdf": "https://arxiv.org/pdf/2506.11097", "abs": "https://arxiv.org/abs/2506.11097", "authors": ["Haritz Puerto", "Martin Gubri", "Tommaso Green", "Seong Joon Oh", "Sangdoo Yun"], "title": "C-SEO Bench: Does Conversational SEO Work?", "comment": null, "summary": "Large Language Models (LLMs) are transforming search engines into\nConversational Search Engines (CSE). Consequently, Search Engine Optimization\n(SEO) is being shifted into Conversational Search Engine Optimization (C-SEO).\nWe are beginning to see dedicated C-SEO methods for modifying web documents to\nincrease their visibility in CSE responses. However, they are often tested only\nfor a limited breadth of application domains; we do not understand whether\ncertain C-SEO methods would be effective for a broad range of domains.\nMoreover, existing evaluations consider only a single-actor scenario where only\none web document adopts a C-SEO method; in reality, multiple players are likely\nto competitively adopt the cutting-edge C-SEO techniques, drawing an analogy\nfrom the dynamics we have seen in SEO. We present C-SEO Bench, the first\nbenchmark designed to evaluate C-SEO methods across multiple tasks, domains,\nand number of actors. We consider two search tasks, question answering and\nproduct recommendation, with three domains each. We also formalize a new\nevaluation protocol with varying adoption rates among involved actors. Our\nexperiments reveal that most current C-SEO methods are largely ineffective,\ncontrary to reported results in the literature. Instead, traditional SEO\nstrategies, those aiming to improve the ranking of the source in the LLM\ncontext, are significantly more effective. We also observe that as we increase\nthe number of C-SEO adopters, the overall gains decrease, depicting a congested\nand zero-sum nature of the problem. Our code and data are available at\nhttps://github.com/parameterlab/c-seo-bench and\nhttps://huggingface.co/datasets/parameterlab/c-seo-bench.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "question answering"], "score": 3}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11104", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11104", "abs": "https://arxiv.org/abs/2506.11104", "authors": ["Hanzhi Zhang", "Heng Fan", "Kewei Sha", "Yan Huang", "Yunhe Feng"], "title": "DAM: Dynamic Attention Mask for Long-Context Large Language Model Inference Acceleration", "comment": null, "summary": "Long-context understanding is crucial for many NLP applications, yet\ntransformers struggle with efficiency due to the quadratic complexity of\nself-attention. Sparse attention methods alleviate this cost but often impose\nstatic, predefined masks, failing to capture heterogeneous attention patterns.\nThis results in suboptimal token interactions, limiting adaptability and\nretrieval accuracy in long-sequence tasks. This work introduces a dynamic\nsparse attention mechanism that assigns adaptive masks at the attention-map\nlevel, preserving heterogeneous patterns across layers and heads. Unlike\nexisting approaches, our method eliminates the need for fine-tuning and\npredefined mask structures while maintaining computational efficiency. By\nlearning context-aware attention structures, it achieves high alignment with\nfull-attention models, ensuring minimal performance degradation while reducing\nmemory and compute overhead. This approach provides a scalable alternative to\nfull attention, enabling the practical deployment of large-scale Large Language\nModels (LLMs) without sacrificing retrieval performance. DAM is available at:\nhttps://github.com/HanzhiZhang-Ulrica/DAM.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11108", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11108", "abs": "https://arxiv.org/abs/2506.11108", "authors": ["Andrew Kiruluta", "Andreas Lemos", "Priscilla Burity"], "title": "History-Aware Cross-Attention Reinforcement: Self-Supervised Multi Turn and Chain-of-Thought Fine-Tuning with vLLM", "comment": null, "summary": "We present CAGSR-vLLM-MTC, an extension of our Self-Supervised\nCross-Attention-Guided Reinforcement (CAGSR) framework, now implemented on the\nhigh-performance vLLM runtime, to address both multi-turn dialogue and\nchain-of-thought reasoning. Building upon our original single-turn approach, we\nfirst instrumented vLLM's C++/CUDA kernels to asynchronously capture per-layer,\nper-head cross-attention weights during generation. We then generalized our\nself-supervised reward function to accumulate attention signals over entire\nconversation histories and intermediate chain-of-thought steps. We discuss\npractical trade-offs, including an entropy-based clamping mechanism to prevent\nattention collapse on early context, and outline future directions for\nmulti-party dialogues and hierarchical reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11380", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11380", "abs": "https://arxiv.org/abs/2506.11380", "authors": ["Xiaoxin Lu", "Ranran Haoran Zhang", "Yusen Zhang", "Rui Zhang"], "title": "Enhance Multimodal Consistency and Coherence for Text-Image Plan Generation", "comment": "18 pages, 10 figures; Accepted to ACL 2025 Findings", "summary": "People get informed of a daily task plan through diverse media involving both\ntexts and images. However, most prior research only focuses on LLM's capability\nof textual plan generation. The potential of large-scale models in providing\ntext-image plans remains understudied. Generating high-quality text-image plans\nfaces two main challenges: ensuring consistent alignment between two modalities\nand keeping coherence among visual steps. To address these challenges, we\npropose a novel framework that generates and refines text-image plans\nstep-by-step. At each iteration, our framework (1) drafts the next textual step\nbased on the prediction history; (2) edits the last visual step to obtain the\nnext one; (3) extracts PDDL-like visual information; and (4) refines the draft\nwith the extracted visual information. The textual and visual step produced in\nstage (4) and (2) will then serve as inputs for the next iteration. Our\napproach offers a plug-and-play improvement to various backbone models, such as\nMistral-7B, Gemini-1.5, and GPT-4o. To evaluate the effectiveness of our\napproach, we collect a new benchmark consisting of 1,100 tasks and their\ntext-image pair solutions covering 11 daily topics. We also design and validate\na new set of metrics to evaluate the multimodal consistency and coherence in\ntext-image plans. Extensive experiment results show the effectiveness of our\napproach on a range of backbone models against competitive baselines. Our code\nand data are available at https://github.com/psunlpgroup/MPlanner.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11115", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.11115", "abs": "https://arxiv.org/abs/2506.11115", "authors": ["Yerim Oh", "Jun-Hyung Park", "Junho Kim", "SungHo Kim", "SangKeun Lee"], "title": "Incorporating Domain Knowledge into Materials Tokenization", "comment": null, "summary": "While language models are increasingly utilized in materials science, typical\nmodels rely on frequency-centric tokenization methods originally developed for\nnatural language processing. However, these methods frequently produce\nexcessive fragmentation and semantic loss, failing to maintain the structural\nand semantic integrity of material concepts. To address this issue, we propose\nMATTER, a novel tokenization approach that integrates material knowledge into\ntokenization. Based on MatDetector trained on our materials knowledge base and\na re-ranking method prioritizing material concepts in token merging, MATTER\nmaintains the structural integrity of identified material concepts and prevents\nfragmentation during tokenization, ensuring their semantic meaning remains\nintact. The experimental results demonstrate that MATTER outperforms existing\ntokenization methods, achieving an average performance gain of $4\\%$ and $2\\%$\nin the generation and classification tasks, respectively. These results\nunderscore the importance of domain knowledge for tokenization strategies in\nscientific text processing. Our code is available at\nhttps://github.com/yerimoh/MATTER", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11436", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11436", "abs": "https://arxiv.org/abs/2506.11436", "authors": ["Ziyang Luo", "Nian Liu", "Xuguang Yang", "Salman Khan", "Rao Muhammad Anwer", "Hisham Cholakkal", "Fahad Shahbaz Khan", "Junwei Han"], "title": "TAViS: Text-bridged Audio-Visual Segmentation with Foundation Models", "comment": null, "summary": "Audio-Visual Segmentation (AVS) faces a fundamental challenge of effectively\naligning audio and visual modalities. While recent approaches leverage\nfoundation models to address data scarcity, they often rely on single-modality\nknowledge or combine foundation models in an off-the-shelf manner, failing to\naddress the cross-modal alignment challenge. In this paper, we present TAViS, a\nnovel framework that \\textbf{couples} the knowledge of multimodal foundation\nmodels (ImageBind) for cross-modal alignment and a segmentation foundation\nmodel (SAM2) for precise segmentation. However, effectively combining these\nmodels poses two key challenges: the difficulty in transferring the knowledge\nbetween SAM2 and ImageBind due to their different feature spaces, and the\ninsufficiency of using only segmentation loss for supervision. To address these\nchallenges, we introduce a text-bridged design with two key components: (1) a\ntext-bridged hybrid prompting mechanism where pseudo text provides class\nprototype information while retaining modality-specific details from both audio\nand visual inputs, and (2) an alignment supervision strategy that leverages\ntext as a bridge to align shared semantic concepts within audio-visual\nmodalities. Our approach achieves superior performance on single-source,\nmulti-source, semantic datasets, and excels in zero-shot settings.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11493", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11493", "abs": "https://arxiv.org/abs/2506.11493", "authors": ["Tung-Long Vuong", "Hoang Phan", "Vy Vo", "Anh Bui", "Thanh-Toan Do", "Trung Le", "Dinh Phung"], "title": "Preserving Clusters in Prompt Learning for Unsupervised Domain Adaptation", "comment": null, "summary": "Recent approaches leveraging multi-modal pre-trained models like CLIP for\nUnsupervised Domain Adaptation (UDA) have shown significant promise in bridging\ndomain gaps and improving generalization by utilizing rich semantic knowledge\nand robust visual representations learned through extensive pre-training on\ndiverse image-text datasets. While these methods achieve state-of-the-art\nperformance across benchmarks, much of the improvement stems from base\npseudo-labels (CLIP zero-shot predictions) and self-training mechanisms. Thus,\nthe training mechanism exhibits a key limitation wherein the visual embedding\ndistribution in target domains can deviate from the visual embedding\ndistribution in the pre-trained model, leading to misguided signals from class\ndescriptions. This work introduces a fresh solution to reinforce these\npseudo-labels and facilitate target-prompt learning, by exploiting the geometry\nof visual and text embeddings - an aspect that is overlooked by existing\nmethods. We first propose to directly leverage the reference predictions (from\nsource prompts) based on the relationship between source and target visual\nembeddings. We later show that there is a strong clustering behavior observed\nbetween visual and text embeddings in pre-trained multi-modal models. Building\non optimal transport theory, we transform this insight into a novel strategy to\nenforce the clustering property in text embeddings, further enhancing the\nalignment in the target domain. Our experiments and ablation studies validate\nthe effectiveness of the proposed approach, demonstrating superior performance\nand improved quality of target prompts in terms of representation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11515", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11515", "abs": "https://arxiv.org/abs/2506.11515", "authors": ["Xiao Xu", "Libo Qin", "Wanxiang Che", "Min-Yen Kan"], "title": "Manager: Aggregating Insights from Unimodal Experts in Two-Tower VLMs and MLLMs", "comment": "Accepted by IEEE Transactions on Circuits and Systems for Video\n  Technology (TCSVT). June 2025. DOI:\n  https://doi.org/10.1109/TCSVT.2025.3578266", "summary": "Two-Tower Vision--Language Models (VLMs) have demonstrated strong performance\nacross various downstream VL tasks. While BridgeTower further enhances\nperformance by building bridges between encoders, it \\textit{(i)} suffers from\nineffective layer-by-layer utilization of unimodal representations,\n\\textit{(ii)} restricts the flexible exploitation of different levels of\nunimodal semantic knowledge, and \\textit{(iii)} is limited to the evaluation on\ntraditional low-resolution datasets only with the Two-Tower VLM architecture.\nIn this work, we propose Manager, a lightweight, efficient and effective plugin\nthat adaptively aggregates insights from different levels of pre-trained\nunimodal experts to facilitate more comprehensive VL alignment and fusion.\nFirst, under the Two-Tower VLM architecture, we introduce ManagerTower, a novel\nVLM that introduces the manager in each cross-modal layer. Whether with or\nwithout VL pre-training, ManagerTower outperforms previous strong baselines and\nachieves superior performance on 4 downstream VL tasks. Moreover, we extend our\nexploration to the latest Multimodal Large Language Model (MLLM) architecture.\nWe demonstrate that LLaVA-OV-Manager significantly boosts the zero-shot\nperformance of LLaVA-OV across different categories of capabilities, images,\nand resolutions on 20 downstream datasets, whether the multi-grid algorithm is\nenabled or not. In-depth analysis reveals that both our manager and the\nmulti-grid algorithm can be viewed as a plugin that improves the visual\nrepresentation by capturing more diverse visual details from two orthogonal\nperspectives (depth and width). Their synergy can mitigate the semantic\nambiguity caused by the multi-grid algorithm and further improve performance.\nCode and models are available at https://github.com/LooperXX/ManagerTower.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11274", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11274", "abs": "https://arxiv.org/abs/2506.11274", "authors": ["Liran Ringel", "Elad Tolochinsky", "Yaniv Romano"], "title": "Learning a Continue-Thinking Token for Enhanced Test-Time Scaling", "comment": null, "summary": "Test-time scaling has emerged as an effective approach for improving language\nmodel performance by utilizing additional compute at inference time. Recent\nstudies have shown that overriding end-of-thinking tokens (e.g., replacing\n\"</think>\" with \"Wait\") can extend reasoning steps and improve accuracy. In\nthis work, we explore whether a dedicated continue-thinking token can be\nlearned to trigger extended reasoning. We augment a distilled version of\nDeepSeek-R1 with a single learned \"<|continue-thinking|>\" token, training only\nits embedding via reinforcement learning while keeping the model weights\nfrozen. Our experiments show that this learned token achieves improved accuracy\non standard math benchmarks compared to both the baseline model and a test-time\nscaling approach that uses a fixed token (e.g., \"Wait\") for budget forcing. In\nparticular, we observe that in cases where the fixed-token approach enhances\nthe base model's accuracy, our method achieves a markedly greater improvement.\nFor example, on the GSM8K benchmark, the fixed-token approach yields a 1.3%\nabsolute improvement in accuracy, whereas our learned-token method achieves a\n4.2% improvement over the base model that does not use budget forcing.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "inference time", "scaling", "compute at inference"], "score": 4}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11558", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11558", "abs": "https://arxiv.org/abs/2506.11558", "authors": ["Bo-Cheng Chiu", "Jen-Jee Chen", "Yu-Chee Tseng", "Feng-Chi Chen"], "title": "DaMO: A Data-Efficient Multimodal Orchestrator for Temporal Reasoning with Video LLMs", "comment": null, "summary": "Large Language Models (LLMs) have recently been extended to the video domain,\nenabling sophisticated video-language understanding. However, existing Video\nLLMs often exhibit limitations in fine-grained temporal reasoning, restricting\ntheir ability to precisely attribute responses to specific video moments,\nespecially under constrained supervision. We introduce DaMO, a data-efficient\nVideo LLM explicitly designed for accurate temporal reasoning and multimodal\nunderstanding. At its core, the proposed Temporal-aware Fuseformer employs a\nhierarchical dual-stream architecture that progressively captures temporal\ndynamics within each modality and effectively fuses complementary visual and\naudio information. To further enhance computational efficiency, DaMO integrates\na global residual that reduces spatial redundancy while preserving essential\nsemantic details. We train DaMO via a structured four-stage progressive\ntraining paradigm, incrementally equipping the model with multimodal alignment,\nsemantic grounding, and temporal reasoning capabilities. This work also\ncontributes multiple datasets augmented from existing ones with GPT-generated\ntemporally grounded QA pairs for tasks requiring temporal supervision.\nComprehensive experiments on temporal grounding and video QA benchmarks\ndemonstrate that DaMO consistently surpasses prior methods, particularly in\ntasks demanding precise temporal alignment and reasoning. Our work establishes\na promising direction for data-efficient video-language modeling.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11343", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11343", "abs": "https://arxiv.org/abs/2506.11343", "authors": ["Yaohui Zhang", "Haijing Zhang", "Wenlong Ji", "Tianyu Hua", "Nick Haber", "Hancheng Cao", "Weixin Liang"], "title": "From Replication to Redesign: Exploring Pairwise Comparisons for LLM-Based Peer Review", "comment": null, "summary": "The advent of large language models (LLMs) offers unprecedented opportunities\nto reimagine peer review beyond the constraints of traditional workflows.\nDespite these opportunities, prior efforts have largely focused on replicating\ntraditional review workflows with LLMs serving as direct substitutes for human\nreviewers, while limited attention has been given to exploring new paradigms\nthat fundamentally rethink how LLMs can participate in the academic review\nprocess. In this paper, we introduce and explore a novel mechanism that employs\nLLM agents to perform pairwise comparisons among manuscripts instead of\nindividual scoring. By aggregating outcomes from substantial pairwise\nevaluations, this approach enables a more accurate and robust measure of\nrelative manuscript quality. Our experiments demonstrate that this comparative\napproach significantly outperforms traditional rating-based methods in\nidentifying high-impact papers. However, our analysis also reveals emergent\nbiases in the selection process, notably a reduced novelty in research topics\nand an increased institutional imbalance. These findings highlight both the\ntransformative potential of rethinking peer review with LLMs and critical\nchallenges that future systems must address to ensure equity and diversity.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11595", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11595", "abs": "https://arxiv.org/abs/2506.11595", "authors": ["Mert Unsal", "Aylin Akkus"], "title": "EasyARC: Evaluating Vision Language Models on True Visual Reasoning", "comment": "CVPR2025 Workshop on Test-time Scaling for Computer Vision", "summary": "Building on recent advances in language-based reasoning models, we explore\nmultimodal reasoning that integrates vision and text. Existing multimodal\nbenchmarks primarily test visual extraction combined with text-based reasoning,\nlacking true visual reasoning with more complex interactions between vision and\nlanguage. Inspired by the ARC challenge, we introduce EasyARC, a\nvision-language benchmark requiring multi-image, multi-step reasoning, and\nself-correction. EasyARC is procedurally generated, fully verifiable, and\nscalable, making it ideal for reinforcement learning (RL) pipelines. The\ngenerators incorporate progressive difficulty levels, enabling structured\nevaluation across task types and complexities. We benchmark state-of-the-art\nvision-language models and analyze their failure modes. We argue that EasyARC\nsets a new standard for evaluating true reasoning and test-time scaling\ncapabilities in vision-language models. We open-source our benchmark dataset\nand evaluation code.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling", "multi-step reasoning", "self-correction"], "score": 4}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11474", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11474", "abs": "https://arxiv.org/abs/2506.11474", "authors": ["Jaehoon Yun", "Jiwoong Sohn", "Jungwoo Park", "Hyunjae Kim", "Xiangru Tang", "Yanjun Shao", "Yonghoe Koo", "Minhyeok Ko", "Qingyu Chen", "Mark Gerstein", "Michael Moor", "Jaewoo Kang"], "title": "Med-PRM: Medical Reasoning Models with Stepwise, Guideline-verified Process Rewards", "comment": null, "summary": "Large language models have shown promise in clinical decision making, but\ncurrent approaches struggle to localize and correct errors at specific steps of\nthe reasoning process. This limitation is critical in medicine, where\nidentifying and addressing reasoning errors is essential for accurate diagnosis\nand effective patient care. We introduce Med-PRM, a process reward modeling\nframework that leverages retrieval-augmented generation to verify each\nreasoning step against established medical knowledge bases. By verifying\nintermediate reasoning steps with evidence retrieved from clinical guidelines\nand literature, our model can precisely assess the reasoning quality in a\nfine-grained manner. Evaluations on five medical QA benchmarks and two\nopen-ended diagnostic tasks demonstrate that Med-PRM achieves state-of-the-art\nperformance, with improving the performance of base models by up to 13.50%\nusing Med-PRM. Moreover, we demonstrate the generality of Med-PRM by\nintegrating it in a plug-and-play fashion with strong policy models such as\nMeerkat, achieving over 80\\% accuracy on MedQA for the first time using\nsmall-scale models of 8 billion parameters. Our code and data are available at:\nhttps://med-prm.github.io/", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward modeling"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11691", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11691", "abs": "https://arxiv.org/abs/2506.11691", "authors": ["Libin Lan", "Hongxing Li", "Zunhui Xia", "Yudong Zhang"], "title": "DMAF-Net: An Effective Modality Rebalancing Framework for Incomplete Multi-Modal Medical Image Segmentation", "comment": "12 pages, 4 figures, 3 tables", "summary": "Incomplete multi-modal medical image segmentation faces critical challenges\nfrom modality imbalance, including imbalanced modality missing rates and\nheterogeneous modality contributions. Due to their reliance on idealized\nassumptions of complete modality availability, existing methods fail to\ndynamically balance contributions and neglect the structural relationships\nbetween modalities, resulting in suboptimal performance in real-world clinical\nscenarios. To address these limitations, we propose a novel model, named\nDynamic Modality-Aware Fusion Network (DMAF-Net). The DMAF-Net adopts three key\nideas. First, it introduces a Dynamic Modality-Aware Fusion (DMAF) module to\nsuppress missing-modality interference by combining transformer attention with\nadaptive masking and weight modality contributions dynamically through\nattention maps. Second, it designs a synergistic Relation Distillation and\nPrototype Distillation framework to enforce global-local feature alignment via\ncovariance consistency and masked graph attention, while ensuring semantic\nconsistency through cross-modal class-specific prototype alignment. Third, it\npresents a Dynamic Training Monitoring (DTM) strategy to stabilize optimization\nunder imbalanced missing rates by tracking distillation gaps in real-time, and\nto balance convergence speeds across modalities by adaptively reweighting\nlosses and scaling gradients. Extensive experiments on BraTS2020 and MyoPS2020\ndemonstrate that DMAF-Net outperforms existing methods for incomplete\nmulti-modal medical image segmentation. Extensive experiments on BraTS2020 and\nMyoPS2020 demonstrate that DMAF-Net outperforms existing methods for incomplete\nmulti-modal medical image segmentation. Our code is available at\nhttps://github.com/violet-42/DMAF-Net.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11764", "categories": ["cs.CV", "eess.IV"], "pdf": "https://arxiv.org/pdf/2506.11764", "abs": "https://arxiv.org/abs/2506.11764", "authors": ["Muhammad Sarmad", "Arnt-Børre Salberg", "Michael Kampffmeyer"], "title": "DiffFuSR: Super-Resolution of all Sentinel-2 Multispectral Bands using Diffusion Models", "comment": "preprint under review", "summary": "This paper presents DiffFuSR, a modular pipeline for super-resolving all 12\nspectral bands of Sentinel-2 Level-2A imagery to a unified ground sampling\ndistance (GSD) of 2.5 meters. The pipeline comprises two stages: (i) a\ndiffusion-based super-resolution (SR) model trained on high-resolution RGB\nimagery from the NAIP and WorldStrat datasets, harmonized to simulate\nSentinel-2 characteristics; and (ii) a learned fusion network that upscales the\nremaining multispectral bands using the super-resolved RGB image as a spatial\nprior. We introduce a robust degradation model and contrastive degradation\nencoder to support blind SR. Extensive evaluations of the proposed SR pipeline\non the OpenSR benchmark demonstrate that the proposed method outperforms\ncurrent SOTA baselines in terms of reflectance fidelity, spectral consistency,\nspatial alignment, and hallucination suppression. Furthermore, the fusion\nnetwork significantly outperforms classical pansharpening approaches, enabling\naccurate enhancement of Sentinel-2's 20 m and 60 m bands. This study\nunderscores the power of harmonized learning with generative priors and fusion\nstrategies to create a modular framework for Sentinel-2 SR. Our code and models\ncan be found at https://github.com/NorskRegnesentral/DiffFuSR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11681", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11681", "abs": "https://arxiv.org/abs/2506.11681", "authors": ["Pratibha Zunjare", "Michael Hsiao"], "title": "LLMs for Sentence Simplification: A Hybrid Multi-Agent prompting Approach", "comment": null, "summary": "This paper addresses the challenge of transforming complex sentences into\nsequences of logical, simplified sentences while preserving semantic and\nlogical integrity with the help of Large Language Models. We propose a hybrid\napproach that combines advanced prompting with multi-agent architectures to\nenhance the sentence simplification process. Experimental results show that our\napproach was able to successfully simplify 70% of the complex sentences written\nfor video game design application. In comparison, a single-agent approach\nattained a 48% success rate on the same task.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11763", "categories": ["cs.CL", "cs.IR"], "pdf": "https://arxiv.org/pdf/2506.11763", "abs": "https://arxiv.org/abs/2506.11763", "authors": ["Mingxuan Du", "Benfeng Xu", "Chiwei Zhu", "Xiaorui Wang", "Zhendong Mao"], "title": "DeepResearch Bench: A Comprehensive Benchmark for Deep Research Agents", "comment": "31 pages, 5 figures", "summary": "Deep Research Agents are a prominent category of LLM-based agents. By\nautonomously orchestrating multistep web exploration, targeted retrieval, and\nhigher-order synthesis, they transform vast amounts of online information into\nanalyst-grade, citation-rich reports--compressing hours of manual desk research\ninto minutes. However, a comprehensive benchmark for systematically evaluating\nthe capabilities of these agents remains absent. To bridge this gap, we present\nDeepResearch Bench, a benchmark consisting of 100 PhD-level research tasks,\neach meticulously crafted by domain experts across 22 distinct fields.\nEvaluating DRAs is inherently complex and labor-intensive. We therefore propose\ntwo novel methodologies that achieve strong alignment with human judgment. The\nfirst is a reference-based method with adaptive criteria to assess the quality\nof generated research reports. The other framework is introduced to evaluate\nDRA's information retrieval and collection capabilities by assessing its\neffective citation count and overall citation accuracy. We have open-sourced\nDeepResearch Bench and key components of these frameworks at\nhttps://github.com/Ayanami0730/deep_research_bench to accelerate the\ndevelopment of practical LLM-based agents.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "criteria"], "score": 3}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11769", "categories": ["cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11769", "abs": "https://arxiv.org/abs/2506.11769", "authors": ["Tianqi Du", "Haotian Huang", "Yifei Wang", "Yisen Wang"], "title": "Long-Short Alignment for Effective Long-Context Modeling in LLMs", "comment": "ICML 2025", "summary": "Large language models (LLMs) have exhibited impressive performance and\nsurprising emergent properties. However, their effectiveness remains limited by\nthe fixed context window of the transformer architecture, posing challenges for\nlong-context modeling. Among these challenges, length generalization -- the\nability to generalize to sequences longer than those seen during training -- is\na classical and fundamental problem. In this work, we propose a fresh\nperspective on length generalization, shifting the focus from the conventional\nemphasis on input features such as positional encodings or data structures to\nthe output distribution of the model. Specifically, through case studies on\nsynthetic tasks, we highlight the critical role of \\textbf{long-short\nalignment} -- the consistency of output distributions across sequences of\nvarying lengths. Extending this insight to natural language tasks, we propose a\nmetric called Long-Short Misalignment to quantify this phenomenon, uncovering a\nstrong correlation between the metric and length generalization performance.\nBuilding on these findings, we develop a regularization term that promotes\nlong-short alignment during training. Extensive experiments validate the\neffectiveness of our approach, offering new insights for achieving more\neffective long-context modeling in LLMs. Code is available at\nhttps://github.com/PKU-ML/LongShortAlignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "consistency"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11913", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11913", "abs": "https://arxiv.org/abs/2506.11913", "authors": ["F. Gao", "Y Li", "X He", "J Sun", "J Wang"], "title": "O2Former:Direction-Aware and Multi-Scale Query Enhancement for SAR Ship Instance Segmentation", "comment": "12 pages, 7 figures", "summary": "Instance segmentation of ships in synthetic aperture radar (SAR) imagery is\ncritical for applications such as maritime monitoring, environmental analysis,\nand national security. SAR ship images present challenges including scale\nvariation, object density, and fuzzy target boundary, which are often\noverlooked in existing methods, leading to suboptimal performance. In this\nwork, we propose O2Former, a tailored instance segmentation framework that\nextends Mask2Former by fully leveraging the structural characteristics of SAR\nimagery. We introduce two key components. The first is the Optimized Query\nGenerator(OQG). It enables multi-scale feature interaction by jointly encoding\nshallow positional cues and high-level semantic information. This improves\nquery quality and convergence efficiency. The second component is the\nOrientation-Aware Embedding Module(OAEM). It enhances directional sensitivity\nthrough direction-aware convolution and polar-coordinate encoding. This\neffectively addresses the challenge of uneven target orientations in SAR\nscenes. Together, these modules facilitate precise feature alignment from\nbackbone to decoder and strengthen the model's capacity to capture fine-grained\nstructural details. Extensive experiments demonstrate that O2Former outperforms\nstate of the art instance segmentation baselines, validating its effectiveness\nand generalization on SAR ship datasets.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11924", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11924", "abs": "https://arxiv.org/abs/2506.11924", "authors": ["Min-Seop Kwak", "Junho Kim", "Sangdoo Yun", "Dongyoon Han", "Taekyoung Kim", "Seungryong Kim", "Jin-Hwa Kim"], "title": "Aligned Novel View Image and Geometry Synthesis via Cross-modal Attention Instillation", "comment": null, "summary": "We introduce a diffusion-based framework that performs aligned novel view\nimage and geometry generation via a warping-and-inpainting methodology. Unlike\nprior methods that require dense posed images or pose-embedded generative\nmodels limited to in-domain views, our method leverages off-the-shelf geometry\npredictors to predict partial geometries viewed from reference images, and\nformulates novel-view synthesis as an inpainting task for both image and\ngeometry. To ensure accurate alignment between generated images and geometry,\nwe propose cross-modal attention distillation, where attention maps from the\nimage diffusion branch are injected into a parallel geometry diffusion branch\nduring both training and inference. This multi-task approach achieves\nsynergistic effects, facilitating geometrically robust image synthesis as well\nas well-defined geometry prediction. We further introduce proximity-based mesh\nconditioning to integrate depth and normal cues, interpolating between point\ncloud and filtering erroneously predicted geometry from influencing the\ngeneration process. Empirically, our method achieves high-fidelity\nextrapolative view synthesis on both image and geometry across a range of\nunseen scenes, delivers competitive reconstruction quality under interpolation\nsettings, and produces geometrically aligned colored point clouds for\ncomprehensive 3D completion. Project page is available at\nhttps://cvlab-kaist.github.io/MoAI.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11857", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11857", "abs": "https://arxiv.org/abs/2506.11857", "authors": ["Yi-Pei Chen", "Noriki Nishida", "Hideki Nakayama", "Yuji Matsumoto"], "title": "Post Persona Alignment for Multi-Session Dialogue Generation", "comment": null, "summary": "Multi-session persona-based dialogue generation presents challenges in\nmaintaining long-term consistency and generating diverse, personalized\nresponses. While large language models (LLMs) excel in single-session\ndialogues, they struggle to preserve persona fidelity and conversational\ncoherence across extended interactions. Existing methods typically retrieve\npersona information before response generation, which can constrain diversity\nand result in generic outputs. We propose Post Persona Alignment (PPA), a novel\ntwo-stage framework that reverses this process. PPA first generates a general\nresponse based solely on dialogue context, then retrieves relevant persona\nmemories using the response as a query, and finally refines the response to\nalign with the speaker's persona. This post-hoc alignment strategy promotes\nnaturalness and diversity while preserving consistency and personalization.\nExperiments on multi-session LLM-generated dialogue data demonstrate that PPA\nsignificantly outperforms prior approaches in consistency, diversity, and\npersona relevance, offering a more flexible and effective paradigm for\nlong-term personalized dialogue generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "dialogue"], "score": 2}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11976", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11976", "abs": "https://arxiv.org/abs/2506.11976", "authors": ["Constantin Venhoff", "Ashkan Khakzar", "Sonia Joseph", "Philip Torr", "Neel Nanda"], "title": "How Visual Representations Map to Language Feature Space in Multimodal LLMs", "comment": null, "summary": "Effective multimodal reasoning depends on the alignment of visual and\nlinguistic representations, yet the mechanisms by which vision-language models\n(VLMs) achieve this alignment remain poorly understood. We introduce a\nmethodological framework that deliberately maintains a frozen large language\nmodel (LLM) and a frozen vision transformer (ViT), connected solely by training\na linear adapter during visual instruction tuning. This design is fundamental\nto our approach: by keeping the language model frozen, we ensure it maintains\nits original language representations without adaptation to visual data.\nConsequently, the linear adapter must map visual features directly into the\nLLM's existing representational space rather than allowing the language model\nto develop specialized visual understanding through fine-tuning. Our\nexperimental design uniquely enables the use of pre-trained sparse autoencoders\n(SAEs) of the LLM as analytical probes. These SAEs remain perfectly aligned\nwith the unchanged language model and serve as a snapshot of the learned\nlanguage feature-representations. Through systematic analysis of SAE\nreconstruction error, sparsity patterns, and feature SAE descriptions, we\nreveal the layer-wise progression through which visual representations\ngradually align with language feature representations, converging in\nmiddle-to-later layers. This suggests a fundamental misalignment between ViT\noutputs and early LLM layers, raising important questions about whether current\nadapter-based architectures optimally facilitate cross-modal representation\nlearning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11073", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.11073", "abs": "https://arxiv.org/abs/2506.11073", "authors": ["Zekai Ye", "Qiming Li", "Xiaocheng Feng", "Libo Qin", "Yichong Huang", "Baohang Li", "Kui Jiang", "Yang Xiang", "Zhirui Zhang", "Yunfei Lu", "Duyu Tang", "Dandan Tu", "Bing Qin"], "title": "CLAIM: Mitigating Multilingual Object Hallucination in Large Vision-Language Models with Cross-Lingual Attention Intervention", "comment": "ACL2025 Main", "summary": "Large Vision-Language Models (LVLMs) have demonstrated impressive multimodal\nabilities but remain prone to multilingual object hallucination, with a higher\nlikelihood of generating responses inconsistent with the visual input when\nutilizing queries in non-English languages compared to English. Most existing\napproaches to address these rely on pretraining or fine-tuning, which are\nresource-intensive. In this paper, inspired by observing the disparities in\ncross-modal attention patterns across languages, we propose Cross-Lingual\nAttention Intervention for Mitigating multilingual object hallucination (CLAIM)\nin LVLMs, a novel near training-free method by aligning attention patterns.\nCLAIM first identifies language-specific cross-modal attention heads, then\nestimates language shift vectors from English to the target language, and\nfinally intervenes in the attention outputs during inference to facilitate\ncross-lingual visual perception capability alignment. Extensive experiments\ndemonstrate that CLAIM achieves an average improvement of 13.56% (up to 30% in\nSpanish) on the POPE and 21.75% on the hallucination subsets of the MME\nbenchmark across various languages. Further analysis reveals that multilingual\nattention divergence is most prominent in intermediate layers, highlighting\ntheir critical role in multilingual scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11515", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.11515", "abs": "https://arxiv.org/abs/2506.11515", "authors": ["Xiao Xu", "Libo Qin", "Wanxiang Che", "Min-Yen Kan"], "title": "Manager: Aggregating Insights from Unimodal Experts in Two-Tower VLMs and MLLMs", "comment": "Accepted by IEEE Transactions on Circuits and Systems for Video\n  Technology (TCSVT). June 2025. DOI:\n  https://doi.org/10.1109/TCSVT.2025.3578266", "summary": "Two-Tower Vision--Language Models (VLMs) have demonstrated strong performance\nacross various downstream VL tasks. While BridgeTower further enhances\nperformance by building bridges between encoders, it \\textit{(i)} suffers from\nineffective layer-by-layer utilization of unimodal representations,\n\\textit{(ii)} restricts the flexible exploitation of different levels of\nunimodal semantic knowledge, and \\textit{(iii)} is limited to the evaluation on\ntraditional low-resolution datasets only with the Two-Tower VLM architecture.\nIn this work, we propose Manager, a lightweight, efficient and effective plugin\nthat adaptively aggregates insights from different levels of pre-trained\nunimodal experts to facilitate more comprehensive VL alignment and fusion.\nFirst, under the Two-Tower VLM architecture, we introduce ManagerTower, a novel\nVLM that introduces the manager in each cross-modal layer. Whether with or\nwithout VL pre-training, ManagerTower outperforms previous strong baselines and\nachieves superior performance on 4 downstream VL tasks. Moreover, we extend our\nexploration to the latest Multimodal Large Language Model (MLLM) architecture.\nWe demonstrate that LLaVA-OV-Manager significantly boosts the zero-shot\nperformance of LLaVA-OV across different categories of capabilities, images,\nand resolutions on 20 downstream datasets, whether the multi-grid algorithm is\nenabled or not. In-depth analysis reveals that both our manager and the\nmulti-grid algorithm can be viewed as a plugin that improves the visual\nrepresentation by capturing more diverse visual details from two orthogonal\nperspectives (depth and width). Their synergy can mitigate the semantic\nambiguity caused by the multi-grid algorithm and further improve performance.\nCode and models are available at https://github.com/LooperXX/ManagerTower.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
{"id": "2506.11558", "categories": ["cs.CV", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.11558", "abs": "https://arxiv.org/abs/2506.11558", "authors": ["Bo-Cheng Chiu", "Jen-Jee Chen", "Yu-Chee Tseng", "Feng-Chi Chen"], "title": "DaMO: A Data-Efficient Multimodal Orchestrator for Temporal Reasoning with Video LLMs", "comment": null, "summary": "Large Language Models (LLMs) have recently been extended to the video domain,\nenabling sophisticated video-language understanding. However, existing Video\nLLMs often exhibit limitations in fine-grained temporal reasoning, restricting\ntheir ability to precisely attribute responses to specific video moments,\nespecially under constrained supervision. We introduce DaMO, a data-efficient\nVideo LLM explicitly designed for accurate temporal reasoning and multimodal\nunderstanding. At its core, the proposed Temporal-aware Fuseformer employs a\nhierarchical dual-stream architecture that progressively captures temporal\ndynamics within each modality and effectively fuses complementary visual and\naudio information. To further enhance computational efficiency, DaMO integrates\na global residual that reduces spatial redundancy while preserving essential\nsemantic details. We train DaMO via a structured four-stage progressive\ntraining paradigm, incrementally equipping the model with multimodal alignment,\nsemantic grounding, and temporal reasoning capabilities. This work also\ncontributes multiple datasets augmented from existing ones with GPT-generated\ntemporally grounded QA pairs for tasks requiring temporal supervision.\nComprehensive experiments on temporal grounding and video QA benchmarks\ndemonstrate that DaMO consistently surpasses prior methods, particularly in\ntasks demanding precise temporal alignment and reasoning. Our work establishes\na promising direction for data-efficient video-language modeling.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-16.jsonl"}
