{"id": "2507.05495", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05495", "abs": "https://arxiv.org/abs/2507.05495", "authors": ["Prahaladh Chandrahasan", "Jiahe Jin", "Zhihan Zhang", "Tevin Wang", "Andy Tang", "Lucy Mo", "Morteza Ziyadi", "Leonardo F. R. Ribeiro", "Zimeng Qiu", "Markus Dreyer", "Akari Asai", "Chenyan Xiong"], "title": "Deep Research Comparator: A Platform For Fine-grained Human Annotations of Deep Research Agents", "comment": null, "summary": "Effectively evaluating deep research agents that autonomously search the web,\nanalyze information, and generate reports remains a major challenge,\nparticularly when it comes to assessing long reports and giving detailed\nfeedback on their intermediate steps. To address these gaps, we introduce Deep\nResearch Comparator, a platform that offers a holistic framework for deep\nresearch agent hosting, side-by-side comparison, fine-grained human feedback\ncollection, and ranking calculation. Given a user query, our platform displays\nthe final reports from two different agents along with their intermediate steps\nduring generation. Annotators can evaluate the overall quality of final reports\nbased on side-by-side comparison, and also provide detailed feedback separately\nby assessing intermediate steps or specific text spans within the final report.\nFurthermore, we develop Simple Deepresearch, an end-to-end agent scaffold. This\nscaffold serves as a baseline that facilitates the easy integration of various\nlarge language models to transform them into deep research agents for\nevaluation. To demonstrate the platform's utility for deep research agent\ndevelopment, we have collected real user preference data from 17 annotators on\nthree deep research agents. A demo video of our platform can be found at\nhttps://www.youtube.com/watch?v=g4d2dnbdseg.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["human feedback", "preference", "comparison", "ranking"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05920", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05920", "abs": "https://arxiv.org/abs/2507.05920", "authors": ["Xinyu Huang", "Yuhao Dong", "Weiwei Tian", "Bo Li", "Rui Feng", "Ziwei Liu"], "title": "High-Resolution Visual Reasoning via Multi-Turn Grounding-Based Reinforcement Learning", "comment": null, "summary": "State-of-the-art large multi-modal models (LMMs) face challenges when\nprocessing high-resolution images, as these inputs are converted into enormous\nvisual tokens, many of which are irrelevant to the downstream task. In this\npaper, we propose Multi-turn Grounding-based Policy Optimization (MGPO), an\nend-to-end reinforcement learning (RL) framework that enables LMMs to\niteratively focus on key visual regions by automatically cropping sub-images,\nbased on model-predicted grounding coordinates within a multi-turn conversation\nframework. Compared to supervised fine-tuning (SFT), which requires costly\nadditional grounding annotations, our approach highlights that LMMs can emerge\nrobust grounding abilities during the RL training process, leveraging only a\nbinary reward function derived from the correctness of the final answer.\nAdditionally, we observe that LMMs struggle to autonomously trigger visual\ngrounding during the rollout process. To address this cold start problem, we\ndesign a multi-turn conversational template and restrict policy loss\ncomputation to model outputs generated across multiple dialogue rounds, thereby\npromoting stable optimization. Extensive experiments demonstrate that, when\ntrained on standard visual-question-short answering data without grounding\nannotations, MGPO effectively elicits stronger grounding capabilities compared\nto GRPO, leading to 5.4\\% improvement on in-distribution MME-Realworld and\n5.2\\% improvement on the challenging out-of-distribution (OOD) V* Bench.\nNotably, MGPO post-training on Qwen2.5-VL-7B with 21K samples surpasses\nOpenAI's o1 and GPT-4o models on the OOD V* Bench. Codes are available at\nhttps://github.com/EvolvingLMMs-Lab/MGPO.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["o1"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning", "policy optimization"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06013", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.06013", "abs": "https://arxiv.org/abs/2507.06013", "authors": ["Kushal Gajjar", "Harshit Sikchi", "Arpit Singh Gautam", "Marc Hammons", "Saurabh Jha"], "title": "CogniSQL-R1-Zero: Lightweight Reinforced Reasoning for Efficient SQL Generation", "comment": null, "summary": "Translating natural language into SQL (Text-to-SQL) remains a core challenge\nat the intersection of language understanding and structured data access.\nAlthough large language models (LLMs) have improved fluency, generating correct\nand executable SQL, especially for complex queries, continues to be\nchallenging. We introduce CogniSQL-R1-Zero, a reinforcement learning (RL)\nframework and model that produces accurate SQL using a lightweight reward\nsignal based on execution correctness and format-tag compliance. By avoiding\nintermediate supervision, hybrid pipelines and complex reward shaping, our\nmethod encourages stable learning and stronger alignment with the ultimate task\nobjective-producing executable programs. CogniSQL-R1-Zero achieves\nstate-of-the-art execution accuracy on Text2SQL benchmark; BIRD bench,\noutperforming prior supervised and instruction-tuned baselines including SFT\nCodeS-7B, DeepSeek-Coder 236B, and Mistral 123B-despite being trained on a\nsignificantly smaller 7B backbone. This result underscores the scalability and\nefficiency of our RL-based approach when trained on just four NVIDIA A100 GPUs\n(40 GB VRAM each). To support further research in efficient and interpretable\nText-to-SQL modeling, we release two curated datasets: (i) a collection of\n5,024 reasoning traces with varying context lengths, and (ii) a\npositive-sampled corpus of 36,356 corpus of weakly supervised queries, each\nannotated with six semantically diverse reasoning paths. Together, these\ncontributions advance scalable, execution-aligned Text-to-SQL generation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05300", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.05300", "abs": "https://arxiv.org/abs/2507.05300", "authors": ["Nicholas Merchant", "Haitz Sáez de Ocáriz Borde", "Andrei Cristian Popescu", "Carlos Garcia Jurado Suarez"], "title": "Structured Captions Improve Prompt Adherence in Text-to-Image Models (Re-LAION-Caption 19M)", "comment": "7-page main paper + appendix, 18 figures", "summary": "We argue that generative text-to-image models often struggle with prompt\nadherence due to the noisy and unstructured nature of large-scale datasets like\nLAION-5B. This forces users to rely heavily on prompt engineering to elicit\ndesirable outputs. In this work, we propose that enforcing a consistent caption\nstructure during training can significantly improve model controllability and\nalignment. We introduce Re-LAION-Caption 19M, a high-quality subset of\nRe-LAION-5B, comprising 19 million 1024x1024 images with captions generated by\na Mistral 7B Instruct-based LLaVA-Next model. Each caption follows a four-part\ntemplate: subject, setting, aesthetics, and camera details. We fine-tune\nPixArt-$\\Sigma$ and Stable Diffusion 2 using both structured and randomly\nshuffled captions, and show that structured versions consistently yield higher\ntext-image alignment scores using visual question answering (VQA) models. The\ndataset is publicly available at\nhttps://huggingface.co/datasets/supermodelresearch/Re-LAION-Caption19M.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "question answering"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05515", "categories": ["cs.AI", "cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05515", "abs": "https://arxiv.org/abs/2507.05515", "authors": ["Haochen Huang", "Jiahuan Pei", "Mohammad Aliannejadi", "Xin Sun", "Moonisa Ahsan", "Pablo Cesar", "Chuang Yu", "Zhaochun Ren", "Junxiao Wang"], "title": "Fine-Grained Vision-Language Modeling for Multimodal Training Assistants in Augmented Reality", "comment": "20 pages", "summary": "Vision-language models (VLMs) are essential for enabling AI-powered smart\nassistants to interpret and reason in multimodal environments. However, their\napplication in augmented reality (AR) training remains largely unexplored. In\nthis work, we introduce a comprehensive dataset tailored for AR training,\nfeaturing systematized vision-language tasks, and evaluate nine\nstate-of-the-art VLMs on it. Our results reveal that even advanced models,\nincluding GPT-4o, struggle with fine-grained assembly tasks, achieving a\nmaximum F1 score of just 40.54% on state detection. These findings highlight\nthe demand for enhanced datasets, benchmarks, and further research to improve\nfine-grained vision-language alignment. Beyond technical contributions, our\nwork has broader social implications, particularly in empowering blind and\nvisually impaired users with equitable access to AI-driven learning\nopportunities. We provide all related resources, including the dataset, source\ncode, and evaluation results, to support the research community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "fine-grained"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05385", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.05385", "abs": "https://arxiv.org/abs/2507.05385", "authors": ["Guanzhong Pan", "Mei Tan", "Hyunji Nam", "Lucía Langlois", "James Malamut", "Liliana Deonizio", "Dorottya Demszky"], "title": "EduCoder: An Open-Source Annotation System for Education Transcript Data", "comment": null, "summary": "We introduce EduCoder, a domain-specialized tool designed to support\nutterance-level annotation of educational dialogue. While general-purpose text\nannotation tools for NLP and qualitative research abound, few address the\ncomplexities of coding education dialogue transcripts -- with diverse\nteacher-student and peer interactions. Common challenges include defining\ncodebooks for complex pedagogical features, supporting both open-ended and\ncategorical coding, and contextualizing utterances with external features, such\nas the lesson's purpose and the pedagogical value of the instruction. EduCoder\nis designed to address these challenges by providing a platform for researchers\nand domain experts to collaboratively define complex codebooks based on\nobserved data. It incorporates both categorical and open-ended annotation types\nalong with contextual materials. Additionally, it offers a side-by-side\ncomparison of multiple annotators' responses, allowing comparison and\ncalibration of annotations with others to improve data reliability. The system\nis open-source, with a demo video available.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["annotation", "reliability", "dialogue"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05528", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.05528", "abs": "https://arxiv.org/abs/2507.05528", "authors": ["Jiahuan Pei", "Fanghua Ye", "Xin Sun", "Wentao Deng", "Koen Hindriks", "Junxiao Wang"], "title": "Conversational Education at Scale: A Multi-LLM Agent Workflow for Procedural Learning and Pedagogic Quality Assessment", "comment": "14 pages", "summary": "Large language models (LLMs) have advanced virtual educators and learners,\nbridging NLP with AI4Education. Existing work often lacks scalability and fails\nto leverage diverse, large-scale course content, with limited frameworks for\nassessing pedagogic quality. To this end, we propose WikiHowAgent, a\nmulti-agent workflow leveraging LLMs to simulate interactive teaching-learning\nconversations. It integrates teacher and learner agents, an interaction\nmanager, and an evaluator to facilitate procedural learning and assess\npedagogic quality. We introduce a dataset of 114,296 teacher-learner\nconversations grounded in 14,287 tutorials across 17 domains and 727 topics.\nOur evaluation protocol combines computational and rubric-based metrics with\nhuman judgment alignment. Results demonstrate the workflow's effectiveness in\ndiverse setups, offering insights into LLM capabilities across domains. Our\ndatasets and implementations are fully open-sourced.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "rubric"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05418", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.05418", "abs": "https://arxiv.org/abs/2507.05418", "authors": ["Jaedong Hwang", "Kumar Tanmay", "Seok-Jin Lee", "Ayush Agrawal", "Hamid Palangi", "Kumar Ayush", "Ila Fiete", "Paul Pu Liang"], "title": "Learn Globally, Speak Locally: Bridging the Gaps in Multilingual Reasoning", "comment": null, "summary": "Large Language Models (LLMs) have achieved strong performance in domains like\nmathematics, factual QA, and code generation, yet their multilingual reasoning\ncapabilities in these tasks remain underdeveloped. Especially for low-resource\nlanguages such as Swahili or Thai, LLMs can often misinterpret prompts or\ndefault to reasoning in English. This implicit bias toward high-resource\nlanguages undermines factual accuracy, interpretability, and trust. Current\nmultilingual benchmarks focus only on final answers, overlooking whether models\nactually reason in the target language. To address this gap, we introduce\nGeoFact-X, a geography-based multilingual factual reasoning benchmark with\nannotated reasoning traces in five languages: English, Hindi, Japanese,\nSwahili, and Thai. We further propose BRIDGE, a novel training method that\nguides supervised fine-tuning and test-time reinforcement learning with a\nlanguage-consistency reward to align reasoning with the input language.\nFinally, we develop an automatic evaluation protocol using LLM-as-a-judge to\nassess answer correctness and the quality and language consistency of reasoning\ntraces, enabling nuanced and scalable analysis beyond surface-level metrics.\nOur results show that BRIDGE significantly enhances multilingual reasoning\nfidelity, demonstrating that reasoning-aware multilingual reinforcement\nlearning is crucial for robust cross-lingual generalization.\nhttps://jd730.github.io/projects/GeoFact-X_BRIDGE", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "accuracy", "code generation"], "score": 5}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05557", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.05557", "abs": "https://arxiv.org/abs/2507.05557", "authors": ["Alex ZH Dou", "Zhongwei Wan", "Dongfei Cui", "Xin Wang", "Jing Xiong", "Haokun Lin", "Chaofan Tao", "Shen Yan", "Mi Zhang"], "title": "Enhancing Test-Time Scaling of Large Language Models with Hierarchical Retrieval-Augmented MCTS", "comment": "Technical Report", "summary": "Test-time scaling has emerged as a promising paradigm in language modeling,\nleveraging additional computational resources at inference time to enhance\nmodel performance. In this work, we introduce R2-LLMs, a novel and versatile\nhierarchical retrieval-augmented reasoning framework designed to improve\ntest-time scaling in large language models (LLMs) without requiring\ndistillation from more advanced models to obtain chain-of-thought (CoT)\ntraining data. R2-LLMs enhances inference-time generalization by integrating\ndual-level retrieval-based in-context learning: (1) At the coarse level, our\napproach extracts abstract templates from complex reasoning problems and\nretrieves similar problem-answer pairs to facilitate high-level in-context\nlearning; (2) At the fine level, during Monte Carlo Tree Search (MCTS), R2-LLMs\nefficiently retrieves analogous intermediate solution steps from reference\nmathematical problem datasets, refining step-wise reasoning with the aid of a\nprocess reward model (PRM) for scoring. R2-LLMs is a robust hierarchical\nreasoning-augmentation method that enhances in-context-level reasoning while\nseamlessly integrating with step-level tree search methods. Utilizing PRM, it\nrefines both candidate generation and decision-making for improved reasoning\naccuracy. Empirical evaluations on the MATH500, GSM8K, and OlympiadBench-TO\ndatasets achieve substantial relative improvement with an increase of up to 16%\nusing LLaMA-3.1-8B compared to the baselines, showcasing the effectiveness of\nour approach in complex reasoning tasks.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "inference-time", "inference time", "scaling", "monte carlo tree search", "MCTS"], "score": 6}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05598", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05598", "abs": "https://arxiv.org/abs/2507.05598", "authors": ["Sihyun Park"], "title": "Self-Review Framework for Enhancing Instruction Following Capability of LLM", "comment": null, "summary": "Various techniques have been proposed to improve large language models (LLMs)\nadherence to formatting and instruction constraints. One of the most effective\napproaches involves utilizing high-quality data generated by powerful models.\nHowever, such models often fail to fully comply with complex instructions in a\nsingle generation. To address this limitation, iterative revision methods have\nbeen introduced. Nevertheless, as the number of data points and revision\niterations increases, the associated monetary costs grow significantly. As a\nresource-efficient alternative, methods have been proposed that leverage\nhigh-performance evaluation tools to compensate for the limited self-evaluation\ncapabilities of open-source LLMs. However, these approaches often lead to a\ndegradation in output quality due to excessive revision. To overcome these\nchallenges, we propose Re5, a self-evaluation and revision framework designed\nto enhance instruction-following performance while preserving the quality of\nthe generated content. Re5 extracts task and constraint components from user\ninstructions, performs structural evaluations to prevent error accumulation,\nand applies fine-grained constraint-specific content evaluations followed by\nselective revisions. This process ensures precise and quality-preserving\nimprovements. The final high-quality outputs are used for alignment tuning,\nenabling long-term alignment improvements through a data-centric iterative\nrefinement loop. Experimental results demonstrate that Re5 achieves\ninstruction-following performance comparable to models trained on data\ngenerated by GPT-4o-mini, a high-performance model, even with a small amount of\ndata while maintaining response quality with a 64.24%-win rate over the\nnon-revised initial responses. These results validate Re5 as an efficient and\neffective solution for enhancing instruction adherence with minimal external\nsupervision.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05716", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05716", "abs": "https://arxiv.org/abs/2507.05716", "authors": ["Dipayan Sengupta", "Saumya Panda"], "title": "Divergent Realities: A Comparative Analysis of Human Expert vs. Artificial Intelligence Based Generation and Evaluation of Treatment Plans in Dermatology", "comment": "13 pages, 3 tables", "summary": "Background: Evaluating AI-generated treatment plans is a key challenge as AI\nexpands beyond diagnostics, especially with new reasoning models. This study\ncompares plans from human experts and two AI models (a generalist and a\nreasoner), assessed by both human peers and a superior AI judge.\n  Methods: Ten dermatologists, a generalist AI (GPT-4o), and a reasoning AI\n(o3) generated treatment plans for five complex dermatology cases. The\nanonymized, normalized plans were scored in two phases: 1) by the ten human\nexperts, and 2) by a superior AI judge (Gemini 2.5 Pro) using an identical\nrubric.\n  Results: A profound 'evaluator effect' was observed. Human experts scored\npeer-generated plans significantly higher than AI plans (mean 7.62 vs. 7.16;\np=0.0313), ranking GPT-4o 6th (mean 7.38) and the reasoning model, o3, 11th\n(mean 6.97). Conversely, the AI judge produced a complete inversion, scoring AI\nplans significantly higher than human plans (mean 7.75 vs. 6.79; p=0.0313). It\nranked o3 1st (mean 8.20) and GPT-4o 2nd, placing all human experts lower.\n  Conclusions: The perceived quality of a clinical plan is fundamentally\ndependent on the evaluator's nature. An advanced reasoning AI, ranked poorly by\nhuman experts, was judged as superior by a sophisticated AI, revealing a deep\ngap between experience-based clinical heuristics and data-driven algorithmic\nlogic. This paradox presents a critical challenge for AI integration,\nsuggesting the future requires synergistic, explainable human-AI systems that\nbridge this reasoning gap to augment clinical care.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["reasoning model"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "rubric"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05791", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05791", "abs": "https://arxiv.org/abs/2507.05791", "authors": ["Yan Yang", "Dongxu Li", "Yutong Dai", "Yuhao Yang", "Ziyang Luo", "Zirui Zhao", "Zhiyuan Hu", "Junzhe Huang", "Amrita Saha", "Zeyuan Chen", "Ran Xu", "Liyuan Pan", "Caiming Xiong", "Junnan Li"], "title": "GTA1: GUI Test-time Scaling Agent", "comment": null, "summary": "Graphical user interface (GUI) agents autonomously operate across platforms\n(e.g., Linux) to complete tasks by interacting with visual elements.\nSpecifically, a user instruction is decomposed into a sequence of action\nproposals, each corresponding to an interaction with the GUI. After each\naction, the agent observes the updated GUI environment to plan the next step.\nHowever, two main challenges arise: i) resolving ambiguity in task planning\n(i.e., the action proposal sequence), where selecting an appropriate plan is\nnon-trivial, as many valid ones may exist; ii) accurately grounding actions in\ncomplex and high-resolution interfaces, i.e., precisely interacting with visual\ntargets.\n  This paper investigates the two aforementioned challenges with our GUI\nTest-time Scaling Agent, namely GTA1. First, to select the most appropriate\naction proposal, we introduce a test-time scaling method. At each step, we\nsample multiple candidate action proposals and leverage a judge model to\nevaluate and select the most suitable one. It trades off computation for better\ndecision quality by concurrent sampling, shortening task execution steps, and\nimproving overall performance. Second, we propose a model that achieves\nimproved accuracy when grounding the selected action proposal to its\ncorresponding visual elements. Our key insight is that reinforcement learning\n(RL) facilitates visual grounding through inherent objective alignments,\nrewarding successful clicks on interface elements.\n  Experimentally, our method establishes state-of-the-art performance across\ndiverse benchmarks. For example, GTA1-7B achieves 50.1%, 92.4%, and 67.7%\naccuracies on Screenspot-Pro, Screenspot-V2, and OSWorld-G, respectively. When\npaired with a planner applying our test-time scaling strategy, it exhibits\nstate-of-the-art agentic performance (e.g., 45.2% task success rate on\nOSWorld). We open-source our code and models here.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time", "scaling"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05713", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05713", "abs": "https://arxiv.org/abs/2507.05713", "authors": ["Fedor Chernogorskii", "Sergei Averkiev", "Liliya Kudraleeva", "Zaven Martirosian", "Maria Tikhonova", "Valentin Malykh", "Alena Fenogenova"], "title": "DRAGON: Dynamic RAG Benchmark On News", "comment": null, "summary": "Retrieval-Augmented Generation (RAG) is a widely adopted approach for\nimproving the factuality of large language models (LLMs) by incorporating\nexternal knowledge at inference time. Although there exist multiple RAG\nbenchmarks for English, evaluation resources for other languages, including\nRussian, remain scarce and static, failing to capture the dynamic nature of\nreal-world deployments.\n  In this work, we present DRAGON (Dynamic RAG Benchmark On News), the first\ndynamic benchmark for evaluating RAG systems in Russian on a changing news\ncorpora. DRAGON is built upon a regularly updated corpus of Russian news and\npublic documents and supports comprehensive evaluation of both the retriever\nand generator components. Question generation is performed automatically with\nthe use of Knowledge Graph constructed from the corpus and enables the\nextraction of four core question types aligned with distinct subgraph patterns.\nWe release a complete evaluation framework comprising the pipeline for\nautomatic question generation, evaluation scripts, which are potentially\nreusable for other languages and multilingual settings, and benchmark data. We\nalso launch a public leaderboard to encourage community participation and\ncomparison.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05934", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05934", "abs": "https://arxiv.org/abs/2507.05934", "authors": ["Baojiao Xiong", "Boheng Chen", "Chengzhi Wang", "Daxiong Luo", "Dongsheng Xu", "Dongyang Liu", "Fan Yang", "Fangyuan Li", "Fei Teng", "Feng Wang", "Fukang Qin", "Fuquan Peng", "Guanxin Tan", "Guozhi Wang", "Haibo Yu", "Haohao Gao", "Heng Liu", "Hongbo Yang", "Hongjian Zou", "Houzheng Shen", "Hu Meng", "Huan Li", "Hui Tan", "Jiali Chen", "Jianzhao Chen", "Jinliang Zhu", "Kai Wang", "Lei Wu", "Liangbing Liu", "Liuyang Bian", "Liyan He", "Long Liu", "Peiwen Li", "Penggang Shi", "Qi Ding", "Rui Hu", "Shuai Cao", "Shuai Ren", "Shuang Peng", "Teng Xie", "Weiji Chen", "Weilin Xiang", "Weixin Wu", "Xi Yin", "Xiaoxin Chen", "Xu Chen", "Yafei Wen", "Yan Hu", "Yanzhou Yang", "Yina Xie", "Yinghao Chen", "Yixuan Liao", "Yu Geng", "Yuanjiang Ouyang", "Yuanzhuo Yang", "Yuehua He", "Yushuai Peng", "Zhaoxiong Wang", "Zheng Wang", "Zhibo Zhou", "Ziyang Wu"], "title": "BlueLM-2.5-3B Technical Report", "comment": null, "summary": "We present BlueLM-2.5-3B, a compact and unified dense Multimodal Large\nLanguage Model (MLLM) designed for efficient edge-device deployment, offering\nstrong general-purpose and reasoning capabilities. To the best of our\nknowledge, this is the first 3B-scale MLLM to support both thinking and\nnon-thinking modes, while also enabling explicit control over thinking token\nbudget. BlueLM-2.5-3B is developed through diversified data curation, key data\nresampling, hybrid heterogeneous reinforcement learning, and a high-performance\ntraining infrastructure. Our model achieves superior multimodal capacity while\npreserving competitive pure-text performance with only 2.9 billion parameters.\nWe conduct comprehensive evaluations across a broad range of multimodal and\ntext-only benchmarks. In thinking mode, BlueLM-2.5-3B achieves comparable\nperformance to Qwen3-4B on text-only benchmarks, and trails the larger\nKimi-VL-A3B-16B by only about 5% on average across multimodal evaluations. In\nnon-thinking mode, it outperforms Qwen2.5-VL-3B on the majority of multimodal\nbenchmarks. Additionally, BlueLM-2.5-3B exhibits exceptional data efficiency.\nAll of the aforementioned performance is achieved with substantially less total\ntraining data than Qwen2.5-VL-3B and Qwen3-4B. We hope our work contributes to\nthe advancement of high-performance, on-device MLLMs and provides meaningful\ninsights to the research community.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05698", "categories": ["cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2507.05698", "abs": "https://arxiv.org/abs/2507.05698", "authors": ["Mohsi Jawaid", "Marcus Märtens", "Tat-Jun Chin"], "title": "Event-RGB Fusion for Spacecraft Pose Estimation Under Harsh Lighting", "comment": null, "summary": "Spacecraft pose estimation is crucial for autonomous in-space operations,\nsuch as rendezvous, docking and on-orbit servicing. Vision-based pose\nestimation methods, which typically employ RGB imaging sensors, is a compelling\nsolution for spacecraft pose estimation, but are challenged by harsh lighting\nconditions, which produce imaging artifacts such as glare, over-exposure,\nblooming and lens flare. Due to their much higher dynamic range, neuromorphic\nor event sensors are more resilient to extreme lighting conditions. However,\nevent sensors generally have lower spatial resolution and suffer from reduced\nsignal-to-noise ratio during periods of low relative motion. This work\naddresses these individual sensor limitations by introducing a sensor fusion\napproach combining RGB and event sensors. A beam-splitter prism was employed to\nachieve precise optical and temporal alignment. Then, a RANSAC-based technique\nwas developed to fuse the information from the RGB and event channels to\nachieve pose estimation that leveraged the strengths of the two modalities. The\npipeline was complemented by dropout uncertainty estimation to detect extreme\nconditions that affect either channel. To benchmark the performance of the\nproposed event-RGB fusion method, we collected a comprehensive real dataset of\nRGB and event data for satellite pose estimation in a laboratory setting under\na variety of challenging illumination conditions. Encouraging results on the\ndataset demonstrate the efficacy of our event-RGB fusion approach and further\nsupports the usage of event sensors for spacecraft pose estimation. To support\ncommunity research on this topic, our dataset will be released publicly.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05937", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.05937", "abs": "https://arxiv.org/abs/2507.05937", "authors": ["Sebastian Pohl", "Max Ploner", "Alan Akbik"], "title": "Towards a Principled Evaluation of Knowledge Editors", "comment": "Accepted at L2M2 workshop at ACL 2025", "summary": "Model editing has been gaining increasing attention over the past few years.\nFor Knowledge Editing in particular, more challenging evaluation datasets have\nrecently been released. These datasets use different methodologies to score the\nsuccess of editors. Yet, it remains under-explored how robust these\nmethodologies are and whether they unfairly favor some editors. Moreover, the\ndisruptive impact of these editors on overall model capabilities remains a\nconstant blind spot.\n  We address both of these problems and show that choosing different metrics\nand evaluation methodologies as well as different edit batch sizes can lead to\na different ranking of knowledge editors. Crucially we demonstrate this effect\nalso on general language understanding tasks evaluated alongside the knowledge\nediting tasks. Further we include a manual assessment of the string matching\nbased evaluation method for knowledge editing that is favored by recently\nreleased datasets, revealing a tendency to produce false positive matches.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05730", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05730", "abs": "https://arxiv.org/abs/2507.05730", "authors": ["Aayushma Pant", "Arbind Agrahari Baniya", "Tsz-Kwan Lee", "Sunil Aryal"], "title": "Hyperspectral Anomaly Detection Methods: A Survey and Comparative Study", "comment": null, "summary": "Hyperspectral images are high-dimensional datasets consisting of hundreds of\ncontiguous spectral bands, enabling detailed material and surface analysis.\nHyperspectral anomaly detection (HAD) refers to the technique of identifying\nand locating anomalous targets in such data without prior information about a\nhyperspectral scene or target spectrum. This technology has seen rapid\nadvancements in recent years, with applications in agriculture, defence,\nmilitary surveillance, and environmental monitoring. Despite this significant\nprogress, existing HAD methods continue to face challenges such as high\ncomputational complexity, sensitivity to noise, and limited generalisation\nacross diverse datasets. This study presents a comprehensive comparison of\nvarious HAD techniques, categorising them into statistical models,\nrepresentation-based methods, classical machine learning approaches, and deep\nlearning models. We evaluated these methods across 17 benchmarking datasets\nusing different performance metrics, such as ROC, AUC, and separability map to\nanalyse detection accuracy, computational efficiency, their strengths,\nlimitations, and directions for future research.The research shows that deep\nlearning models achieved the highest detection accuracy, while statistical\nmodels demonstrated exceptional speed across all datasets. This study aims to\nprovide valuable insights for researchers and practitioners working to advance\nthe field of hyperspectral anomaly detection methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06057", "categories": ["cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.06057", "abs": "https://arxiv.org/abs/2507.06057", "authors": ["Bo Pang", "Yalu Ouyang", "Hangfei Xu", "Ziqi Jia", "Panpan Li", "Shengzhao Wen", "Lu Wang", "Shiyong Li", "Yanpeng Wang"], "title": "FEVO: Financial Knowledge Expansion and Reasoning Evolution for Large Language Models", "comment": null, "summary": "Advancements in reasoning for large language models (LLMs) have lead to\nsignificant performance improvements for LLMs in various fields such as\nmathematics and programming. However, research applying these advances to the\nfinancial domain, where considerable domain-specific knowledge is necessary to\ncomplete tasks, remains limited. To address this gap, we introduce FEVO\n(Financial Evolution), a multi-stage enhancement framework developed to enhance\nLLM performance in the financial domain. FEVO systemically enhances LLM\nperformance by using continued pre-training (CPT) to expand financial domain\nknowledge, supervised fine-tuning (SFT) to instill structured, elaborate\nreasoning patterns, and reinforcement learning (RL) to further integrate the\nexpanded financial domain knowledge with the learned structured reasoning. To\nensure effective and efficient training, we leverage frontier reasoning models\nand rule-based filtering to curate FEVO-Train, high-quality datasets\nspecifically designed for the different post-training phases. Using our\nframework, we train the FEVO series of models -- C32B, S32B, R32B -- from\nQwen2.5-32B and evaluate them on seven benchmarks to assess financial and\ngeneral capabilities, with results showing that FEVO-R32B achieves\nstate-of-the-art performance on five financial benchmarks against much larger\nmodels as well as specialist models. More significantly, FEVO-R32B demonstrates\nmarkedly better performance than FEVO-R32B-0 (trained from Qwen2.5-32B-Instruct\nusing only RL), thus validating the effectiveness of financial domain knowledge\nexpansion and structured, logical reasoning distillation", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06077", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.06077", "abs": "https://arxiv.org/abs/2507.06077", "authors": ["Iman Rahimi", "Isha Patel"], "title": "AI-Based Demand Forecasting and Load Balancing for Optimising Energy use in Healthcare Systems: A real case study", "comment": null, "summary": "This paper tackles the urgent need for efficient energy management in\nhealthcare facilities, where fluctuating demands challenge operational\nefficiency and sustainability. Traditional methods often prove inadequate,\ncausing inefficiencies and higher costs. To address this, the study presents an\nAI-based framework combining Long Short-Term Memory (LSTM), genetic algorithm\n(GA), and SHAP (Shapley Additive Explanations), specifically designed for\nhealthcare energy management. Although LSTM is widely used for time-series\nforecasting, its application in healthcare energy prediction remains\nunderexplored. The results reveal that LSTM significantly outperforms ARIMA and\nProphet models in forecasting complex, non-linear demand patterns. LSTM\nachieves a Mean Absolute Error (MAE) of 21.69 and Root Mean Square Error (RMSE)\nof 29.96, far better than Prophet (MAE: 59.78, RMSE: 81.22) and ARIMA (MAE:\n87.73, RMSE: 125.22), demonstrating superior performance. The genetic algorithm\nis applied to optimize model parameters and improve load balancing strategies,\nenabling adaptive responses to real-time energy fluctuations. SHAP analysis\nfurther enhances model transparency by explaining the influence of different\nfeatures on predictions, fostering trust in decision-making processes. This\nintegrated LSTM-GA-SHAP approach offers a robust solution for improving\nforecasting accuracy, boosting energy efficiency, and advancing sustainability\nin healthcare facilities. Future research may explore real-time deployment and\nhybridization with reinforcement learning for continuous optimization. Overall,\nthe study establishes a solid foundation for using AI in healthcare energy\nmanagement, highlighting its scalability, efficiency, and resilience potential.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05965", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05965", "abs": "https://arxiv.org/abs/2507.05965", "authors": ["Lucas Fonseca Lage", "Simon Ostermann"], "title": "OpenFActScore: Open-Source Atomic Evaluation of Factuality in Text Generation", "comment": "Submitted to EMNLP 2025 System Demonstrations track", "summary": "We introduce OpenFActScore, an open-source implementation of the FActScore\nframework for evaluating the factuality of text generated by large language\nmodels (LLMs). FActScore evaluates the factual accuracy of long-form text by\nusing Atomic Fact Generation (AFG) to extract individual factual claims and\nAtomic Fact Validation (AFV) to verify each claim against a trusted knowledge\nsource. While the original FActScore relies on closed-source and commercial\nmodels such as InstructGPT and ChatGPT, OpenFActScore enables the use of any\nHugging Face-compatible model for both AFG and AFV. We provide a detailed\ntechnical overview of our implementation, highlighting design choices and\nmodifications made to support open models. We evaluate multiple open-source\nLLMs on both AFG and AFV using the original FActScore benchmark, reporting\nBERTScore-F1 for AFG and Error Rate relative to human annotations for AFV. Our\nresults show that open models can approximate the performance of closed-source\nsystems, with Gemma achieving the best overall performance, and our final setup\nobtains a 0.99 Pearson correlation with the original FActScore experiments.\nOpenFActScore promotes transparency, reproducibility, and cost-effective\nevaluation, and is available at: https://github.com/lflage/OpenFActScore.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["InstructGPT"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality", "correlation", "accuracy"], "score": 5}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06187", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.06187", "abs": "https://arxiv.org/abs/2507.06187", "authors": ["Scott Geng", "Hamish Ivison", "Chun-Liang Li", "Maarten Sap", "Jerry Li", "Ranjay Krishna", "Pang Wei Koh"], "title": "The Delta Learning Hypothesis: Preference Tuning on Weak Data can Yield Strong Gains", "comment": "COLM 2025", "summary": "Improvements in language models are often driven by improving the quality of\nthe data we train them on, which can be limiting when strong supervision is\nscarce. In this work, we show that paired preference data consisting of\nindividually weak data points can enable gains beyond the strength of each\nindividual data point. We formulate the delta learning hypothesis to explain\nthis phenomenon, positing that the relative quality delta between points\nsuffices to drive learning via preference tuning--even when supervised\nfinetuning on the weak data hurts. We validate our hypothesis in controlled\nexperiments and at scale, where we post-train 8B models on preference data\ngenerated by pairing a small 3B model's responses with outputs from an even\nsmaller 1.5B model to create a meaningful delta. Strikingly, on a standard\n11-benchmark evaluation suite (MATH, MMLU, etc.), our simple recipe matches the\nperformance of Tulu 3, a state-of-the-art open model tuned from the same base\nmodel while relying on much stronger supervisors (e.g., GPT-4o). Thus, delta\nlearning enables simpler and cheaper open recipes for state-of-the-art\npost-training. To better understand delta learning, we prove in logistic\nregression that the performance gap between two weak teacher models provides\nuseful signal for improving a stronger student. Overall, our work shows that\nmodels can learn surprisingly well from paired data that might typically be\nconsidered weak.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06221", "categories": ["cs.AI", "cs.GT"], "pdf": "https://arxiv.org/pdf/2507.06221", "abs": "https://arxiv.org/abs/2507.06221", "authors": ["Yuxuan Lu", "Yifan Wu", "Jason Hartline", "Michael J. Curry"], "title": "Aligned Textual Scoring Rules", "comment": null, "summary": "Scoring rules elicit probabilistic predictions from a strategic agent by\nscoring the prediction against a ground truth state. A scoring rule is proper\nif, from the agent's perspective, reporting the true belief maximizes the\nexpected score. With the development of language models, Wu and Hartline (2024)\nproposes a reduction from textual information elicitation to the numerical\n(i.e. probabilistic) information elicitation problem, which achieves provable\nproperness for textual elicitation. However, not all proper scoring rules are\nwell aligned with human preference over text. Our paper designs the Aligned\nScoring rule (ASR) for text by optimizing and minimizing the mean squared error\nbetween a proper scoring rule and a reference score (e.g. human score). Our\nexperiments show that our ASR outperforms previous methods in aligning with\nhuman preference while maintaining properness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05300", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.05300", "abs": "https://arxiv.org/abs/2507.05300", "authors": ["Nicholas Merchant", "Haitz Sáez de Ocáriz Borde", "Andrei Cristian Popescu", "Carlos Garcia Jurado Suarez"], "title": "Structured Captions Improve Prompt Adherence in Text-to-Image Models (Re-LAION-Caption 19M)", "comment": "7-page main paper + appendix, 18 figures", "summary": "We argue that generative text-to-image models often struggle with prompt\nadherence due to the noisy and unstructured nature of large-scale datasets like\nLAION-5B. This forces users to rely heavily on prompt engineering to elicit\ndesirable outputs. In this work, we propose that enforcing a consistent caption\nstructure during training can significantly improve model controllability and\nalignment. We introduce Re-LAION-Caption 19M, a high-quality subset of\nRe-LAION-5B, comprising 19 million 1024x1024 images with captions generated by\na Mistral 7B Instruct-based LLaVA-Next model. Each caption follows a four-part\ntemplate: subject, setting, aesthetics, and camera details. We fine-tune\nPixArt-$\\Sigma$ and Stable Diffusion 2 using both structured and randomly\nshuffled captions, and show that structured versions consistently yield higher\ntext-image alignment scores using visual question answering (VQA) models. The\ndataset is publicly available at\nhttps://huggingface.co/datasets/supermodelresearch/Re-LAION-Caption19M.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "question answering"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05822", "categories": ["cs.CV", "CS", "I.2.10"], "pdf": "https://arxiv.org/pdf/2507.05822", "abs": "https://arxiv.org/abs/2507.05822", "authors": ["L'ea Dubois", "Klaus Schmidt", "Chengyu Wang", "Ji-Hoon Park", "Lin Wang", "Santiago Munoz"], "title": "Video Event Reasoning and Prediction by Fusing World Knowledge from LLMs with Vision Foundation Models", "comment": "22 pages, 4 figures", "summary": "Current video understanding models excel at recognizing \"what\" is happening\nbut fall short in high-level cognitive tasks like causal reasoning and future\nprediction, a limitation rooted in their lack of commonsense world knowledge.\nTo bridge this cognitive gap, we propose a novel framework that synergistically\nfuses a powerful Vision Foundation Model (VFM) for deep visual perception with\na Large Language Model (LLM) serving as a knowledge-driven reasoning core. Our\nkey technical innovation is a sophisticated fusion module, inspired by the\nQ-Former architecture, which distills complex spatiotemporal and object-centric\nvisual features into a concise, language-aligned representation. This enables\nthe LLM to effectively ground its inferential processes in direct visual\nevidence. The model is trained via a two-stage strategy, beginning with\nlarge-scale alignment pre-training on video-text data, followed by targeted\ninstruction fine-tuning on a curated dataset designed to elicit advanced\nreasoning and prediction skills. Extensive experiments demonstrate that our\nmodel achieves state-of-the-art performance on multiple challenging benchmarks.\nNotably, it exhibits remarkable zero-shot generalization to unseen reasoning\ntasks, and our in-depth ablation studies validate the critical contribution of\neach architectural component. This work pushes the boundary of machine\nperception from simple recognition towards genuine cognitive understanding,\npaving the way for more intelligent and capable AI systems in robotics,\nhuman-computer interaction, and beyond.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06137", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06137", "abs": "https://arxiv.org/abs/2507.06137", "authors": ["Mohammad Mahdi Derakhshani", "Dheeraj Varghese", "Marzieh Fadaee", "Cees G. M. Snoek"], "title": "NeoBabel: A Multilingual Open Tower for Visual Generation", "comment": "34 pages, 12 figures", "summary": "Text-to-image generation advancements have been predominantly\nEnglish-centric, creating barriers for non-English speakers and perpetuating\ndigital inequities. While existing systems rely on translation pipelines, these\nintroduce semantic drift, computational overhead, and cultural misalignment. We\nintroduce NeoBabel, a novel multilingual image generation framework that sets a\nnew Pareto frontier in performance, efficiency and inclusivity, supporting six\nlanguages: English, Chinese, Dutch, French, Hindi, and Persian. The model is\ntrained using a combination of large-scale multilingual pretraining and\nhigh-resolution instruction tuning. To evaluate its capabilities, we expand two\nEnglish-only benchmarks to multilingual equivalents: m-GenEval and m-DPG.\nNeoBabel achieves state-of-the-art multilingual performance while retaining\nstrong English capability, scoring 0.75 on m-GenEval and 0.68 on m-DPG.\nNotably, it performs on par with leading models on English tasks while\noutperforming them by +0.11 and +0.09 on multilingual benchmarks, even though\nthese models are built on multilingual base LLMs. This demonstrates the\neffectiveness of our targeted alignment training for preserving and extending\ncrosslingual generalization. We further introduce two new metrics to rigorously\nassess multilingual alignment and robustness to code-mixed prompts. Notably,\nNeoBabel matches or exceeds English-only models while being 2-4x smaller. We\nrelease an open toolkit, including all code, model checkpoints, a curated\ndataset of 124M multilingual text-image pairs, and standardized multilingual\nevaluation protocols, to advance inclusive AI research. Our work demonstrates\nthat multilingual capability is not a trade-off but a catalyst for improved\nrobustness, efficiency, and cultural fidelity in generative AI.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06167", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06167", "abs": "https://arxiv.org/abs/2507.06167", "authors": ["Wei Shen", "Jiangbo Pei", "Yi Peng", "Xuchen Song", "Yang Liu", "Jian Peng", "Haofeng Sun", "Yunzhuo Hao", "Peiyu Wang", "Yahui Zhou"], "title": "Skywork-R1V3 Technical Report", "comment": null, "summary": "We introduce Skywork-R1V3, an advanced, open-source vision-language model\n(VLM) that pioneers a new approach to visual reasoning. Its key innovation lies\nin effectively transferring reasoning skills from text-only Large Language\nModels (LLMs) to visual tasks. The strong performance of Skywork-R1V3 primarily\nstems from our elaborate post-training RL framework, which effectively\nactivates and enhances the model's reasoning ability, without the need for\nadditional continue pre-training. Through this framework, we further uncover\nthe fundamental role of the connector module in achieving robust cross-modal\nalignment for multimodal reasoning models. In addition, we introduce a unique\nindicator of reasoning capability, the entropy of critical reasoning tokens,\nwhich has proven highly effective for checkpoint selection during RL training.\nSkywork-R1V3 achieves state-of-the-art results on MMMU, significantly improving\nfrom 64.3% to 76.0%. This performance matches entry-level human capabilities.\nRemarkably, our RL-powered post-training approach enables even the 38B\nparameter model to rival top closed-source VLMs. The implementation\nsuccessfully transfers mathematical reasoning to other subject-related\nreasoning tasks. We also include an analysis of curriculum learning and\nreinforcement finetuning strategies, along with a broader discussion on\nmultimodal reasoning. Skywork-R1V3 represents a significant leap in multimodal\nreasoning, showcasing RL as a powerful engine for advancing open-source VLM\ncapabilities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["mathematical reasoning"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06181", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.06181", "abs": "https://arxiv.org/abs/2507.06181", "authors": ["Zhongyuan Peng", "Yifan Yao", "Kaijing Ma", "Shuyue Guo", "Yizhe Li", "Yichi Zhang", "Chenchen Zhang", "Yifan Zhang", "Zhouliang Yu", "Luming Li", "Minghao Liu", "Yihang Xia", "Jiawei Shen", "Yuchen Wu", "Yixin Cao", "Zhaoxiang Zhang", "Wenhao Huang", "Jiaheng Liu", "Ge Zhang"], "title": "CriticLean: Critic-Guided Reinforcement Learning for Mathematical Formalization", "comment": null, "summary": "Translating natural language mathematical statements into formal, executable\ncode is a fundamental challenge in automated theorem proving. While prior work\nhas focused on generation and compilation success, little attention has been\npaid to the critic phase-the evaluation of whether generated formalizations\ntruly capture the semantic intent of the original problem. In this paper, we\nintroduce CriticLean, a novel critic-guided reinforcement learning framework\nthat elevates the role of the critic from a passive validator to an active\nlearning component. Specifically, first, we propose the CriticLeanGPT, trained\nvia supervised fine-tuning and reinforcement learning, to rigorously assess the\nsemantic fidelity of Lean 4 formalizations. Then, we introduce CriticLeanBench,\na benchmark designed to measure models' ability to distinguish semantically\ncorrect from incorrect formalizations, and demonstrate that our trained\nCriticLeanGPT models can significantly outperform strong open- and\nclosed-source baselines. Building on the CriticLean framework, we construct\nFineLeanCorpus, a dataset comprising over 285K problems that exhibits rich\ndomain diversity, broad difficulty coverage, and high correctness based on\nhuman evaluation. Overall, our findings highlight that optimizing the critic\nphase is essential for producing reliable formalizations, and we hope our\nCriticLean will provide valuable insights for future advances in formal\nmathematical reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "mathematical reasoning"], "score": 4}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05418", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.05418", "abs": "https://arxiv.org/abs/2507.05418", "authors": ["Jaedong Hwang", "Kumar Tanmay", "Seok-Jin Lee", "Ayush Agrawal", "Hamid Palangi", "Kumar Ayush", "Ila Fiete", "Paul Pu Liang"], "title": "Learn Globally, Speak Locally: Bridging the Gaps in Multilingual Reasoning", "comment": null, "summary": "Large Language Models (LLMs) have achieved strong performance in domains like\nmathematics, factual QA, and code generation, yet their multilingual reasoning\ncapabilities in these tasks remain underdeveloped. Especially for low-resource\nlanguages such as Swahili or Thai, LLMs can often misinterpret prompts or\ndefault to reasoning in English. This implicit bias toward high-resource\nlanguages undermines factual accuracy, interpretability, and trust. Current\nmultilingual benchmarks focus only on final answers, overlooking whether models\nactually reason in the target language. To address this gap, we introduce\nGeoFact-X, a geography-based multilingual factual reasoning benchmark with\nannotated reasoning traces in five languages: English, Hindi, Japanese,\nSwahili, and Thai. We further propose BRIDGE, a novel training method that\nguides supervised fine-tuning and test-time reinforcement learning with a\nlanguage-consistency reward to align reasoning with the input language.\nFinally, we develop an automatic evaluation protocol using LLM-as-a-judge to\nassess answer correctness and the quality and language consistency of reasoning\ntraces, enabling nuanced and scalable analysis beyond surface-level metrics.\nOur results show that BRIDGE significantly enhances multilingual reasoning\nfidelity, demonstrating that reasoning-aware multilingual reinforcement\nlearning is crucial for robust cross-lingual generalization.\nhttps://jd730.github.io/projects/GeoFact-X_BRIDGE", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["test-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "accuracy", "code generation"], "score": 5}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06223", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.06223", "abs": "https://arxiv.org/abs/2507.06223", "authors": ["Zhiyuan Peng", "Ting-ruen Wei", "Tingyu Song", "Yilun Zhao", "Yi Fang"], "title": "Efficiency-Effectiveness Reranking FLOPs for LLM-based Rerankers", "comment": "under review", "summary": "Large Language Models (LLMs) have recently been applied to reranking tasks in\ninformation retrieval, achieving strong performance. However, their high\ncomputational demands often hinder practical deployment. Existing studies\nevaluate the efficiency of LLM-based rerankers using proxy metrics such as\nlatency, the number of forward passes, input tokens, and output tokens.\nHowever, these metrics depend on hardware and running-time choices (\\eg\nparallel or not, batch size, etc), and often fail to account for model size,\nmaking it difficult to interpret and obscuring the evaluation of the\nefficiency-effectiveness tradeoff. To address this issue, we propose\nE\\textsuperscript{2}R-FLOPs, for LLM-based rerankers: ranking metrics per\nPetaFLOP (RPP) for relevance per compute and queries per PetaFLOP (QPP) for\nhardware-agnostic throughput. Companied with the new metrics, an interpretable\nFLOPs estimator is built to estimate the FLOPs of an LLM-based reranker even\nwithout running any experiments. Based on the proposed metrics, we conduct\ncomprehensive experiments to evaluate a wide range of LLM-based rerankers with\ndifferent architecture, studying the efficiency-effectiveness trade-off and\nbringing this issue to the attention of the research community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05964", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05964", "abs": "https://arxiv.org/abs/2507.05964", "authors": ["Vera Soboleva", "Aibek Alanov", "Andrey Kuznetsov", "Konstantin Sobolev"], "title": "T-LoRA: Single Image Diffusion Model Customization Without Overfitting", "comment": null, "summary": "While diffusion model fine-tuning offers a powerful approach for customizing\npre-trained models to generate specific objects, it frequently suffers from\noverfitting when training samples are limited, compromising both generalization\ncapability and output diversity. This paper tackles the challenging yet most\nimpactful task of adapting a diffusion model using just a single concept image,\nas single-image customization holds the greatest practical potential. We\nintroduce T-LoRA, a Timestep-Dependent Low-Rank Adaptation framework\nspecifically designed for diffusion model personalization. In our work we show\nthat higher diffusion timesteps are more prone to overfitting than lower ones,\nnecessitating a timestep-sensitive fine-tuning strategy. T-LoRA incorporates\ntwo key innovations: (1) a dynamic fine-tuning strategy that adjusts\nrank-constrained updates based on diffusion timesteps, and (2) a weight\nparametrization technique that ensures independence between adapter components\nthrough orthogonal initialization. Extensive experiments show that T-LoRA and\nits individual components outperform standard LoRA and other diffusion model\npersonalization techniques. They achieve a superior balance between concept\nfidelity and text alignment, highlighting the potential of T-LoRA in\ndata-limited and resource-constrained scenarios. Code is available at\nhttps://github.com/ControlGenAI/T-LoRA.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05300", "categories": ["cs.CV", "cs.AI", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.05300", "abs": "https://arxiv.org/abs/2507.05300", "authors": ["Nicholas Merchant", "Haitz Sáez de Ocáriz Borde", "Andrei Cristian Popescu", "Carlos Garcia Jurado Suarez"], "title": "Structured Captions Improve Prompt Adherence in Text-to-Image Models (Re-LAION-Caption 19M)", "comment": "7-page main paper + appendix, 18 figures", "summary": "We argue that generative text-to-image models often struggle with prompt\nadherence due to the noisy and unstructured nature of large-scale datasets like\nLAION-5B. This forces users to rely heavily on prompt engineering to elicit\ndesirable outputs. In this work, we propose that enforcing a consistent caption\nstructure during training can significantly improve model controllability and\nalignment. We introduce Re-LAION-Caption 19M, a high-quality subset of\nRe-LAION-5B, comprising 19 million 1024x1024 images with captions generated by\na Mistral 7B Instruct-based LLaVA-Next model. Each caption follows a four-part\ntemplate: subject, setting, aesthetics, and camera details. We fine-tune\nPixArt-$\\Sigma$ and Stable Diffusion 2 using both structured and randomly\nshuffled captions, and show that structured versions consistently yield higher\ntext-image alignment scores using visual question answering (VQA) models. The\ndataset is publicly available at\nhttps://huggingface.co/datasets/supermodelresearch/Re-LAION-Caption19M.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "question answering"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05970", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05970", "abs": "https://arxiv.org/abs/2507.05970", "authors": ["Haiwen Li", "Delong Liu", "Zhaohui Hou", "Zhicheng Zhao", "Fei Su"], "title": "Automatic Synthesis of High-Quality Triplet Data for Composed Image Retrieval", "comment": "This paper was originally submitted to ACM MM 2025 on April 12, 2025", "summary": "As a challenging vision-language (VL) task, Composed Image Retrieval (CIR)\naims to retrieve target images using multimodal (image+text) queries. Although\nmany existing CIR methods have attained promising performance, their reliance\non costly, manually labeled triplets hinders scalability and zero-shot\ncapability. To address this issue, we propose a scalable pipeline for automatic\ntriplet generation, along with a fully synthetic dataset named Composed Image\nRetrieval on High-quality Synthetic Triplets (CIRHS). Our pipeline leverages a\nlarge language model (LLM) to generate diverse prompts, controlling a\ntext-to-image generative model to produce image pairs with identical elements\nin each pair, which are then filtered and reorganized to form the CIRHS\ndataset. In addition, we introduce Hybrid Contextual Alignment (CoAlign), a\nnovel CIR framework, which can accomplish global alignment and local reasoning\nwithin a broader context, enabling the model to learn more robust and\ninformative representations. By utilizing the synthetic CIRHS dataset, CoAlign\nachieves outstanding zero-shot performance on three commonly used benchmarks,\ndemonstrating for the first time the feasibility of training CIR models on a\nfully synthetic dataset. Furthermore, under supervised training, our method\noutperforms all the state-of-the-art supervised CIR approaches, validating the\neffectiveness of our proposed retrieval framework. The code and the CIRHS\ndataset will be released soon.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05515", "categories": ["cs.AI", "cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05515", "abs": "https://arxiv.org/abs/2507.05515", "authors": ["Haochen Huang", "Jiahuan Pei", "Mohammad Aliannejadi", "Xin Sun", "Moonisa Ahsan", "Pablo Cesar", "Chuang Yu", "Zhaochun Ren", "Junxiao Wang"], "title": "Fine-Grained Vision-Language Modeling for Multimodal Training Assistants in Augmented Reality", "comment": "20 pages", "summary": "Vision-language models (VLMs) are essential for enabling AI-powered smart\nassistants to interpret and reason in multimodal environments. However, their\napplication in augmented reality (AR) training remains largely unexplored. In\nthis work, we introduce a comprehensive dataset tailored for AR training,\nfeaturing systematized vision-language tasks, and evaluate nine\nstate-of-the-art VLMs on it. Our results reveal that even advanced models,\nincluding GPT-4o, struggle with fine-grained assembly tasks, achieving a\nmaximum F1 score of just 40.54% on state detection. These findings highlight\nthe demand for enhanced datasets, benchmarks, and further research to improve\nfine-grained vision-language alignment. Beyond technical contributions, our\nwork has broader social implications, particularly in empowering blind and\nvisually impaired users with equitable access to AI-driven learning\nopportunities. We provide all related resources, including the dataset, source\ncode, and evaluation results, to support the research community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "fine-grained"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05992", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05992", "abs": "https://arxiv.org/abs/2507.05992", "authors": ["Xin Wu", "Fei Teng", "Yue Feng", "Kaibo Shi", "Zhuosheng Lin", "Ji Zhang", "James Wang"], "title": "Exploring Partial Multi-Label Learning via Integrating Semantic Co-occurrence Knowledge", "comment": "14 pages, 10 figures, Under Review", "summary": "Partial multi-label learning aims to extract knowledge from incompletely\nannotated data, which includes known correct labels, known incorrect labels,\nand unknown labels. The core challenge lies in accurately identifying the\nambiguous relationships between labels and instances. In this paper, we\nemphasize that matching co-occurrence patterns between labels and instances is\nkey to addressing this challenge. To this end, we propose Semantic\nCo-occurrence Insight Network (SCINet), a novel and effective framework for\npartial multi-label learning. Specifically, SCINet introduces a bi-dominant\nprompter module, which leverages an off-the-shelf multimodal model to capture\ntext-image correlations and enhance semantic alignment. To reinforce\ninstance-label interdependencies, we develop a cross-modality fusion module\nthat jointly models inter-label correlations, inter-instance relationships, and\nco-occurrence patterns across instance-label assignments. Moreover, we propose\nan intrinsic semantic augmentation strategy that enhances the model's\nunderstanding of intrinsic data semantics by applying diverse image\ntransformations, thereby fostering a synergistic relationship between label\nconfidence and sample difficulty. Extensive experiments on four widely-used\nbenchmark datasets demonstrate that SCINet surpasses state-of-the-art methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05528", "categories": ["cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2507.05528", "abs": "https://arxiv.org/abs/2507.05528", "authors": ["Jiahuan Pei", "Fanghua Ye", "Xin Sun", "Wentao Deng", "Koen Hindriks", "Junxiao Wang"], "title": "Conversational Education at Scale: A Multi-LLM Agent Workflow for Procedural Learning and Pedagogic Quality Assessment", "comment": "14 pages", "summary": "Large language models (LLMs) have advanced virtual educators and learners,\nbridging NLP with AI4Education. Existing work often lacks scalability and fails\nto leverage diverse, large-scale course content, with limited frameworks for\nassessing pedagogic quality. To this end, we propose WikiHowAgent, a\nmulti-agent workflow leveraging LLMs to simulate interactive teaching-learning\nconversations. It integrates teacher and learner agents, an interaction\nmanager, and an evaluator to facilitate procedural learning and assess\npedagogic quality. We introduce a dataset of 114,296 teacher-learner\nconversations grounded in 14,287 tutorials across 17 domains and 727 topics.\nOur evaluation protocol combines computational and rubric-based metrics with\nhuman judgment alignment. Results demonstrate the workflow's effectiveness in\ndiverse setups, offering insights into LLM capabilities across domains. Our\ndatasets and implementations are fully open-sourced.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "rubric"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05598", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05598", "abs": "https://arxiv.org/abs/2507.05598", "authors": ["Sihyun Park"], "title": "Self-Review Framework for Enhancing Instruction Following Capability of LLM", "comment": null, "summary": "Various techniques have been proposed to improve large language models (LLMs)\nadherence to formatting and instruction constraints. One of the most effective\napproaches involves utilizing high-quality data generated by powerful models.\nHowever, such models often fail to fully comply with complex instructions in a\nsingle generation. To address this limitation, iterative revision methods have\nbeen introduced. Nevertheless, as the number of data points and revision\niterations increases, the associated monetary costs grow significantly. As a\nresource-efficient alternative, methods have been proposed that leverage\nhigh-performance evaluation tools to compensate for the limited self-evaluation\ncapabilities of open-source LLMs. However, these approaches often lead to a\ndegradation in output quality due to excessive revision. To overcome these\nchallenges, we propose Re5, a self-evaluation and revision framework designed\nto enhance instruction-following performance while preserving the quality of\nthe generated content. Re5 extracts task and constraint components from user\ninstructions, performs structural evaluations to prevent error accumulation,\nand applies fine-grained constraint-specific content evaluations followed by\nselective revisions. This process ensures precise and quality-preserving\nimprovements. The final high-quality outputs are used for alignment tuning,\nenabling long-term alignment improvements through a data-centric iterative\nrefinement loop. Experimental results demonstrate that Re5 achieves\ninstruction-following performance comparable to models trained on data\ngenerated by GPT-4o-mini, a high-performance model, even with a small amount of\ndata while maintaining response quality with a 64.24%-win rate over the\nnon-revised initial responses. These results validate Re5 as an efficient and\neffective solution for enhancing instruction adherence with minimal external\nsupervision.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "fine-grained"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05999", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05999", "abs": "https://arxiv.org/abs/2507.05999", "authors": ["Xinyu Wang", "Muhammad Ibrahim", "Atif Mansoor", "Ajmal Mian"], "title": "Geo-Registration of Terrestrial LiDAR Point Clouds with Satellite Images without GNSS", "comment": "Submitted to Transactions on Geoscience & Remote Sensing", "summary": "Accurate geo-registration of LiDAR point clouds presents significant\nchallenges in GNSS signal denied urban areas with high-rise buildings and\nbridges. Existing methods typically rely on real-time GNSS and IMU data, that\nrequire pre-calibration and assume stable positioning during data collection.\nHowever, this assumption often fails in dense urban areas, resulting in\nlocalization errors. To address this, we propose a structured geo-registration\nand spatial correction method that aligns 3D point clouds with satellite\nimages, enabling frame-wise recovery of GNSS information and reconstruction of\ncity scale 3D maps without relying on prior localization. The proposed approach\nemploys a pre-trained Point Transformer model to segment the road points and\nthen extracts the road skeleton and intersection points from the point cloud as\nwell as the target map for alignment. Global rigid alignment of the two is\nperformed using the intersection points, followed by local refinement using\nradial basis function (RBF) interpolation. Elevation correction is then applied\nto the point cloud based on terrain information from SRTM dataset to resolve\nvertical discrepancies. The proposed method was tested on the popular KITTI\nbenchmark and a locally collected Perth (Western Australia) CBD dataset. On the\nKITTI dataset, our method achieved an average planimetric alignment standard\ndeviation (STD) of 0.84~m across sequences with intersections, representing a\n55.3\\% improvement over the original dataset. On the Perth dataset, which lacks\nGNSS information, our method achieved an average STD of 0.96~m compared to the\nGPS data extracted from Google Maps API. This corresponds to a 77.4\\%\nimprovement from the initial alignment. Our method also resulted in elevation\ncorrelation gains of 30.5\\% on the KITTI dataset and 50.4\\% on the Perth\ndataset.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "correlation"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05713", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05713", "abs": "https://arxiv.org/abs/2507.05713", "authors": ["Fedor Chernogorskii", "Sergei Averkiev", "Liliya Kudraleeva", "Zaven Martirosian", "Maria Tikhonova", "Valentin Malykh", "Alena Fenogenova"], "title": "DRAGON: Dynamic RAG Benchmark On News", "comment": null, "summary": "Retrieval-Augmented Generation (RAG) is a widely adopted approach for\nimproving the factuality of large language models (LLMs) by incorporating\nexternal knowledge at inference time. Although there exist multiple RAG\nbenchmarks for English, evaluation resources for other languages, including\nRussian, remain scarce and static, failing to capture the dynamic nature of\nreal-world deployments.\n  In this work, we present DRAGON (Dynamic RAG Benchmark On News), the first\ndynamic benchmark for evaluating RAG systems in Russian on a changing news\ncorpora. DRAGON is built upon a regularly updated corpus of Russian news and\npublic documents and supports comprehensive evaluation of both the retriever\nand generator components. Question generation is performed automatically with\nthe use of Knowledge Graph constructed from the corpus and enables the\nextraction of four core question types aligned with distinct subgraph patterns.\nWe release a complete evaluation framework comprising the pipeline for\nautomatic question generation, evaluation scripts, which are potentially\nreusable for other languages and multilingual settings, and benchmark data. We\nalso launch a public leaderboard to encourage community participation and\ncomparison.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05730", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05730", "abs": "https://arxiv.org/abs/2507.05730", "authors": ["Aayushma Pant", "Arbind Agrahari Baniya", "Tsz-Kwan Lee", "Sunil Aryal"], "title": "Hyperspectral Anomaly Detection Methods: A Survey and Comparative Study", "comment": null, "summary": "Hyperspectral images are high-dimensional datasets consisting of hundreds of\ncontiguous spectral bands, enabling detailed material and surface analysis.\nHyperspectral anomaly detection (HAD) refers to the technique of identifying\nand locating anomalous targets in such data without prior information about a\nhyperspectral scene or target spectrum. This technology has seen rapid\nadvancements in recent years, with applications in agriculture, defence,\nmilitary surveillance, and environmental monitoring. Despite this significant\nprogress, existing HAD methods continue to face challenges such as high\ncomputational complexity, sensitivity to noise, and limited generalisation\nacross diverse datasets. This study presents a comprehensive comparison of\nvarious HAD techniques, categorising them into statistical models,\nrepresentation-based methods, classical machine learning approaches, and deep\nlearning models. We evaluated these methods across 17 benchmarking datasets\nusing different performance metrics, such as ROC, AUC, and separability map to\nanalyse detection accuracy, computational efficiency, their strengths,\nlimitations, and directions for future research.The research shows that deep\nlearning models achieved the highest detection accuracy, while statistical\nmodels demonstrated exceptional speed across all datasets. This study aims to\nprovide valuable insights for researchers and practitioners working to advance\nthe field of hyperspectral anomaly detection methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06146", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06146", "abs": "https://arxiv.org/abs/2507.06146", "authors": ["Haoyu Wang", "Lei Zhang", "Wei Wei", "Chen Ding", "Yanning Zhang"], "title": "Prompt-Free Conditional Diffusion for Multi-object Image Augmentation", "comment": "Accepted at IJCAI 2025", "summary": "Diffusion models has underpinned much recent advances of dataset augmentation\nin various computer vision tasks. However, when involving generating\nmulti-object images as real scenarios, most existing methods either rely\nentirely on text condition, resulting in a deviation between the generated\nobjects and the original data, or rely too much on the original images,\nresulting in a lack of diversity in the generated images, which is of limited\nhelp to downstream tasks. To mitigate both problems with one stone, we propose\na prompt-free conditional diffusion framework for multi-object image\naugmentation. Specifically, we introduce a local-global semantic fusion\nstrategy to extract semantics from images to replace text, and inject knowledge\ninto the diffusion model through LoRA to alleviate the category deviation\nbetween the original model and the target dataset. In addition, we design a\nreward model based counting loss to assist the traditional reconstruction loss\nfor model training. By constraining the object counts of each category instead\nof pixel-by-pixel constraints, bridging the quantity deviation between the\ngenerated data and the original data while improving the diversity of the\ngenerated data. Experimental results demonstrate the superiority of the\nproposed method over several representative state-of-the-art baselines and\nshowcase strong downstream task gain and out-of-domain generalization\ncapabilities. Code is available at\n\\href{https://github.com/00why00/PFCD}{here}.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward model"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05965", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05965", "abs": "https://arxiv.org/abs/2507.05965", "authors": ["Lucas Fonseca Lage", "Simon Ostermann"], "title": "OpenFActScore: Open-Source Atomic Evaluation of Factuality in Text Generation", "comment": "Submitted to EMNLP 2025 System Demonstrations track", "summary": "We introduce OpenFActScore, an open-source implementation of the FActScore\nframework for evaluating the factuality of text generated by large language\nmodels (LLMs). FActScore evaluates the factual accuracy of long-form text by\nusing Atomic Fact Generation (AFG) to extract individual factual claims and\nAtomic Fact Validation (AFV) to verify each claim against a trusted knowledge\nsource. While the original FActScore relies on closed-source and commercial\nmodels such as InstructGPT and ChatGPT, OpenFActScore enables the use of any\nHugging Face-compatible model for both AFG and AFV. We provide a detailed\ntechnical overview of our implementation, highlighting design choices and\nmodifications made to support open models. We evaluate multiple open-source\nLLMs on both AFG and AFV using the original FActScore benchmark, reporting\nBERTScore-F1 for AFG and Error Rate relative to human annotations for AFV. Our\nresults show that open models can approximate the performance of closed-source\nsystems, with Gemma achieving the best overall performance, and our final setup\nobtains a 0.99 Pearson correlation with the original FActScore experiments.\nOpenFActScore promotes transparency, reproducibility, and cost-effective\nevaluation, and is available at: https://github.com/lflage/OpenFActScore.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["InstructGPT"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "factuality", "correlation", "accuracy"], "score": 5}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05992", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05992", "abs": "https://arxiv.org/abs/2507.05992", "authors": ["Xin Wu", "Fei Teng", "Yue Feng", "Kaibo Shi", "Zhuosheng Lin", "Ji Zhang", "James Wang"], "title": "Exploring Partial Multi-Label Learning via Integrating Semantic Co-occurrence Knowledge", "comment": "14 pages, 10 figures, Under Review", "summary": "Partial multi-label learning aims to extract knowledge from incompletely\nannotated data, which includes known correct labels, known incorrect labels,\nand unknown labels. The core challenge lies in accurately identifying the\nambiguous relationships between labels and instances. In this paper, we\nemphasize that matching co-occurrence patterns between labels and instances is\nkey to addressing this challenge. To this end, we propose Semantic\nCo-occurrence Insight Network (SCINet), a novel and effective framework for\npartial multi-label learning. Specifically, SCINet introduces a bi-dominant\nprompter module, which leverages an off-the-shelf multimodal model to capture\ntext-image correlations and enhance semantic alignment. To reinforce\ninstance-label interdependencies, we develop a cross-modality fusion module\nthat jointly models inter-label correlations, inter-instance relationships, and\nco-occurrence patterns across instance-label assignments. Moreover, we propose\nan intrinsic semantic augmentation strategy that enhances the model's\nunderstanding of intrinsic data semantics by applying diverse image\ntransformations, thereby fostering a synergistic relationship between label\nconfidence and sample difficulty. Extensive experiments on four widely-used\nbenchmark datasets demonstrate that SCINet surpasses state-of-the-art methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05999", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.05999", "abs": "https://arxiv.org/abs/2507.05999", "authors": ["Xinyu Wang", "Muhammad Ibrahim", "Atif Mansoor", "Ajmal Mian"], "title": "Geo-Registration of Terrestrial LiDAR Point Clouds with Satellite Images without GNSS", "comment": "Submitted to Transactions on Geoscience & Remote Sensing", "summary": "Accurate geo-registration of LiDAR point clouds presents significant\nchallenges in GNSS signal denied urban areas with high-rise buildings and\nbridges. Existing methods typically rely on real-time GNSS and IMU data, that\nrequire pre-calibration and assume stable positioning during data collection.\nHowever, this assumption often fails in dense urban areas, resulting in\nlocalization errors. To address this, we propose a structured geo-registration\nand spatial correction method that aligns 3D point clouds with satellite\nimages, enabling frame-wise recovery of GNSS information and reconstruction of\ncity scale 3D maps without relying on prior localization. The proposed approach\nemploys a pre-trained Point Transformer model to segment the road points and\nthen extracts the road skeleton and intersection points from the point cloud as\nwell as the target map for alignment. Global rigid alignment of the two is\nperformed using the intersection points, followed by local refinement using\nradial basis function (RBF) interpolation. Elevation correction is then applied\nto the point cloud based on terrain information from SRTM dataset to resolve\nvertical discrepancies. The proposed method was tested on the popular KITTI\nbenchmark and a locally collected Perth (Western Australia) CBD dataset. On the\nKITTI dataset, our method achieved an average planimetric alignment standard\ndeviation (STD) of 0.84~m across sequences with intersections, representing a\n55.3\\% improvement over the original dataset. On the Perth dataset, which lacks\nGNSS information, our method achieved an average STD of 0.96~m compared to the\nGPS data extracted from Google Maps API. This corresponds to a 77.4\\%\nimprovement from the initial alignment. Our method also resulted in elevation\ncorrelation gains of 30.5\\% on the KITTI dataset and 50.4\\% on the Perth\ndataset.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "correlation"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06231", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06231", "abs": "https://arxiv.org/abs/2507.06231", "authors": ["Keyan Chen", "Chenyang Liu", "Bowen Chen", "Jiafan Zhang", "Zhengxia Zou", "Zhenwei Shi"], "title": "RSRefSeg 2: Decoupling Referring Remote Sensing Image Segmentation with Foundation Models", "comment": null, "summary": "Referring Remote Sensing Image Segmentation provides a flexible and\nfine-grained framework for remote sensing scene analysis via vision-language\ncollaborative interpretation. Current approaches predominantly utilize a\nthree-stage pipeline encompassing dual-modal encoding, cross-modal interaction,\nand pixel decoding. These methods demonstrate significant limitations in\nmanaging complex semantic relationships and achieving precise cross-modal\nalignment, largely due to their coupled processing mechanism that conflates\ntarget localization with boundary delineation. This architectural coupling\namplifies error propagation under semantic ambiguity while restricting model\ngeneralizability and interpretability. To address these issues, we propose\nRSRefSeg 2, a decoupling paradigm that reformulates the conventional workflow\ninto a collaborative dual-stage framework: coarse localization followed by fine\nsegmentation. RSRefSeg 2 integrates CLIP's cross-modal alignment strength with\nSAM's segmentation generalizability through strategic foundation model\ncollaboration. Specifically, CLIP is employed as the dual-modal encoder to\nactivate target features within its pre-aligned semantic space and generate\nlocalization prompts. To mitigate CLIP's misactivation challenges in\nmulti-entity scenarios described by referring texts, a cascaded second-order\nprompter is devised, which enhances precision through implicit reasoning via\ndecomposition of text embeddings into complementary semantic subspaces. These\noptimized semantic prompts subsequently direct the SAM to generate pixel-level\nrefined masks, thereby completing the semantic transmission pipeline. Extensive\nexperiments (RefSegRS, RRSIS-D, and RISBench) demonstrate that RSRefSeg 2\nsurpasses contemporary methods in segmentation accuracy (+~3% gIoU) and complex\nsemantic interpretation. Code is available at:\nhttps://github.com/KyanChen/RSRefSeg2.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06137", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06137", "abs": "https://arxiv.org/abs/2507.06137", "authors": ["Mohammad Mahdi Derakhshani", "Dheeraj Varghese", "Marzieh Fadaee", "Cees G. M. Snoek"], "title": "NeoBabel: A Multilingual Open Tower for Visual Generation", "comment": "34 pages, 12 figures", "summary": "Text-to-image generation advancements have been predominantly\nEnglish-centric, creating barriers for non-English speakers and perpetuating\ndigital inequities. While existing systems rely on translation pipelines, these\nintroduce semantic drift, computational overhead, and cultural misalignment. We\nintroduce NeoBabel, a novel multilingual image generation framework that sets a\nnew Pareto frontier in performance, efficiency and inclusivity, supporting six\nlanguages: English, Chinese, Dutch, French, Hindi, and Persian. The model is\ntrained using a combination of large-scale multilingual pretraining and\nhigh-resolution instruction tuning. To evaluate its capabilities, we expand two\nEnglish-only benchmarks to multilingual equivalents: m-GenEval and m-DPG.\nNeoBabel achieves state-of-the-art multilingual performance while retaining\nstrong English capability, scoring 0.75 on m-GenEval and 0.68 on m-DPG.\nNotably, it performs on par with leading models on English tasks while\noutperforming them by +0.11 and +0.09 on multilingual benchmarks, even though\nthese models are built on multilingual base LLMs. This demonstrates the\neffectiveness of our targeted alignment training for preserving and extending\ncrosslingual generalization. We further introduce two new metrics to rigorously\nassess multilingual alignment and robustness to code-mixed prompts. Notably,\nNeoBabel matches or exceeds English-only models while being 2-4x smaller. We\nrelease an open toolkit, including all code, model checkpoints, a curated\ndataset of 124M multilingual text-image pairs, and standardized multilingual\nevaluation protocols, to advance inclusive AI research. Our work demonstrates\nthat multilingual capability is not a trade-off but a catalyst for improved\nrobustness, efficiency, and cultural fidelity in generative AI.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.05515", "categories": ["cs.AI", "cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.05515", "abs": "https://arxiv.org/abs/2507.05515", "authors": ["Haochen Huang", "Jiahuan Pei", "Mohammad Aliannejadi", "Xin Sun", "Moonisa Ahsan", "Pablo Cesar", "Chuang Yu", "Zhaochun Ren", "Junxiao Wang"], "title": "Fine-Grained Vision-Language Modeling for Multimodal Training Assistants in Augmented Reality", "comment": "20 pages", "summary": "Vision-language models (VLMs) are essential for enabling AI-powered smart\nassistants to interpret and reason in multimodal environments. However, their\napplication in augmented reality (AR) training remains largely unexplored. In\nthis work, we introduce a comprehensive dataset tailored for AR training,\nfeaturing systematized vision-language tasks, and evaluate nine\nstate-of-the-art VLMs on it. Our results reveal that even advanced models,\nincluding GPT-4o, struggle with fine-grained assembly tasks, achieving a\nmaximum F1 score of just 40.54% on state detection. These findings highlight\nthe demand for enhanced datasets, benchmarks, and further research to improve\nfine-grained vision-language alignment. Beyond technical contributions, our\nwork has broader social implications, particularly in empowering blind and\nvisually impaired users with equitable access to AI-driven learning\nopportunities. We provide all related resources, including the dataset, source\ncode, and evaluation results, to support the research community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "fine-grained"], "score": 3}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06137", "categories": ["cs.CL", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06137", "abs": "https://arxiv.org/abs/2507.06137", "authors": ["Mohammad Mahdi Derakhshani", "Dheeraj Varghese", "Marzieh Fadaee", "Cees G. M. Snoek"], "title": "NeoBabel: A Multilingual Open Tower for Visual Generation", "comment": "34 pages, 12 figures", "summary": "Text-to-image generation advancements have been predominantly\nEnglish-centric, creating barriers for non-English speakers and perpetuating\ndigital inequities. While existing systems rely on translation pipelines, these\nintroduce semantic drift, computational overhead, and cultural misalignment. We\nintroduce NeoBabel, a novel multilingual image generation framework that sets a\nnew Pareto frontier in performance, efficiency and inclusivity, supporting six\nlanguages: English, Chinese, Dutch, French, Hindi, and Persian. The model is\ntrained using a combination of large-scale multilingual pretraining and\nhigh-resolution instruction tuning. To evaluate its capabilities, we expand two\nEnglish-only benchmarks to multilingual equivalents: m-GenEval and m-DPG.\nNeoBabel achieves state-of-the-art multilingual performance while retaining\nstrong English capability, scoring 0.75 on m-GenEval and 0.68 on m-DPG.\nNotably, it performs on par with leading models on English tasks while\noutperforming them by +0.11 and +0.09 on multilingual benchmarks, even though\nthese models are built on multilingual base LLMs. This demonstrates the\neffectiveness of our targeted alignment training for preserving and extending\ncrosslingual generalization. We further introduce two new metrics to rigorously\nassess multilingual alignment and robustness to code-mixed prompts. Notably,\nNeoBabel matches or exceeds English-only models while being 2-4x smaller. We\nrelease an open toolkit, including all code, model checkpoints, a curated\ndataset of 124M multilingual text-image pairs, and standardized multilingual\nevaluation protocols, to advance inclusive AI research. Our work demonstrates\nthat multilingual capability is not a trade-off but a catalyst for improved\nrobustness, efficiency, and cultural fidelity in generative AI.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06223", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.06223", "abs": "https://arxiv.org/abs/2507.06223", "authors": ["Zhiyuan Peng", "Ting-ruen Wei", "Tingyu Song", "Yilun Zhao", "Yi Fang"], "title": "Efficiency-Effectiveness Reranking FLOPs for LLM-based Rerankers", "comment": "under review", "summary": "Large Language Models (LLMs) have recently been applied to reranking tasks in\ninformation retrieval, achieving strong performance. However, their high\ncomputational demands often hinder practical deployment. Existing studies\nevaluate the efficiency of LLM-based rerankers using proxy metrics such as\nlatency, the number of forward passes, input tokens, and output tokens.\nHowever, these metrics depend on hardware and running-time choices (\\eg\nparallel or not, batch size, etc), and often fail to account for model size,\nmaking it difficult to interpret and obscuring the evaluation of the\nefficiency-effectiveness tradeoff. To address this issue, we propose\nE\\textsuperscript{2}R-FLOPs, for LLM-based rerankers: ranking metrics per\nPetaFLOP (RPP) for relevance per compute and queries per PetaFLOP (QPP) for\nhardware-agnostic throughput. Companied with the new metrics, an interpretable\nFLOPs estimator is built to estimate the FLOPs of an LLM-based reranker even\nwithout running any experiments. Based on the proposed metrics, we conduct\ncomprehensive experiments to evaluate a wide range of LLM-based rerankers with\ndifferent architecture, studying the efficiency-effectiveness trade-off and\nbringing this issue to the attention of the research community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
{"id": "2507.06167", "categories": ["cs.CL", "cs.CV"], "pdf": "https://arxiv.org/pdf/2507.06167", "abs": "https://arxiv.org/abs/2507.06167", "authors": ["Wei Shen", "Jiangbo Pei", "Yi Peng", "Xuchen Song", "Yang Liu", "Jian Peng", "Haofeng Sun", "Yunzhuo Hao", "Peiyu Wang", "Yahui Zhou"], "title": "Skywork-R1V3 Technical Report", "comment": null, "summary": "We introduce Skywork-R1V3, an advanced, open-source vision-language model\n(VLM) that pioneers a new approach to visual reasoning. Its key innovation lies\nin effectively transferring reasoning skills from text-only Large Language\nModels (LLMs) to visual tasks. The strong performance of Skywork-R1V3 primarily\nstems from our elaborate post-training RL framework, which effectively\nactivates and enhances the model's reasoning ability, without the need for\nadditional continue pre-training. Through this framework, we further uncover\nthe fundamental role of the connector module in achieving robust cross-modal\nalignment for multimodal reasoning models. In addition, we introduce a unique\nindicator of reasoning capability, the entropy of critical reasoning tokens,\nwhich has proven highly effective for checkpoint selection during RL training.\nSkywork-R1V3 achieves state-of-the-art results on MMMU, significantly improving\nfrom 64.3% to 76.0%. This performance matches entry-level human capabilities.\nRemarkably, our RL-powered post-training approach enables even the 38B\nparameter model to rival top closed-source VLMs. The implementation\nsuccessfully transfers mathematical reasoning to other subject-related\nreasoning tasks. We also include an analysis of curriculum learning and\nreinforcement finetuning strategies, along with a broader discussion on\nmultimodal reasoning. Skywork-R1V3 represents a significant leap in multimodal\nreasoning, showcasing RL as a powerful engine for advancing open-source VLM\ncapabilities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["mathematical reasoning"], "score": 1}}, "source_file": "2025-07-09.jsonl"}
