{"id": "2507.16252", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16252", "abs": "https://arxiv.org/abs/2507.16252", "authors": ["Hyunji Nam", "Omer Gottesman", "Amy Zhang", "Dean Foster", "Emma Brunskill", "Lyle Ungar"], "title": "Efficient RL for optimizing conversation level outcomes with an LLM-based tutor", "comment": "9 pages", "summary": "Large language models (LLMs) built on existing reinforcement learning with\nhuman feedback (RLHF) frameworks typically optimize responses based on\nimmediate turn-level human preferences. However, this approach falls short in\nmulti-turn dialogue settings, such as online math tutoring. We propose a method\nto enhance LLM-based tutors by representing the dialogue history with a\nlower-dimensional latent state representation of a student and optimizing a\nlong-term policy to determine high-level actions based on the latent state. The\ngoal is to better align the tutor's behavior with the long-term objective of\nguiding the student towards solving a target math problem on their own. Our\nmodel is lightweight, requiring less computational resources than prior work of\ntraining the tutor policy end-to-end to directly output the tutor's next\nutterance. Our experiment results demonstrate that these modifications lead to\nimproved long-term outcomes compared to prompting in LLM-simulated tutoring\ntasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "human feedback", "reinforcement learning"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16252", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16252", "abs": "https://arxiv.org/abs/2507.16252", "authors": ["Hyunji Nam", "Omer Gottesman", "Amy Zhang", "Dean Foster", "Emma Brunskill", "Lyle Ungar"], "title": "Efficient RL for optimizing conversation level outcomes with an LLM-based tutor", "comment": "9 pages", "summary": "Large language models (LLMs) built on existing reinforcement learning with\nhuman feedback (RLHF) frameworks typically optimize responses based on\nimmediate turn-level human preferences. However, this approach falls short in\nmulti-turn dialogue settings, such as online math tutoring. We propose a method\nto enhance LLM-based tutors by representing the dialogue history with a\nlower-dimensional latent state representation of a student and optimizing a\nlong-term policy to determine high-level actions based on the latent state. The\ngoal is to better align the tutor's behavior with the long-term objective of\nguiding the student towards solving a target math problem on their own. Our\nmodel is lightweight, requiring less computational resources than prior work of\ntraining the tutor policy end-to-end to directly output the tutor's next\nutterance. Our experiment results demonstrate that these modifications lead to\nimproved long-term outcomes compared to prompting in LLM-simulated tutoring\ntasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["RLHF", "human feedback", "reinforcement learning"], "score": 3}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16193", "categories": ["cs.CV", "cs.MM"], "pdf": "https://arxiv.org/pdf/2507.16193", "abs": "https://arxiv.org/abs/2507.16193", "authors": ["Zitong Xu", "Huiyu Duan", "Bingnan Liu", "Guangji Ma", "Jiarui Wang", "Liu Yang", "Shiqi Gao", "Xiaoyu Wang", "Jia Wang", "Xiongkuo Min", "Guangtao Zhai", "Weisi Lin"], "title": "LMM4Edit: Benchmarking and Evaluating Multimodal Image Editing with LMMs", "comment": null, "summary": "The rapid advancement of Text-guided Image Editing (TIE) enables image\nmodifications through text prompts. However, current TIE models still struggle\nto balance image quality, editing alignment, and consistency with the original\nimage, limiting their practical applications. Existing TIE evaluation\nbenchmarks and metrics have limitations on scale or alignment with human\nperception. To this end, we introduce EBench-18K, the first large-scale image\nEditing Benchmark including 18K edited images with fine-grained human\npreference annotations for evaluating TIE. Specifically, EBench-18K includes\n1,080 source images with corresponding editing prompts across 21 tasks, 18K+\nedited images produced by 17 state-of-the-art TIE models, 55K+ mean opinion\nscores (MOSs) assessed from three evaluation dimensions, and 18K+\nquestion-answering (QA) pairs. Based on EBench-18K, we employ outstanding LMMs\nto assess edited images, while the evaluation results, in turn, provide\ninsights into assessing the alignment between the LMMs' understanding ability\nand human preferences. Then, we propose LMM4Edit, a LMM-based metric for\nevaluating image Editing models from perceptual quality, editing alignment,\nattribute preservation, and task-specific QA accuracy in an all-in-one manner.\nExtensive experiments show that LMM4Edit achieves outstanding performance and\naligns well with human preference. Zero-shot validation on the other datasets\nalso shows the generalization ability of our model. The dataset and code are\navailable at https://github.com/IntMeGroup/LMM4Edit.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "human preference", "consistency", "accuracy", "fine-grained"], "score": 7}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16679", "categories": ["cs.CL", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2507.16679", "abs": "https://arxiv.org/abs/2507.16679", "authors": ["Han Jiang", "Dongyao Zhu", "Zhihua Wei", "Xiaoyuan Yi", "Ziang Xiao", "Xing Xie"], "title": "PICACO: Pluralistic In-Context Value Alignment of LLMs via Total Correlation Optimization", "comment": null, "summary": "In-Context Learning has shown great potential for aligning Large Language\nModels (LLMs) with human values, helping reduce harmful outputs and accommodate\ndiverse preferences without costly post-training, known as In-Context Alignment\n(ICA). However, LLMs' comprehension of input prompts remains agnostic, limiting\nICA's ability to address value tensions--human values are inherently\npluralistic, often imposing conflicting demands, e.g., stimulation vs.\ntradition. Current ICA methods therefore face the Instruction Bottleneck\nchallenge, where LLMs struggle to reconcile multiple intended values within a\nsingle prompt, leading to incomplete or biased alignment. To address this, we\npropose PICACO, a novel pluralistic ICA method. Without fine-tuning, PICACO\noptimizes a meta-instruction that navigates multiple values to better elicit\nLLMs' understanding of them and improve their alignment. This is achieved by\nmaximizing the total correlation between specified values and LLM responses,\ntheoretically reinforcing value correlation while reducing distractive noise,\nresulting in effective value instructions. Extensive experiments on five value\nsets show that PICACO works well with both black-box and open-source LLMs,\noutperforms several recent strong baselines, and achieves a better balance\nacross up to 8 distinct values.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "value alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16727", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16727", "abs": "https://arxiv.org/abs/2507.16727", "authors": ["Zhenyun Yin", "Shujie Wang", "Xuhong Wang", "Xingjun Ma", "Yinchun Wang"], "title": "Deliberative Searcher: Improving LLM Reliability via Reinforcement Learning with constraints", "comment": null, "summary": "Improving the reliability of large language models (LLMs) is critical for\ndeploying them in real-world scenarios. In this paper, we propose\n\\textbf{Deliberative Searcher}, the first framework to integrate certainty\ncalibration with retrieval-based search for open-domain question answering. The\nagent performs multi-step reflection and verification over Wikipedia data and\nis trained with a reinforcement learning algorithm that optimizes for accuracy\nunder a soft reliability constraint. Empirical results show that proposed\nmethod improves alignment between model confidence and correctness, leading to\nmore trustworthy outputs. This paper will be continuously updated.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability", "accuracy", "question answering"], "score": 3}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16679", "categories": ["cs.CL", "cs.AI", "cs.CY"], "pdf": "https://arxiv.org/pdf/2507.16679", "abs": "https://arxiv.org/abs/2507.16679", "authors": ["Han Jiang", "Dongyao Zhu", "Zhihua Wei", "Xiaoyuan Yi", "Ziang Xiao", "Xing Xie"], "title": "PICACO: Pluralistic In-Context Value Alignment of LLMs via Total Correlation Optimization", "comment": null, "summary": "In-Context Learning has shown great potential for aligning Large Language\nModels (LLMs) with human values, helping reduce harmful outputs and accommodate\ndiverse preferences without costly post-training, known as In-Context Alignment\n(ICA). However, LLMs' comprehension of input prompts remains agnostic, limiting\nICA's ability to address value tensions--human values are inherently\npluralistic, often imposing conflicting demands, e.g., stimulation vs.\ntradition. Current ICA methods therefore face the Instruction Bottleneck\nchallenge, where LLMs struggle to reconcile multiple intended values within a\nsingle prompt, leading to incomplete or biased alignment. To address this, we\npropose PICACO, a novel pluralistic ICA method. Without fine-tuning, PICACO\noptimizes a meta-instruction that navigates multiple values to better elicit\nLLMs' understanding of them and improve their alignment. This is achieved by\nmaximizing the total correlation between specified values and LLM responses,\ntheoretically reinforcing value correlation while reducing distractive noise,\nresulting in effective value instructions. Extensive experiments on five value\nsets show that PICACO works well with both black-box and open-source LLMs,\noutperforms several recent strong baselines, and achieves a better balance\nacross up to 8 distinct values.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment", "value alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.15911", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.15911", "abs": "https://arxiv.org/abs/2507.15911", "authors": ["Liuchi Xu", "Kang Liu", "Jinshuai Liu", "Lu Wang", "Lisheng Xu", "Jun Cheng"], "title": "Local Dense Logit Relations for Enhanced Knowledge Distillation", "comment": "Accepted by ICCV2025", "summary": "State-of-the-art logit distillation methods exhibit versatility, simplicity,\nand efficiency. Despite the advances, existing studies have yet to delve\nthoroughly into fine-grained relationships within logit knowledge. In this\npaper, we propose Local Dense Relational Logit Distillation (LDRLD), a novel\nmethod that captures inter-class relationships through recursively decoupling\nand recombining logit information, thereby providing more detailed and clearer\ninsights for student learning. To further optimize the performance, we\nintroduce an Adaptive Decay Weight (ADW) strategy, which can dynamically adjust\nthe weights for critical category pairs using Inverse Rank Weighting (IRW) and\nExponential Rank Decay (ERD). Specifically, IRW assigns weights inversely\nproportional to the rank differences between pairs, while ERD adaptively\ncontrols weight decay based on total ranking scores of category pairs.\nFurthermore, after the recursive decoupling, we distill the remaining\nnon-target knowledge to ensure knowledge completeness and enhance performance.\nUltimately, our method improves the student's performance by transferring\nfine-grained knowledge and emphasizing the most critical relationships.\nExtensive experiments on datasets such as CIFAR-100, ImageNet-1K, and\nTiny-ImageNet demonstrate that our method compares favorably with\nstate-of-the-art logit-based distillation approaches. The code will be made\npublicly available.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.15880", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.15880", "abs": "https://arxiv.org/abs/2507.15880", "authors": ["Andy E. Williams"], "title": "The Recursive Coherence Principle: A Formal Constraint on Scalable Intelligence, Alignment, and Reasoning Architecture", "comment": null, "summary": "Intelligence-biological, artificial, or collective-requires structural\ncoherence across recursive reasoning processes to scale effectively. As complex\nsystems grow, coherence becomes fragile unless a higher-order structure ensures\nsemantic consistency. This paper introduces the Recursive Coherence Principle\n(RCP): a foundational constraint stating that for any reasoning system of order\nN, composed of systems operating over conceptual spaces of order N-1, semantic\ncoherence is preserved only by a recursively evaluable generalization operator\nthat spans and aligns those lower-order conceptual spaces. Crucially, this\ncoherence enables structural alignment. Without recursive coherence, no system\ncan reliably preserve goals, meanings, or reasoning consistency at scale. We\nformally define the Functional Model of Intelligence (FMI) as the only known\noperator capable of satisfying the RCP at any scale. The FMI is a minimal,\ncomposable architecture with internal functions (evaluation, modeling,\nadaptation, stability, decomposition, bridging) and external functions\n(storage, recall, System 1 and System 2 reasoning) vital for preserving\nsemantic structure across inference and coordination layers. We prove that any\nsystem lacking the FMI will experience recursive coherence breakdown as it\nscales, arguing that common AI issues like misalignment, hallucination, and\ninstability are symptoms of this structural coherence loss. Unlike other\nfoundational principles, RCP uniquely captures the internal, recursive dynamics\nneeded for coherent, alignable intelligence, modeling semantic coherence under\nrecursion. This work significantly impacts AI alignment, advocating a shift\nfrom behavioral constraints to structural coherence, and offers a pathway for\nsafely generalizable, robustly coherent AI at scale.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency"], "score": 2}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.15895", "categories": ["cs.AI", "cs.CY", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.15895", "abs": "https://arxiv.org/abs/2507.15895", "authors": ["Lisa Dargasz"], "title": "Integrating Reason-Based Moral Decision-Making in the Reinforcement Learning Architecture", "comment": "Master's thesis, April 2025, 122 pages", "summary": "Reinforcement Learning is a machine learning methodology that has\ndemonstrated strong performance across a variety of tasks. In particular, it\nplays a central role in the development of artificial autonomous agents. As\nthese agents become increasingly capable, market readiness is rapidly\napproaching, which means those agents, for example taking the form of humanoid\nrobots or autonomous cars, are poised to transition from laboratory prototypes\nto autonomous operation in real-world environments. This transition raises\nconcerns leading to specific requirements for these systems - among them, the\nrequirement that they are designed to behave ethically. Crucially, research\ndirected toward building agents that fulfill the requirement to behave\nethically - referred to as artificial moral agents(AMAs) - has to address a\nrange of challenges at the intersection of computer science and philosophy.\nThis study explores the development of reason-based artificial moral agents\n(RBAMAs). RBAMAs are build on an extension of the reinforcement learning\narchitecture to enable moral decision-making based on sound normative\nreasoning, which is achieved by equipping the agent with the capacity to learn\na reason-theory - a theory which enables it to process morally relevant\npropositions to derive moral obligations - through case-based feedback. They\nare designed such that they adapt their behavior to ensure conformance to these\nobligations while they pursue their designated tasks. These features contribute\nto the moral justifiability of the their actions, their moral robustness, and\ntheir moral trustworthiness, which proposes the extended architecture as a\nconcrete and deployable framework for the development of AMAs that fulfills key\nethical desiderata. This study presents a first implementation of an RBAMA and\ndemonstrates the potential of RBAMAs in initial experiments.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16076", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.16076", "abs": "https://arxiv.org/abs/2507.16076", "authors": ["Marlene Lutz", "Indira Sen", "Georg Ahnert", "Elisa Rogers", "Markus Strohmaier"], "title": "The Prompt Makes the Person(a): A Systematic Evaluation of Sociodemographic Persona Prompting for Large Language Models", "comment": null, "summary": "Persona prompting is increasingly used in large language models (LLMs) to\nsimulate views of various sociodemographic groups. However, how a persona\nprompt is formulated can significantly affect outcomes, raising concerns about\nthe fidelity of such simulations. Using five open-source LLMs, we\nsystematically examine how different persona prompt strategies, specifically\nrole adoption formats and demographic priming strategies, influence LLM\nsimulations across 15 intersectional demographic groups in both open- and\nclosed-ended tasks. Our findings show that LLMs struggle to simulate\nmarginalized groups, particularly nonbinary, Hispanic, and Middle Eastern\nidentities, but that the choice of demographic priming and role adoption\nstrategy significantly impacts their portrayal. Specifically, we find that\nprompting in an interview-style format and name-based priming can help reduce\nstereotyping and improve alignment. Surprisingly, smaller models like OLMo-2-7B\noutperform larger ones such as Llama-3.3-70B. Our findings offer actionable\nguidance for designing sociodemographic persona prompts in LLM-based simulation\nstudies.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16154", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16154", "abs": "https://arxiv.org/abs/2507.16154", "authors": ["Jyun-Ze Tang", "Chih-Fan Hsu", "Jeng-Lin Li", "Ming-Ching Chang", "Wei-Chao Chen"], "title": "LSSGen: Leveraging Latent Space Scaling in Flow and Diffusion for Efficient Text to Image Generation", "comment": "ICCV AIGENS 2025", "summary": "Flow matching and diffusion models have shown impressive results in\ntext-to-image generation, producing photorealistic images through an iterative\ndenoising process. A common strategy to speed up synthesis is to perform early\ndenoising at lower resolutions. However, traditional methods that downscale and\nupscale in pixel space often introduce artifacts and distortions. These issues\narise when the upscaled images are re-encoded into the latent space, leading to\ndegraded final image quality. To address this, we propose {\\bf Latent Space\nScaling Generation (LSSGen)}, a framework that performs resolution scaling\ndirectly in the latent space using a lightweight latent upsampler. Without\naltering the Transformer or U-Net architecture, LSSGen improves both efficiency\nand visual quality while supporting flexible multi-resolution generation. Our\ncomprehensive evaluation covering text-image alignment and perceptual quality\nshows that LSSGen significantly outperforms conventional scaling approaches.\nWhen generating $1024^2$ images at similar speeds, it achieves up to 246\\%\nTOPIQ score improvement.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16158", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16158", "abs": "https://arxiv.org/abs/2507.16158", "authors": ["Hui Ye", "Haodong Chen", "Zeke Zexi Hu", "Xiaoming Chen", "Yuk Ying Chung"], "title": "AMMNet: An Asymmetric Multi-Modal Network for Remote Sensing Semantic Segmentation", "comment": null, "summary": "Semantic segmentation in remote sensing (RS) has advanced significantly with\nthe incorporation of multi-modal data, particularly the integration of RGB\nimagery and the Digital Surface Model (DSM), which provides complementary\ncontextual and structural information about the ground object. However,\nintegrating RGB and DSM often faces two major limitations: increased\ncomputational complexity due to architectural redundancy, and degraded\nsegmentation performance caused by modality misalignment. These issues\nundermine the efficiency and robustness of semantic segmentation, particularly\nin complex urban environments where precise multi-modal integration is\nessential. To overcome these limitations, we propose Asymmetric Multi-Modal\nNetwork (AMMNet), a novel asymmetric architecture that achieves robust and\nefficient semantic segmentation through three designs tailored for RGB-DSM\ninput pairs. To reduce architectural redundancy, the Asymmetric Dual Encoder\n(ADE) module assigns representational capacity based on modality-specific\ncharacteristics, employing a deeper encoder for RGB imagery to capture rich\ncontextual information and a lightweight encoder for DSM to extract sparse\nstructural features. Besides, to facilitate modality alignment, the Asymmetric\nPrior Fuser (APF) integrates a modality-aware prior matrix into the fusion\nprocess, enabling the generation of structure-aware contextual features.\nAdditionally, the Distribution Alignment (DA) module enhances cross-modal\ncompatibility by aligning feature distributions through divergence\nminimization. Extensive experiments on the ISPRS Vaihingen and Potsdam datasets\ndemonstrate that AMMNet attains state-of-the-art segmentation accuracy among\nmulti-modal networks while reducing computational and memory requirements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16204", "categories": ["cs.AI", "eess.SP"], "pdf": "https://arxiv.org/pdf/2507.16204", "abs": "https://arxiv.org/abs/2507.16204", "authors": ["Li-Hsiang Shen", "Jyun-Jhe Huang"], "title": "CHIMERA: Compressed Hybrid Intelligence for Twin-Model Enhanced Multi-Agent Deep Reinforcement Learning for Multi-Functional RIS-Assisted Space-Air-Ground Integrated Networks", "comment": null, "summary": "A space-air-ground integrated network (SAGIN) architecture is proposed,\nempowered by multi-functional reconfigurable intelligent surfaces (MF-RIS)\ncapable of simultaneously reflecting, amplifying, and harvesting wireless\nenergy. The MF-RIS plays a pivotal role in addressing the energy shortages of\nlow-Earth orbit (LEO) satellites operating in shadowed regions, while\nexplicitly accounting for both communication and computing energy consumption\nacross the SAGIN nodes. To maximize the long-term energy efficiency (EE), we\nformulate a joint optimization problem over the MF-RIS parameters, including\nsignal amplification, phase-shifts, energy harvesting ratio, and active element\nselection as well as the SAGIN parameters of beamforming vectors, high-altitude\nplatform station (HAPS) deployment, user association, and computing capability.\nThe formulated problem is highly non-convex and non-linear and contains mixed\ndiscrete-continuous parameters. To tackle this, we conceive a compressed hybrid\nintelligence for twin-model enhanced multi-agent deep reinforcement learning\n(CHIMERA) framework, which integrates semantic state-action compression and\nparametrized sharing under hybrid reinforcement learning to efficiently explore\nsuitable complex actions. The simulation results have demonstrated that the\nproposed CHIMERA scheme substantially outperforms the conventional benchmarks,\nincluding fixed-configuration or non-harvesting MF-RIS, traditional RIS, and\nno-RIS cases, as well as centralized and multi-agent deep reinforcement\nlearning baselines in terms of the highest EE. Moreover, the proposed\nSAGIN-MF-RIS architecture achieves superior EE performance due to its\ncomplementary coverage, offering notable advantages over either standalone\nsatellite, aerial, or ground-only deployments.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16201", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16201", "abs": "https://arxiv.org/abs/2507.16201", "authors": ["Yuwei Jia", "Zhe Cui", "Fei Su"], "title": "A Single-step Accurate Fingerprint Registration Method Based on Local Feature Matching", "comment": null, "summary": "Distortion of the fingerprint images leads to a decline in fingerprint\nrecognition performance, and fingerprint registration can mitigate this\ndistortion issue by accurately aligning two fingerprint images. Currently,\nfingerprint registration methods often consist of two steps: an initial\nregistration based on minutiae, and a dense registration based on matching\npoints. However, when the quality of fingerprint image is low, the number of\ndetected minutiae is reduced, leading to frequent failures in the initial\nregistration, which ultimately causes the entire fingerprint registration\nprocess to fail. In this study, we propose an end-to-end single-step\nfingerprint registration algorithm that aligns two fingerprints by directly\npredicting the semi-dense matching points correspondences between two\nfingerprints. Thus, our method minimizes the risk of minutiae registration\nfailure and also leverages global-local attentions to achieve end-to-end\npixel-level alignment between the two fingerprints. Experiment results prove\nthat our method can achieve the state-of-the-art matching performance with only\nsingle-step registration, and it can also be used in conjunction with dense\nregistration algorithms for further performance improvements.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16331", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.16331", "abs": "https://arxiv.org/abs/2507.16331", "authors": ["Chuanhao Yan", "Fengdi Che", "Xuhan Huang", "Xu Xu", "Xin Li", "Yizhi Li", "Xingwei Qu", "Jingzhe Shi", "Zhuangzhuang He", "Chenghua Lin", "Yaodong Yang", "Binhang Yuan", "Hang Zhao", "Yu Qiao", "Bowen Zhou", "Jie Fu"], "title": "Re:Form -- Reducing Human Priors in Scalable Formal Software Verification with RL in LLMs: A Preliminary Study on Dafny", "comment": null, "summary": "Existing informal language-based (e.g., human language) Large Language Models\n(LLMs) trained with Reinforcement Learning (RL) face a significant challenge:\ntheir verification processes, which provide crucial training signals, are\nneither reliable nor scalable. In fact, the prevalent large proprietary models\ncould hardly generate verifiable programs. A promising yet largely uncharted\nalternative is formal language-based reasoning. Grounding LLMs in rigorous\nformal systems where generative models operate in formal language spaces (e.g.,\nDafny) enables the automatic and mathematically provable verification of their\nreasoning processes and outcomes. This capability is pivotal for achieving\nlarge-scale, reliable formal software verification. It is a common practice to\nemploy human-annotated chain-of-thought and other human priors to induce the\nreasoning and coding capabilities of LLMs. Unfortunately, it becomes\nunacceptably all-consuming to provide such priors for supervising complex\nprogramming tasks. In this work, we systematically explore ways to reduce human\npriors with the formal language, Dafny, as the main environment for our pilot\nstudy. Our pipeline mainly relies on introducing an automatic and scalable data\ncuration pipeline, and careful RL designs integrated with feedback from the\nformal language verifier. We introduce DafnyComp, a benchmark of compositional\nformal programs with auto-formalized specifications for specification\nreasoning. Our supervised fine-tuning (SFT) stage enables even small models\n(e.g., 0.5B) to generate syntactically valid and verifiable Dafny code,\nsurpassing proprietary models. RL with regularization further improves\nperformance, achieving stronger generalization to out-of-domain tasks and\noutperforming all strong baselines on the challenging DafnyComp benchmark.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16322", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16322", "abs": "https://arxiv.org/abs/2507.16322", "authors": ["Fred Mutisya", "Shikoh Gitau", "Christine Syovata", "Diana Oigara", "Ibrahim Matende", "Muna Aden", "Munira Ali", "Ryan Nyotu", "Diana Marion", "Job Nyangena", "Nasubo Ongoma", "Keith Mbae", "Elizabeth Wamicha", "Eric Mibuari", "Jean Philbert Nsengemana", "Talkmore Chidede"], "title": "Mind the Gap: Evaluating the Representativeness of Quantitative Medical Language Reasoning LLM Benchmarks for African Disease Burdens", "comment": "Preprint. 26 pages, includes appendix and tables", "summary": "Introduction: Existing medical LLM benchmarks largely reflect examination\nsyllabi and disease profiles from high income settings, raising questions about\ntheir validity for African deployment where malaria, HIV, TB, sickle cell\ndisease and other neglected tropical diseases (NTDs) dominate burden and\nnational guidelines drive care. Methodology: We systematically reviewed 31\nquantitative LLM evaluation papers (Jan 2019 May 2025) identifying 19 English\nmedical QA benchmarks. Alama Health QA was developed using a retrieval\naugmented generation framework anchored on the Kenyan Clinical Practice\nGuidelines. Six widely used sets (AfriMedQA, MMLUMedical, PubMedQA, MedMCQA,\nMedQAUSMLE, and guideline grounded Alama Health QA) underwent harmonized\nsemantic profiling (NTD proportion, recency, readability, lexical diversity\nmetrics) and blinded expert rating across five dimensions: clinical relevance,\nguideline alignment, clarity, distractor plausibility, and language/cultural\nfit. Results: Alama Health QA captured >40% of all NTD mentions across corpora\nand the highest within set frequencies for malaria (7.7%), HIV (4.1%), and TB\n(5.2%); AfriMedQA ranked second but lacked formal guideline linkage. Global\nbenchmarks showed minimal representation (e.g., sickle cell disease absent in\nthree sets) despite large scale. Qualitatively, Alama scored highest for\nrelevance and guideline alignment; PubMedQA lowest for clinical utility.\nDiscussion: Quantitative medical LLM benchmarks widely used in the literature\nunderrepresent African disease burdens and regulatory contexts, risking\nmisleading performance claims. Guideline anchored, regionally curated resources\nsuch as Alama Health QA and expanded disease specific derivatives are essential\nfor safe, equitable model evaluation and deployment across African health\nsystems.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16473", "categories": ["cs.AI", "I.2.7"], "pdf": "https://arxiv.org/pdf/2507.16473", "abs": "https://arxiv.org/abs/2507.16473", "authors": ["Chang Li", "Yaren Zhang", "Haoran Lv", "Qiong Cao", "Chao Xue", "Xiaodong He"], "title": "Learning Temporal Abstractions via Variational Homomorphisms in Option-Induced Abstract MDPs", "comment": null, "summary": "Large Language Models (LLMs) have shown remarkable reasoning ability through\nexplicit Chain-of-Thought (CoT) prompting, but generating these step-by-step\ntextual explanations is computationally expensive and slow. To overcome this,\nwe aim to develop a framework for efficient, implicit reasoning, where the\nmodel \"thinks\" in a latent space without generating explicit text for every\nstep. We propose that these latent thoughts can be modeled as\ntemporally-extended abstract actions, or options, within a hierarchical\nreinforcement learning framework. To effectively learn a diverse library of\noptions as latent embeddings, we first introduce the Variational Markovian\nOption Critic (VMOC), an off-policy algorithm that uses variational inference\nwithin the HiT-MDP framework. To provide a rigorous foundation for using these\noptions as an abstract reasoning space, we extend the theory of continuous MDP\nhomomorphisms. This proves that learning a policy in the simplified, abstract\nlatent space, for which VMOC is suited, preserves the optimality of the\nsolution to the original, complex problem. Finally, we propose a cold-start\nprocedure that leverages supervised fine-tuning (SFT) data to distill human\nreasoning demonstrations into this latent option space, providing a rich\ninitialization for the model's reasoning capabilities. Extensive experiments\ndemonstrate that our approach achieves strong performance on complex logical\nreasoning benchmarks and challenging locomotion tasks, validating our framework\nas a principled method for learning abstract skills for both language and\ncontrol.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16572", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2507.16572", "abs": "https://arxiv.org/abs/2507.16572", "authors": ["Mohamad Ballout", "Serwan Jassim", "Elia Bruni"], "title": "Pixels to Principles: Probing Intuitive Physics Understanding in Multimodal Language Models", "comment": null, "summary": "This paper presents a systematic evaluation of state-of-the-art multimodal\nlarge language models (MLLMs) on intuitive physics tasks using the GRASP and\nIntPhys 2 datasets. We assess the open-source models InternVL 2.5, Qwen 2.5 VL,\nLLaVA-OneVision, and the proprietary Gemini 2.0 Flash Thinking, finding that\neven the latest models struggle to reliably distinguish physically plausible\nfrom implausible scenarios. To go beyond performance metrics, we conduct a\nprobing analysis of model embeddings, extracting intermediate representations\nat key processing stages to examine how well task-relevant information is\npreserved. Our results show that, depending on task difficulty, a critical\nvision-language misalignment can emerge: vision encoders successfully capture\nphysical plausibility cues, but this information is not effectively utilized by\nthe language model, leading to failures in reasoning. This misalignment\nsuggests that the primary limitation of MLLMs in intuitive physics tasks is not\nthe vision component but the ineffective integration of visual and linguistic\ninformation. Our findings highlight vision-language alignment as a key area for\nimprovement, offering insights for future MLLMs development.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16632", "categories": ["cs.CL", "cs.SD", "eess.AS"], "pdf": "https://arxiv.org/pdf/2507.16632", "abs": "https://arxiv.org/abs/2507.16632", "authors": ["Boyong Wu", "Chao Yan", "Chen Hu", "Cheng Yi", "Chengli Feng", "Fei Tian", "Feiyu Shen", "Gang Yu", "Haoyang Zhang", "Jingbei Li", "Mingrui Chen", "Peng Liu", "Wang You", "Xiangyu Tony Zhang", "Xingyuan Li", "Xuerui Yang", "Yayue Deng", "Yechang Huang", "Yuxin Li", "Yuxin Zhang", "Zhao You", "Brian Li", "Changyi Wan", "Hanpeng Hu", "Jiangjie Zhen", "Siyu Chen", "Song Yuan", "Xuelin Zhang", "Yimin Jiang", "Yu Zhou", "Yuxiang Yang", "Bingxin Li", "Buyun Ma", "Changhe Song", "Dongqing Pang", "Guoqiang Hu", "Haiyang Sun", "Kang An", "Na Wang", "Shuli Gao", "Wei Ji", "Wen Li", "Wen Sun", "Xuan Wen", "Yong Ren", "Yuankai Ma", "Yufan Lu", "Bin Wang", "Bo Li", "Changxin Miao", "Che Liu", "Chen Xu", "Dapeng Shi", "Dingyuan Hu", "Donghang Wu", "Enle Liu", "Guanzhe Huang", "Gulin Yan", "Han Zhang", "Hao Nie", "Haonan Jia", "Hongyu Zhou", "Jianjian Sun", "Jiaoren Wu", "Jie Wu", "Jie Yang", "Jin Yang", "Junzhe Lin", "Kaixiang Li", "Lei Yang", "Liying Shi", "Li Zhou", "Longlong Gu", "Ming Li", "Mingliang Li", "Mingxiao Li", "Nan Wu", "Qi Han", "Qinyuan Tan", "Shaoliang Pang", "Shengjie Fan", "Siqi Liu", "Tiancheng Cao", "Wanying Lu", "Wenqing He", "Wuxun Xie", "Xu Zhao", "Xueqi Li", "Yanbo Yu", "Yang Yang", "Yi Liu", "Yifan Lu", "Yilei Wang", "Yuanhao Ding", "Yuanwei Liang", "Yuanwei Lu", "Yuchu Luo", "Yuhe Yin", "Yumeng Zhan", "Yuxiang Zhang", "Zidong Yang", "Zixin Zhang", "Binxing Jiao", "Daxin Jiang", "Heung-Yeung Shum", "Jiansheng Chen", "Jing Li", "Xiangyu Zhang", "Yibo Zhu"], "title": "Step-Audio 2 Technical Report", "comment": null, "summary": "This paper presents Step-Audio~2, an end-to-end multi-modal large language\nmodel designed for industry-strength audio understanding and speech\nconversation. By integrating a latent audio encoder and reasoning-centric\nreinforcement learning (RL), Step-Audio 2 achieves promising performance in\nautomatic speech recognition (ASR) and audio understanding. To facilitate\ngenuine end-to-end speech conversation, Step-Audio 2 incorporates the\ngeneration of discrete audio tokens into language modeling, significantly\nenhancing its responsiveness to paralinguistic information such as speaking\nstyles and emotions. To effectively leverage the rich textual and acoustic\nknowledge in real-world data, Step-Audio 2 integrates retrieval-augmented\ngeneration (RAG) and is able to call external tools such as web search to\nmitigate hallucination and audio search to switch timbres. Trained on millions\nof hours of speech and audio data, Step-Audio 2 delivers intelligence and\nexpressiveness across diverse conversational scenarios. Evaluation results\ndemonstrate that Step-Audio 2 achieves state-of-the-art performance on various\naudio understanding and conversational benchmarks compared to other open-source\nand commercial solutions. Please visit\nhttps://github.com/stepfun-ai/Step-Audio2 for more information.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16341", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16341", "abs": "https://arxiv.org/abs/2507.16341", "authors": ["Mingtao Guo", "Guanyu Xing", "Yanci Zhang", "Yanli Liu"], "title": "Navigating Large-Pose Challenge for High-Fidelity Face Reenactment with Video Diffusion Model", "comment": null, "summary": "Face reenactment aims to generate realistic talking head videos by\ntransferring motion from a driving video to a static source image while\npreserving the source identity. Although existing methods based on either\nimplicit or explicit keypoints have shown promise, they struggle with large\npose variations due to warping artifacts or the limitations of coarse facial\nlandmarks. In this paper, we present the Face Reenactment Video Diffusion model\n(FRVD), a novel framework for high-fidelity face reenactment under large pose\nchanges. Our method first employs a motion extractor to extract implicit facial\nkeypoints from the source and driving images to represent fine-grained motion\nand to perform motion alignment through a warping module. To address the\ndegradation introduced by warping, we introduce a Warping Feature Mapper (WFM)\nthat maps the warped source image into the motion-aware latent space of a\npretrained image-to-video (I2V) model. This latent space encodes rich priors of\nfacial dynamics learned from large-scale video data, enabling effective warping\ncorrection and enhancing temporal coherence. Extensive experiments show that\nFRVD achieves superior performance over existing methods in terms of pose\naccuracy, identity preservation, and visual quality, especially in challenging\nscenarios with extreme pose variations.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "fine-grained"], "score": 2}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16635", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16635", "abs": "https://arxiv.org/abs/2507.16635", "authors": ["Ali Mohamed Ali", "Luca Tirel", "Hashim A. Hashim"], "title": "Novel Multi-Agent Action Masked Deep Reinforcement Learning for General Industrial Assembly Lines Balancing Problems", "comment": null, "summary": "Efficient planning of activities is essential for modern industrial assembly\nlines to uphold manufacturing standards, prevent project constraint violations,\nand achieve cost-effective operations. While exact solutions to such challenges\ncan be obtained through Integer Programming (IP), the dependence of the search\nspace on input parameters often makes IP computationally infeasible for\nlarge-scale scenarios. Heuristic methods, such as Genetic Algorithms, can also\nbe applied, but they frequently produce suboptimal solutions in extensive\ncases. This paper introduces a novel mathematical model of a generic industrial\nassembly line formulated as a Markov Decision Process (MDP), without imposing\nassumptions on the type of assembly line a notable distinction from most\nexisting models. The proposed model is employed to create a virtual environment\nfor training Deep Reinforcement Learning (DRL) agents to optimize task and\nresource scheduling. To enhance the efficiency of agent training, the paper\nproposes two innovative tools. The first is an action-masking technique, which\nensures the agent selects only feasible actions, thereby reducing training\ntime. The second is a multi-agent approach, where each workstation is managed\nby an individual agent, as a result, the state and action spaces were reduced.\nA centralized training framework with decentralized execution is adopted,\noffering a scalable learning architecture for optimizing industrial assembly\nlines. This framework allows the agents to learn offline and subsequently\nprovide real-time solutions during operations by leveraging a neural network\nthat maps the current factory state to the optimal action. The effectiveness of\nthe proposed scheme is validated through numerical simulations, demonstrating\nsignificantly faster convergence to the optimal solution compared to a\ncomparable model-based approach.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16663", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16663", "abs": "https://arxiv.org/abs/2507.16663", "authors": ["Yujin Han", "Hao Chen", "Andi Han", "Zhiheng Wang", "Xinyu Lin", "Yingya Zhang", "Shiwei Zhang", "Difan Zou"], "title": "Self-Contradiction as Self-Improvement: Mitigating the Generation-Understanding Gap in MLLMs", "comment": "19 pages, 9 figures, 3 tables", "summary": "Despite efforts to unify multimodal generation and understanding tasks in a\nsingle model, we show these MLLMs exhibit self-contradiction where generation\nproduces images deemed misaligned with input prompts based on the model's own\nunderstanding. We define a Nonunified score that quantifies such\nself-contradiction. Our empirical results reveal that the self-contradiction\nmainly arises from weak generation that fails to align with prompts, rather\nthan misunderstanding. This capability asymmetry indicates the potential of\nleveraging self-contradiction for self-improvement, where the stronger model\nunderstanding guides the weaker generation to mitigate the\ngeneration-understanding gap. Applying standard post-training methods (e.g.,\nSFT, DPO) with such internal supervision successfully improves both generation\nand unification. We discover a co-improvement effect on both generation and\nunderstanding when only fine-tuning the generation branch, a phenomenon known\nin pre-training but underexplored in post-training. Our analysis shows\nimprovements stem from better detection of false positives that are previously\nincorrectly identified as prompt-aligned. Theoretically, we show the aligned\ntraining dynamics between generation and understanding allow reduced\nprompt-misaligned generations to also improve mismatch detection in the\nunderstanding branch. Additionally, the framework reveals a potential risk of\nco-degradation under poor supervision-an overlooked phenomenon that is\nempirically validated in our experiments. Notably, we find intrinsic metrics\nlike Nonunified score cannot distinguish co-degradation from co-improvement,\nwhich highlights the necessity of data quality check. Finally, we propose a\ncurriculum-based strategy based on our findings that gradually introduces\nharder samples as the model improves, leading to better unification and\nimproved MLLM generation and understanding.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["DPO"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16670", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16670", "abs": "https://arxiv.org/abs/2507.16670", "authors": ["Amandeep Kaur", "Gyan Prakash"], "title": "Adaptive Inventory Strategies using Deep Reinforcement Learning for Dynamic Agri-Food Supply Chains", "comment": null, "summary": "Agricultural products are often subject to seasonal fluctuations in\nproduction and demand. Predicting and managing inventory levels in response to\nthese variations can be challenging, leading to either excess inventory or\nstockouts. Additionally, the coordination among stakeholders at various level\nof food supply chain is not considered in the existing body of literature. To\nbridge these research gaps, this study focuses on inventory management of\nagri-food products under demand and lead time uncertainties. By implementing\neffective inventory replenishment policy results in maximize the overall profit\nthroughout the supply chain. However, the complexity of the problem increases\ndue to these uncertainties and shelf-life of the product, that makes\nchallenging to implement traditional approaches to generate optimal set of\nsolutions. Thus, the current study propose a novel Deep Reinforcement Learning\n(DRL) algorithm that combines the benefits of both value- and policy-based DRL\napproaches for inventory optimization under uncertainties. The proposed\nalgorithm can incentivize collaboration among stakeholders by aligning their\ninterests and objectives through shared optimization goal of maximizing\nprofitability along the agri-food supply chain while considering perishability,\nand uncertainty simultaneously. By selecting optimal order quantities with\ncontinuous action space, the proposed algorithm effectively addresses the\ninventory optimization challenges. To rigorously evaluate this algorithm, the\nempirical data from fresh agricultural products supply chain inventory is\nconsidered. Experimental results corroborate the improved performance of the\nproposed inventory replenishment policy under stochastic demand patterns and\nlead time scenarios. The research findings hold managerial implications for\npolicymakers to manage the inventory of agricultural products more effectively\nunder uncertainty.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16796", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16796", "abs": "https://arxiv.org/abs/2507.16796", "authors": ["Mian Ibad Ali Shah", "Enda Barrett", "Karl Mason"], "title": "Uncertainty-Aware Knowledge Transformers for Peer-to-Peer Energy Trading with Multi-Agent Reinforcement Learning", "comment": "7 pages, 4 figures, 1 table, Proceedings of the Main Track of the\n  European Conference on Artificial Intelligence (ECAI 2025), October 25-30,\n  2025", "summary": "This paper presents a novel framework for Peer-to-Peer (P2P) energy trading\nthat integrates uncertainty-aware prediction with multi-agent reinforcement\nlearning (MARL), addressing a critical gap in current literature. In contrast\nto previous works relying on deterministic forecasts, the proposed approach\nemploys a heteroscedastic probabilistic transformer-based prediction model\ncalled Knowledge Transformer with Uncertainty (KTU) to explicitly quantify\nprediction uncertainty, which is essential for robust decision-making in the\nstochastic environment of P2P energy trading. The KTU model leverages\ndomain-specific features and is trained with a custom loss function that\nensures reliable probabilistic forecasts and confidence intervals for each\nprediction. Integrating these uncertainty-aware forecasts into the MARL\nframework enables agents to optimize trading strategies with a clear\nunderstanding of risk and variability. Experimental results show that the\nuncertainty-aware Deep Q-Network (DQN) reduces energy purchase costs by up to\n5.7% without P2P trading and 3.2% with P2P trading, while increasing\nelectricity sales revenue by 6.4% and 44.7%, respectively. Additionally, peak\nhour grid demand is reduced by 38.8% without P2P and 45.6% with P2P. These\nimprovements are even more pronounced when P2P trading is enabled, highlighting\nthe synergy between advanced forecasting and market mechanisms for resilient,\neconomically efficient energy communities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16397", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16397", "abs": "https://arxiv.org/abs/2507.16397", "authors": ["Kahim Wong", "Jicheng Zhou", "Haiwei Wu", "Yain-Whar Si", "Jiantao Zhou"], "title": "ADCD-Net: Robust Document Image Forgery Localization via Adaptive DCT Feature and Hierarchical Content Disentanglement", "comment": null, "summary": "The advancement of image editing tools has enabled malicious manipulation of\nsensitive document images, underscoring the need for robust document image\nforgery detection.Though forgery detectors for natural images have been\nextensively studied, they struggle with document images, as the tampered\nregions can be seamlessly blended into the uniform document background (BG) and\nstructured text. On the other hand, existing document-specific methods lack\nsufficient robustness against various degradations, which limits their\npractical deployment. This paper presents ADCD-Net, a robust document forgery\nlocalization model that adaptively leverages the RGB/DCT forensic traces and\nintegrates key characteristics of document images. Specifically, to address the\nDCT traces' sensitivity to block misalignment, we adaptively modulate the DCT\nfeature contribution based on a predicted alignment score, resulting in much\nimproved resilience to various distortions, including resizing and cropping.\nAlso, a hierarchical content disentanglement approach is proposed to boost the\nlocalization performance via mitigating the text-BG disparities. Furthermore,\nnoticing the predominantly pristine nature of BG regions, we construct a\npristine prototype capturing traces of untampered regions, and eventually\nenhance both the localization accuracy and robustness. Our proposed ADCD-Net\ndemonstrates superior forgery localization performance, consistently\noutperforming state-of-the-art methods by 20.79\\% averaged over 5 types of\ndistortions. The code is available at https://github.com/KAHIMWONG/ACDC-Net.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16443", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16443", "abs": "https://arxiv.org/abs/2507.16443", "authors": ["Kai Deng", "Zexin Ti", "Jiawei Xu", "Jian Yang", "Jin Xie"], "title": "VGGT-Long: Chunk it, Loop it, Align it -- Pushing VGGT's Limits on Kilometer-scale Long RGB Sequences", "comment": null, "summary": "Foundation models for 3D vision have recently demonstrated remarkable\ncapabilities in 3D perception. However, extending these models to large-scale\nRGB stream 3D reconstruction remains challenging due to memory limitations. In\nthis work, we propose VGGT-Long, a simple yet effective system that pushes the\nlimits of monocular 3D reconstruction to kilometer-scale, unbounded outdoor\nenvironments. Our approach addresses the scalability bottlenecks of existing\nmodels through a chunk-based processing strategy combined with overlapping\nalignment and lightweight loop closure optimization. Without requiring camera\ncalibration, depth supervision or model retraining, VGGT-Long achieves\ntrajectory and reconstruction performance comparable to traditional methods. We\nevaluate our method on KITTI, Waymo, and Virtual KITTI datasets. VGGT-Long not\nonly runs successfully on long RGB sequences where foundation models typically\nfail, but also produces accurate and consistent geometry across various\nconditions. Our results highlight the potential of leveraging foundation models\nfor scalable monocular 3D scene in real-world settings, especially for\nautonomous driving scenarios. Code is available at\nhttps://github.com/DengKaiCQ/VGGT-Long.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16518", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.16518", "abs": "https://arxiv.org/abs/2507.16518", "authors": ["Xiuwei Chen", "Wentao Hu", "Hanhui Li", "Jun Zhou", "Zisheng Chen", "Meng Cao", "Yihan Zeng", "Kui Zhang", "Yu-Jie Yuan", "Jianhua Han", "Hang Xu", "Xiaodan Liang"], "title": "C2-Evo: Co-Evolving Multimodal Data and Model for Self-Improving Reasoning", "comment": null, "summary": "Recent advances in multimodal large language models (MLLMs) have shown\nimpressive reasoning capabilities. However, further enhancing existing MLLMs\nnecessitates high-quality vision-language datasets with carefully curated task\ncomplexities, which are both costly and challenging to scale. Although recent\nself-improving models that iteratively refine themselves offer a feasible\nsolution, they still suffer from two core challenges: (i) most existing methods\naugment visual or textual data separately, resulting in discrepancies in data\ncomplexity (e.g., over-simplified diagrams paired with redundant textual\ndescriptions); and (ii) the evolution of data and models is also separated,\nleading to scenarios where models are exposed to tasks with mismatched\ndifficulty levels. To address these issues, we propose C2-Evo, an automatic,\nclosed-loop self-improving framework that jointly evolves both training data\nand model capabilities. Specifically, given a base dataset and a base model,\nC2-Evo enhances them by a cross-modal data evolution loop and a data-model\nevolution loop. The former loop expands the base dataset by generating complex\nmultimodal problems that combine structured textual sub-problems with\niteratively specified geometric diagrams, while the latter loop adaptively\nselects the generated problems based on the performance of the base model, to\nconduct supervised fine-tuning and reinforcement learning alternately.\nConsequently, our method continuously refines its model and training data, and\nconsistently obtains considerable performance gains across multiple\nmathematical reasoning benchmarks. Our code, models, and datasets will be\nreleased.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "mathematical reasoning"], "score": 2}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16518", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.16518", "abs": "https://arxiv.org/abs/2507.16518", "authors": ["Xiuwei Chen", "Wentao Hu", "Hanhui Li", "Jun Zhou", "Zisheng Chen", "Meng Cao", "Yihan Zeng", "Kui Zhang", "Yu-Jie Yuan", "Jianhua Han", "Hang Xu", "Xiaodan Liang"], "title": "C2-Evo: Co-Evolving Multimodal Data and Model for Self-Improving Reasoning", "comment": null, "summary": "Recent advances in multimodal large language models (MLLMs) have shown\nimpressive reasoning capabilities. However, further enhancing existing MLLMs\nnecessitates high-quality vision-language datasets with carefully curated task\ncomplexities, which are both costly and challenging to scale. Although recent\nself-improving models that iteratively refine themselves offer a feasible\nsolution, they still suffer from two core challenges: (i) most existing methods\naugment visual or textual data separately, resulting in discrepancies in data\ncomplexity (e.g., over-simplified diagrams paired with redundant textual\ndescriptions); and (ii) the evolution of data and models is also separated,\nleading to scenarios where models are exposed to tasks with mismatched\ndifficulty levels. To address these issues, we propose C2-Evo, an automatic,\nclosed-loop self-improving framework that jointly evolves both training data\nand model capabilities. Specifically, given a base dataset and a base model,\nC2-Evo enhances them by a cross-modal data evolution loop and a data-model\nevolution loop. The former loop expands the base dataset by generating complex\nmultimodal problems that combine structured textual sub-problems with\niteratively specified geometric diagrams, while the latter loop adaptively\nselects the generated problems based on the performance of the base model, to\nconduct supervised fine-tuning and reinforcement learning alternately.\nConsequently, our method continuously refines its model and training data, and\nconsistently obtains considerable performance gains across multiple\nmathematical reasoning benchmarks. Our code, models, and datasets will be\nreleased.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "mathematical reasoning"], "score": 2}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16154", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16154", "abs": "https://arxiv.org/abs/2507.16154", "authors": ["Jyun-Ze Tang", "Chih-Fan Hsu", "Jeng-Lin Li", "Ming-Ching Chang", "Wei-Chao Chen"], "title": "LSSGen: Leveraging Latent Space Scaling in Flow and Diffusion for Efficient Text to Image Generation", "comment": "ICCV AIGENS 2025", "summary": "Flow matching and diffusion models have shown impressive results in\ntext-to-image generation, producing photorealistic images through an iterative\ndenoising process. A common strategy to speed up synthesis is to perform early\ndenoising at lower resolutions. However, traditional methods that downscale and\nupscale in pixel space often introduce artifacts and distortions. These issues\narise when the upscaled images are re-encoded into the latent space, leading to\ndegraded final image quality. To address this, we propose {\\bf Latent Space\nScaling Generation (LSSGen)}, a framework that performs resolution scaling\ndirectly in the latent space using a lightweight latent upsampler. Without\naltering the Transformer or U-Net architecture, LSSGen improves both efficiency\nand visual quality while supporting flexible multi-resolution generation. Our\ncomprehensive evaluation covering text-image alignment and perceptual quality\nshows that LSSGen significantly outperforms conventional scaling approaches.\nWhen generating $1024^2$ images at similar speeds, it achieves up to 246\\%\nTOPIQ score improvement.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16746", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.16746", "abs": "https://arxiv.org/abs/2507.16746", "authors": ["Ang Li", "Charles Wang", "Kaiyu Yue", "Zikui Cai", "Ollie Liu", "Deqing Fu", "Peng Guo", "Wang Bill Zhu", "Vatsal Sharan", "Robin Jia", "Willie Neiswanger", "Furong Huang", "Tom Goldstein", "Micah Goldblum"], "title": "Zebra-CoT: A Dataset for Interleaved Vision Language Reasoning", "comment": "dataset link:\n  https://huggingface.co/datasets/multimodal-reasoning-lab/Zebra-CoT", "summary": "Humans often use visual aids, for example diagrams or sketches, when solving\ncomplex problems. Training multimodal models to do the same, known as Visual\nChain of Thought (Visual CoT), is challenging due to: (1) poor off-the-shelf\nvisual CoT performance, which hinders reinforcement learning, and (2) the lack\nof high-quality visual CoT training data. We introduce $\\textbf{Zebra-CoT}$, a\ndiverse large-scale dataset with 182,384 samples, containing logically coherent\ninterleaved text-image reasoning traces. We focus on four categories of tasks\nwhere sketching or visual reasoning is especially natural, spanning scientific\nquestions such as geometry, physics, and algorithms; 2D visual reasoning tasks\nlike visual search and jigsaw puzzles; 3D reasoning tasks including 3D\nmulti-hop inference, embodied and robot planning; visual logic problems and\nstrategic games like chess. Fine-tuning the Anole-7B model on the Zebra-CoT\ntraining corpus results in an improvement of +12% in our test-set accuracy and\nyields up to +13% performance gain on standard VLM benchmark evaluations.\nFine-tuning Bagel-7B yields a model that generates high-quality interleaved\nvisual reasoning chains, underscoring Zebra-CoT's effectiveness for developing\nmultimodal reasoning abilities. We open-source our dataset and models to\nsupport development and evaluation of visual CoT.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale", "chain of thought"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "accuracy"], "score": 4}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16608", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2507.16608", "abs": "https://arxiv.org/abs/2507.16608", "authors": ["Xueming Fu", "Pei Wu", "Yingtai Li", "Xin Luo", "Zihang Jiang", "Junhao Mei", "Jian Lu", "Gao-Jun Teng", "S. Kevin Zhou"], "title": "Dyna3DGR: 4D Cardiac Motion Tracking with Dynamic 3D Gaussian Representation", "comment": "Accepted to MICCAI 2025", "summary": "Accurate analysis of cardiac motion is crucial for evaluating cardiac\nfunction. While dynamic cardiac magnetic resonance imaging (CMR) can capture\ndetailed tissue motion throughout the cardiac cycle, the fine-grained 4D\ncardiac motion tracking remains challenging due to the homogeneous nature of\nmyocardial tissue and the lack of distinctive features. Existing approaches can\nbe broadly categorized into image based and representation-based, each with its\nlimitations. Image-based methods, including both raditional and deep\nlearning-based registration approaches, either struggle with topological\nconsistency or rely heavily on extensive training data. Representation-based\nmethods, while promising, often suffer from loss of image-level details. To\naddress these limitations, we propose Dynamic 3D Gaussian Representation\n(Dyna3DGR), a novel framework that combines explicit 3D Gaussian representation\nwith implicit neural motion field modeling. Our method simultaneously optimizes\ncardiac structure and motion in a self-supervised manner, eliminating the need\nfor extensive training data or point-to-point correspondences. Through\ndifferentiable volumetric rendering, Dyna3DGR efficiently bridges continuous\nmotion representation with image-space alignment while preserving both\ntopological and temporal consistency. Comprehensive evaluations on the ACDC\ndataset demonstrate that our approach surpasses state-of-the-art deep\nlearning-based diffeomorphic registration methods in tracking accuracy. The\ncode will be available in https://github.com/windrise/Dyna3DGR.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "consistency", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16663", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2507.16663", "abs": "https://arxiv.org/abs/2507.16663", "authors": ["Yujin Han", "Hao Chen", "Andi Han", "Zhiheng Wang", "Xinyu Lin", "Yingya Zhang", "Shiwei Zhang", "Difan Zou"], "title": "Self-Contradiction as Self-Improvement: Mitigating the Generation-Understanding Gap in MLLMs", "comment": "19 pages, 9 figures, 3 tables", "summary": "Despite efforts to unify multimodal generation and understanding tasks in a\nsingle model, we show these MLLMs exhibit self-contradiction where generation\nproduces images deemed misaligned with input prompts based on the model's own\nunderstanding. We define a Nonunified score that quantifies such\nself-contradiction. Our empirical results reveal that the self-contradiction\nmainly arises from weak generation that fails to align with prompts, rather\nthan misunderstanding. This capability asymmetry indicates the potential of\nleveraging self-contradiction for self-improvement, where the stronger model\nunderstanding guides the weaker generation to mitigate the\ngeneration-understanding gap. Applying standard post-training methods (e.g.,\nSFT, DPO) with such internal supervision successfully improves both generation\nand unification. We discover a co-improvement effect on both generation and\nunderstanding when only fine-tuning the generation branch, a phenomenon known\nin pre-training but underexplored in post-training. Our analysis shows\nimprovements stem from better detection of false positives that are previously\nincorrectly identified as prompt-aligned. Theoretically, we show the aligned\ntraining dynamics between generation and understanding allow reduced\nprompt-misaligned generations to also improve mismatch detection in the\nunderstanding branch. Additionally, the framework reveals a potential risk of\nco-degradation under poor supervision-an overlooked phenomenon that is\nempirically validated in our experiments. Notably, we find intrinsic metrics\nlike Nonunified score cannot distinguish co-degradation from co-improvement,\nwhich highlights the necessity of data quality check. Finally, we propose a\ncurriculum-based strategy based on our findings that gradually introduces\nharder samples as the model improves, leading to better unification and\nimproved MLLM generation and understanding.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["DPO"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16746", "categories": ["cs.CV", "cs.CL", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.16746", "abs": "https://arxiv.org/abs/2507.16746", "authors": ["Ang Li", "Charles Wang", "Kaiyu Yue", "Zikui Cai", "Ollie Liu", "Deqing Fu", "Peng Guo", "Wang Bill Zhu", "Vatsal Sharan", "Robin Jia", "Willie Neiswanger", "Furong Huang", "Tom Goldstein", "Micah Goldblum"], "title": "Zebra-CoT: A Dataset for Interleaved Vision Language Reasoning", "comment": "dataset link:\n  https://huggingface.co/datasets/multimodal-reasoning-lab/Zebra-CoT", "summary": "Humans often use visual aids, for example diagrams or sketches, when solving\ncomplex problems. Training multimodal models to do the same, known as Visual\nChain of Thought (Visual CoT), is challenging due to: (1) poor off-the-shelf\nvisual CoT performance, which hinders reinforcement learning, and (2) the lack\nof high-quality visual CoT training data. We introduce $\\textbf{Zebra-CoT}$, a\ndiverse large-scale dataset with 182,384 samples, containing logically coherent\ninterleaved text-image reasoning traces. We focus on four categories of tasks\nwhere sketching or visual reasoning is especially natural, spanning scientific\nquestions such as geometry, physics, and algorithms; 2D visual reasoning tasks\nlike visual search and jigsaw puzzles; 3D reasoning tasks including 3D\nmulti-hop inference, embodied and robot planning; visual logic problems and\nstrategic games like chess. Fine-tuning the Anole-7B model on the Zebra-CoT\ntraining corpus results in an improvement of +12% in our test-set accuracy and\nyields up to +13% performance gain on standard VLM benchmark evaluations.\nFine-tuning Bagel-7B yields a model that generates high-quality interleaved\nvisual reasoning chains, underscoring Zebra-CoT's effectiveness for developing\nmultimodal reasoning abilities. We open-source our dataset and models to\nsupport development and evaluation of visual CoT.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale", "chain of thought"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset", "accuracy"], "score": 4}}, "source_file": "2025-07-23.jsonl"}
{"id": "2507.16761", "categories": ["cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2507.16761", "abs": "https://arxiv.org/abs/2507.16761", "authors": ["Marcel Kleinmann", "Shashank Agnihotri", "Margret Keuper"], "title": "Faithful, Interpretable Chest X-ray Diagnosis with Anti-Aliased B-cos Networks", "comment": null, "summary": "Faithfulness and interpretability are essential for deploying deep neural\nnetworks (DNNs) in safety-critical domains such as medical imaging. B-cos\nnetworks offer a promising solution by replacing standard linear layers with a\nweight-input alignment mechanism, producing inherently interpretable,\nclass-specific explanations without post-hoc methods. While maintaining\ndiagnostic performance competitive with state-of-the-art DNNs, standard B-cos\nmodels suffer from severe aliasing artifacts in their explanation maps, making\nthem unsuitable for clinical use where clarity is essential. Additionally, the\noriginal B-cos formulation is limited to multi-class settings, whereas chest\nX-ray analysis often requires multi-label classification due to co-occurring\nabnormalities. In this work, we address both limitations: (1) we introduce\nanti-aliasing strategies using FLCPooling (FLC) and BlurPool (BP) to\nsignificantly improve explanation quality, and (2) we extend B-cos networks to\nsupport multi-label classification. Our experiments on chest X-ray datasets\ndemonstrate that the modified $\\text{B-cos}_\\text{FLC}$ and\n$\\text{B-cos}_\\text{BP}$ preserve strong predictive performance while providing\nfaithful and artifact-free explanations suitable for clinical application in\nmulti-label settings. Code available at:\n$\\href{https://github.com/mkleinma/B-cos-medical-paper}{GitHub repository}$.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["safety"], "score": 1}}, "source_file": "2025-07-23.jsonl"}
