{"id": "2504.12083", "pdf": "https://arxiv.org/pdf/2504.12083", "abs": "https://arxiv.org/abs/2504.12083", "authors": ["Pritam Sarkar", "Ali Etemad"], "title": "Self-alignment of Large Video Language Models with Refined Regularized Preference Optimization", "categories": ["cs.CV"], "comment": null, "summary": "Despite recent advances in Large Video Language Models (LVLMs), they still\nstruggle with fine-grained temporal understanding, hallucinate, and often make\nsimple mistakes on even simple video question-answering tasks, all of which\npose significant challenges to their safe and reliable deployment in real-world\napplications. To address these limitations, we propose a self-alignment\nframework that enables LVLMs to learn from their own errors. Our proposed\nframework first obtains a training set of preferred and non-preferred response\npairs, where non-preferred responses are generated by incorporating common\nerror patterns that often occur due to inadequate spatio-temporal\nunderstanding, spurious correlations between co-occurring concepts, and\nover-reliance on linguistic cues while neglecting the vision modality, among\nothers. To facilitate self-alignment of LVLMs with the constructed preferred\nand non-preferred response pairs, we introduce Refined Regularized Preference\nOptimization (RRPO), a novel preference optimization method that utilizes\nsub-sequence-level refined rewards and token-wise KL regularization to address\nthe limitations of Direct Preference Optimization (DPO). We demonstrate that\nRRPO achieves more precise alignment and more stable training compared to DPO.\nOur experiments and analysis validate the effectiveness of our approach across\ndiverse video tasks, including video hallucination, short- and long-video\nunderstanding, and fine-grained temporal reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference", "alignment", "DPO", "direct preference optimization"], "score": 4}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11468", "pdf": "https://arxiv.org/pdf/2504.11468", "abs": "https://arxiv.org/abs/2504.11468", "authors": ["Hardy Chen", "Haoqin Tu", "Fali Wang", "Hui Liu", "Xianfeng Tang", "Xinya Du", "Yuyin Zhou", "Cihang Xie"], "title": "SFT or RL? An Early Investigation into Training R1-Like Reasoning Large Vision-Language Models", "categories": ["cs.CL"], "comment": null, "summary": "This work revisits the dominant supervised fine-tuning (SFT) then\nreinforcement learning (RL) paradigm for training Large Vision-Language Models\n(LVLMs), and reveals a key finding: SFT can significantly undermine subsequent\nRL by inducing ``pseudo reasoning paths'' imitated from expert models. While\nthese paths may resemble the native reasoning paths of RL models, they often\ninvolve prolonged, hesitant, less informative steps, and incorrect reasoning.\nTo systematically study this effect, we introduce VLAA-Thinking, a new\nmultimodal dataset designed to support reasoning in LVLMs. Constructed via a\nsix-step pipeline involving captioning, reasoning distillation, answer rewrite\nand verification, VLAA-Thinking comprises high-quality, step-by-step visual\nreasoning traces for SFT, along with a more challenging RL split from the same\ndata source. Using this dataset, we conduct extensive experiments comparing\nSFT, RL and their combinations. Results show that while SFT helps models learn\nreasoning formats, it often locks aligned models into imitative, rigid\nreasoning modes that impede further learning. In contrast, building on the\nGroup Relative Policy Optimization (GRPO) with a novel mixed reward module\nintegrating both perception and cognition signals, our RL approach fosters more\ngenuine, adaptive reasoning behavior. Notably, our model VLAA-Thinker, based on\nQwen2.5VL 3B, achieves top-1 performance on Open LMM Reasoning Leaderboard\n(https://huggingface.co/spaces/opencompass/Open_LMM_Reasoning_Leaderboard)\namong 4B scale LVLMs, surpassing the previous state-of-the-art by 1.8%. We hope\nour findings provide valuable insights in developing reasoning-capable LVLMs\nand can inform future research in this area.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11914", "pdf": "https://arxiv.org/pdf/2504.11914", "abs": "https://arxiv.org/abs/2504.11914", "authors": ["Yuhao Chao", "Jie Liu", "Jie Tang", "Gangshan Wu"], "title": "AnomalyR1: A GRPO-based End-to-end MLLM for Industrial Anomaly Detection", "categories": ["cs.CV"], "comment": null, "summary": "Industrial Anomaly Detection (IAD) poses a formidable challenge due to the\nscarcity of defective samples, making it imperative to deploy models capable of\nrobust generalization to detect unseen anomalies effectively. Traditional\napproaches, often constrained by hand-crafted features or domain-specific\nexpert models, struggle to address this limitation, underscoring the need for a\nparadigm shift. We introduce AnomalyR1, a pioneering framework that leverages\nVLM-R1, a Multimodal Large Language Model (MLLM) renowned for its exceptional\ngeneralization and interpretability, to revolutionize IAD. By integrating MLLM\nwith Group Relative Policy Optimization (GRPO), enhanced by our novel Reasoned\nOutcome Alignment Metric (ROAM), AnomalyR1 achieves a fully end-to-end solution\nthat autonomously processes inputs of image and domain knowledge, reasons\nthrough analysis, and generates precise anomaly localizations and masks. Based\non the latest multimodal IAD benchmark, our compact 3-billion-parameter model\noutperforms existing methods, establishing state-of-the-art results. As MLLM\ncapabilities continue to advance, this study is the first to deliver an\nend-to-end VLM-based IAD solution that demonstrates the transformative\npotential of ROAM-enhanced GRPO, positioning our framework as a forward-looking\ncornerstone for next-generation intelligent anomaly detection systems in\nindustrial applications with limited defective data.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["policy optimization", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11536", "pdf": "https://arxiv.org/pdf/2504.11536", "abs": "https://arxiv.org/abs/2504.11536", "authors": ["Jiazhan Feng", "Shijue Huang", "Xingwei Qu", "Ge Zhang", "Yujia Qin", "Baoquan Zhong", "Chengquan Jiang", "Jinxin Chi", "Wanjun Zhong"], "title": "ReTool: Reinforcement Learning for Strategic Tool Use in LLMs", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "While reasoning models (e.g., DeepSeek R1) trained with reinforcement\nlearning (RL), excel in textual reasoning, they struggle in scenarios requiring\nstructured problem-solving, such as geometric reasoning, concise computation,\nor complex equation solving-areas where computational tools like code\ninterpreters (CI) demonstrate distinct advantages. To bridge this gap, we\npropose ReTool, which enhances long-form reasoning with tool-integrated\nlearning, including two key features: (1) dynamic interleaving of real-time\ncode execution within natural language reasoning processes, and (2) an\nautomated RL paradigm that allows policy rollouts with multi-turn real-time\ncode execution and teaches the model in learning when and how to invoke tools\nbased on outcome feedback. ReTool employs a systematic training framework,\nbeginning with synthetic cold-start data generation to produce code-augmented\nlong-form reasoning traces for fine-tuning base models. Subsequent RL training\nleverages task outcomes as rewards to iteratively refine the model's tool use\nstrategy, enabling autonomous discovery of optimal tool invocation patterns\nwithout human priors. Experiments on the challenging MATH Olympiad benchmark\nAIME demonstrate ReTool's superiority: Our 32B model achieves 67% accuracy with\n400 training steps, outperforming text-based RL baseline (40% accuracy, 1080\nsteps) in efficiency and performance. Remarkably, ReTool-32B attains 72.5%\naccuracy in extended settings, surpassing OpenAI's o1-preview by 27.9%. Further\nanalysis reveals emergent behaviors such as code self-correction, signaling an\n''aha moment'' in which the model autonomously masters adaptive tool use. These\nfindings highlight the promise of outcome-driven tool integration for advancing\ncomplex mathematical reasoning and offer new insights into hybrid\nneuro-symbolic systems.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["o1", "self-correction"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "accuracy", "mathematical reasoning"], "score": 3}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11477", "pdf": "https://arxiv.org/pdf/2504.11477", "abs": "https://arxiv.org/abs/2504.11477", "authors": ["Yunkai Zhang", "Shiyin Wei", "Yong Huang", "Yawu Su", "Shanshan Lu", "Hui Li"], "title": "SDIGLM: Leveraging Large Language Models and Multi-Modal Chain of Thought for Structural Damage Identification", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "Existing computer vision(CV)-based structural damage identification models\ndemonstrate notable accuracy in categorizing and localizing damage. However,\nthese models present several critical limitations that hinder their practical\napplication in civil engineering(CE). Primarily, their ability to recognize\ndamage types remains constrained, preventing comprehensive analysis of the\nhighly varied and complex conditions encountered in real-world CE structures.\nSecond, these models lack linguistic capabilities, rendering them unable to\narticulate structural damage characteristics through natural language\ndescriptions. With the continuous advancement of artificial intelligence(AI),\nlarge multi-modal models(LMMs) have emerged as a transformative solution,\nenabling the unified encoding and alignment of textual and visual data. These\nmodels can autonomously generate detailed descriptive narratives of structural\ndamage while demonstrating robust generalization across diverse scenarios and\ntasks. This study introduces SDIGLM, an innovative LMM for structural damage\nidentification, developed based on the open-source VisualGLM-6B architecture.\nTo address the challenge of adapting LMMs to the intricate and varied operating\nconditions in CE, this work integrates a U-Net-based semantic segmentation\nmodule to generate defect segmentation maps as visual Chain of Thought(CoT).\nAdditionally, a multi-round dialogue fine-tuning dataset is constructed to\nenhance logical reasoning, complemented by a language CoT formed through prompt\nengineering. By leveraging this multi-modal CoT, SDIGLM surpasses\ngeneral-purpose LMMs in structural damage identification, achieving an accuracy\nof 95.24% across various infrastructure types. Moreover, the model effectively\ndescribes damage characteristics such as hole size, crack direction, and\ncorrosion severity.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["chain of thought"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy", "dialogue"], "score": 3}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11478", "pdf": "https://arxiv.org/pdf/2504.11478", "abs": "https://arxiv.org/abs/2504.11478", "authors": ["Hao Kang", "Stathi Fotiadis", "Liming Jiang", "Qing Yan", "Yumin Jia", "Zichuan Liu", "Min Jin Chong", "Xin Lu"], "title": "Flux Already Knows - Activating Subject-Driven Image Generation without Training", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "We propose a simple yet effective zero-shot framework for subject-driven\nimage generation using a vanilla Flux model. By framing the task as grid-based\nimage completion and simply replicating the subject image(s) in a mosaic\nlayout, we activate strong identity-preserving capabilities without any\nadditional data, training, or inference-time fine-tuning. This \"free lunch\"\napproach is further strengthened by a novel cascade attention design and meta\nprompting technique, boosting fidelity and versatility. Experimental results\nshow that our method outperforms baselines across multiple key metrics in\nbenchmarks and human preference studies, with trade-offs in certain aspects.\nAdditionally, it supports diverse edits, including logo insertion, virtual\ntry-on, and subject replacement or insertion. These results demonstrate that a\npre-trained foundational text-to-image model can enable high-quality,\nresource-efficient subject-driven generation, opening new possibilities for\nlightweight customization in downstream applications.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["human preference"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11669", "pdf": "https://arxiv.org/pdf/2504.11669", "abs": "https://arxiv.org/abs/2504.11669", "authors": ["Amirhossein Dadashzadeh", "Parsa Esmati", "Majid Mirmehdi"], "title": "Co-STAR: Collaborative Curriculum Self-Training with Adaptive Regularization for Source-Free Video Domain Adaptation", "categories": ["cs.CV"], "comment": null, "summary": "Recent advances in Source-Free Unsupervised Video Domain Adaptation (SFUVDA)\nleverage vision-language models to enhance pseudo-label generation. However,\nchallenges such as noisy pseudo-labels and over-confident predictions limit\ntheir effectiveness in adapting well across domains. We propose Co-STAR, a\nnovel framework that integrates curriculum learning with collaborative\nself-training between a source-trained teacher and a contrastive\nvision-language model (CLIP). Our curriculum learning approach employs a\nreliability-based weight function that measures bidirectional prediction\nalignment between the teacher and CLIP, balancing between confident and\nuncertain predictions. This function preserves uncertainty for difficult\nsamples, while prioritizing reliable pseudo-labels when the predictions from\nboth models closely align. To further improve adaptation, we propose Adaptive\nCurriculum Regularization, which modifies the learning priority of samples in a\nprobabilistic, adaptive manner based on their confidence scores and prediction\nstability, mitigating overfitting to noisy and over-confident samples.\nExtensive experiments across multiple video domain adaptation benchmarks\ndemonstrate that Co-STAR consistently outperforms state-of-the-art SFUVDA\nmethods. Code is available at: https://github.com/Plrbear/Co-Star", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["reliability"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11952", "pdf": "https://arxiv.org/pdf/2504.11952", "abs": "https://arxiv.org/abs/2504.11952", "authors": ["Ram Mohan Rao Kadiyala", "Siddartha Pullakhandam", "Kanwal Mehreen", "Drishti Sharma", "Siddhant Gupta", "Jebish Purbey", "Ashay Srivastava", "Subhasya TippaReddy", "Arvind Reddy Bobbili", "Suraj Telugara Chandrashekhar", "Modabbir Adeeb", "Srinadh Vura", "Hamza Farooq"], "title": "Robust and Fine-Grained Detection of AI Generated Texts", "categories": ["cs.CL", "cs.AI", "cs.LG"], "comment": "ACL 2025 Feb ARR Submission", "summary": "An ideal detection system for machine generated content is supposed to work\nwell on any generator as many more advanced LLMs come into existence day by\nday. Existing systems often struggle with accurately identifying AI-generated\ncontent over shorter texts. Further, not all texts might be entirely authored\nby a human or LLM, hence we focused more over partial cases i.e human-LLM\nco-authored texts. Our paper introduces a set of models built for the task of\ntoken classification which are trained on an extensive collection of\nhuman-machine co-authored texts, which performed well over texts of unseen\ndomains, unseen generators, texts by non-native speakers and those with\nadversarial inputs. We also introduce a new dataset of over 2.4M such texts\nmostly co-authored by several popular proprietary LLMs over 23 languages. We\nalso present findings of our models' performance over each texts of each domain\nand generator. Additional findings include comparison of performance against\neach adversarial method, length of input texts and characteristics of generated\ntexts compared to the original human authored texts.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "fine-grained"], "score": 2}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11972", "pdf": "https://arxiv.org/pdf/2504.11972", "abs": "https://arxiv.org/abs/2504.11972", "authors": ["Xanh Ho", "Jiahao Huang", "Florian Boudin", "Akiko Aizawa"], "title": "LLM-as-a-Judge: Reassessing the Performance of LLMs in Extractive QA", "categories": ["cs.CL"], "comment": "17 pages; code and data are available at\n  https://github.com/Alab-NII/llm-judge-extract-qa", "summary": "Extractive reading comprehension question answering (QA) datasets are\ntypically evaluated using Exact Match (EM) and F1-score, but these metrics\noften fail to fully capture model performance. With the success of large\nlanguage models (LLMs), they have been employed in various tasks, including\nserving as judges (LLM-as-a-judge). In this paper, we reassess the performance\nof QA models using LLM-as-a-judge across four reading comprehension QA\ndatasets. We examine different families of LLMs and various answer types to\nevaluate the effectiveness of LLM-as-a-judge in these tasks. Our results show\nthat LLM-as-a-judge is highly correlated with human judgments and can replace\ntraditional EM/F1 metrics. By using LLM-as-a-judge, the correlation with human\njudgments improves significantly, from 0.17 (EM) and 0.36 (F1-score) to 0.85.\nThese findings confirm that EM and F1 metrics underestimate the true\nperformance of the QA models. While LLM-as-a-judge is not perfect for more\ndifficult answer types (e.g., job), it still outperforms EM/F1, and we observe\nno bias issues, such as self-preference, when the same model is used for both\nthe QA and judgment tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["correlation", "question answering"], "score": 2}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11986", "pdf": "https://arxiv.org/pdf/2504.11986", "abs": "https://arxiv.org/abs/2504.11986", "authors": ["Jose Manuel Guevara-Vela"], "title": "Language Models as Quasi-Crystalline Thought: Structure, Constraint, and Emergence in Generative Systems", "categories": ["cs.CL", "cs.AI"], "comment": null, "summary": "This essay proposes an analogy between large language models (LLMs) and\nquasicrystals: systems that exhibit global coherence without periodic\nrepetition and that are generated through local constraints. While LLMs are\noften evaluated in terms of predictive accuracy, factuality, or alignment, this\nstructural perspective suggests that their most characteristic behavior is the\nproduction of internally resonant linguistic patterns. Just as quasicrystals\nforced a redefinition of order in physical systems, viewing LLMs as generators\nof quasi-structured language opens new paths for evaluation and design:\nprivileging propagation of constraint over token-level accuracy, and coherence\nof form over fixed meaning. LLM outputs should be read not only for what they\nsay, but for the patterns of constraint and coherence that organize them. This\nshift reframes generative language as a space of emergent patterning: LLMs are\nneither fully random nor strictly rule-based, but defined by a logic of\nconstraint, resonance, and structural depth.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "factuality", "accuracy"], "score": 3}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11779", "pdf": "https://arxiv.org/pdf/2504.11779", "abs": "https://arxiv.org/abs/2504.11779", "authors": ["Qishun Wang", "Zhengzheng Tu", "Chenglong Li", "Bo Jiang"], "title": "Multimodal Spatio-temporal Graph Learning for Alignment-free RGBT Video Object Detection", "categories": ["cs.CV"], "comment": null, "summary": "RGB-Thermal Video Object Detection (RGBT VOD) can address the limitation of\ntraditional RGB-based VOD in challenging lighting conditions, making it more\npractical and effective in many applications.\n  However, similar to most RGBT fusion tasks, it still mainly relies on\nmanually aligned multimodal image pairs.\n  In this paper, we propose a novel Multimodal Spatio-temporal Graph learning\nNetwork (MSGNet) for alignment-free RGBT VOD problem by leveraging the robust\ngraph representation learning model.\n  Specifically, we first design an Adaptive Partitioning Layer (APL) to\nestimate the corresponding regions of the Thermal image within the RGB image\n(high-resolution), achieving a preliminary inexact alignment.\n  Then, we introduce the Spatial Sparse Graph Learning Module (S-SGLM) which\nemploys a sparse information passing mechanism on the estimated inexact\nalignment to achieve reliable information interaction between different\nmodalities.\n  Moreover, to fully exploit the temporal cues for RGBT VOD problem, we\nintroduce Hybrid Structured Temporal Modeling (HSTM), which involves a Temporal\nSparse Graph Learning Module (T-SGLM) and Temporal Star Block (TSB). T-SGLM\naims to filter out some redundant information between adjacent frames by\nemploying the sparse aggregation mechanism on the temporal graph. Meanwhile,\nTSB is dedicated to achieving the complementary learning of local spatial\nrelationships.\n  Extensive comparative experiments conducted on both the aligned dataset\nVT-VOD50 and the unaligned dataset UVT-VOD2024 demonstrate the effectiveness\nand superiority of our proposed method. Our project will be made available on\nour website for free public access.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11786", "pdf": "https://arxiv.org/pdf/2504.11786", "abs": "https://arxiv.org/abs/2504.11786", "authors": ["Sang-Jun Park", "Keun-Soo Heo", "Dong-Hee Shin", "Young-Han Son", "Ji-Hye Oh", "Tae-Eui Kam"], "title": "DART: Disease-aware Image-Text Alignment and Self-correcting Re-alignment for Trustworthy Radiology Report Generation", "categories": ["cs.CV"], "comment": "The IEEE/CVF Conference on Computer Vision and Pattern Recognition\n  (CVPR) 2025", "summary": "The automatic generation of radiology reports has emerged as a promising\nsolution to reduce a time-consuming task and accurately capture critical\ndisease-relevant findings in X-ray images. Previous approaches for radiology\nreport generation have shown impressive performance. However, there remains\nsignificant potential to improve accuracy by ensuring that retrieved reports\ncontain disease-relevant findings similar to those in the X-ray images and by\nrefining generated reports. In this study, we propose a Disease-aware\nimage-text Alignment and self-correcting Re-alignment for Trustworthy radiology\nreport generation (DART) framework. In the first stage, we generate initial\nreports based on image-to-text retrieval with disease-matching, embedding both\nimages and texts in a shared embedding space through contrastive learning. This\napproach ensures the retrieval of reports with similar disease-relevant\nfindings that closely align with the input X-ray images. In the second stage,\nwe further enhance the initial reports by introducing a self-correction module\nthat re-aligns them with the X-ray images. Our proposed framework achieves\nstate-of-the-art results on two widely used benchmarks, surpassing previous\napproaches in both report generation and clinical efficacy metrics, thereby\nenhancing the trustworthiness of radiology reports.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["self-correction"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12216", "pdf": "https://arxiv.org/pdf/2504.12216", "abs": "https://arxiv.org/abs/2504.12216", "authors": ["Siyan Zhao", "Devaansh Gupta", "Qinqing Zheng", "Aditya Grover"], "title": "d1: Scaling Reasoning in Diffusion Large Language Models via Reinforcement Learning", "categories": ["cs.CL", "cs.LG"], "comment": "25 pages, project page at https://dllm-reasoning.github.io/", "summary": "Recent large language models (LLMs) have demonstrated strong reasoning\ncapabilities that benefits from online reinforcement learning (RL). These\ncapabilities have primarily been demonstrated within the left-to-right\nautoregressive (AR) generation paradigm. In contrast, non-autoregressive\nparadigms based on diffusion generate text in a coarse-to-fine manner. Although\nrecent diffusion-based large language models (dLLMs) have achieved competitive\nlanguage modeling performance compared to their AR counterparts, it remains\nunclear if dLLMs can also leverage recent advances in LLM reasoning. To this\nend, we propose d1, a framework to adapt pre-trained masked dLLMs into\nreasoning models via a combination of supervised finetuning (SFT) and RL.\nSpecifically, we develop and extend techniques to improve reasoning in\npretrained dLLMs: (a) we utilize a masked SFT technique to distill knowledge\nand instill self-improvement behavior directly from existing datasets, and (b)\nwe introduce a novel critic-free, policy-gradient based RL algorithm called\ndiffu-GRPO. Through empirical studies, we investigate the performance of\ndifferent post-training recipes on multiple mathematical and logical reasoning\nbenchmarks. We find that d1 yields the best performance and significantly\nimproves performance of a state-of-the-art dLLM.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scaling"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11820", "pdf": "https://arxiv.org/pdf/2504.11820", "abs": "https://arxiv.org/abs/2504.11820", "authors": ["Delong Suzhang", "Meng Yang"], "title": "Real-World Depth Recovery via Structure Uncertainty Modeling and Inaccurate GT Depth Fitting", "categories": ["cs.CV", "cs.AI"], "comment": null, "summary": "The low-quality structure in raw depth maps is prevalent in real-world RGB-D\ndatasets, which makes real-world depth recovery a critical task in recent\nyears. However, the lack of paired raw-ground truth (raw-GT) data in the real\nworld poses challenges for generalized depth recovery. Existing methods\ninsufficiently consider the diversity of structure misalignment in raw depth\nmaps, which leads to poor generalization in real-world depth recovery. Notably,\nrandom structure misalignments are not limited to raw depth data but also\naffect GT depth in real-world datasets. In the proposed method, we tackle the\ngeneralization problem from both input and output perspectives. For input, we\nenrich the diversity of structure misalignment in raw depth maps by designing a\nnew raw depth generation pipeline, which helps the network avoid overfitting to\na specific condition. Furthermore, a structure uncertainty module is designed\nto explicitly identify the misaligned structure for input raw depth maps to\nbetter generalize in unseen scenarios. Notably the well-trained depth\nfoundation model (DFM) can help the structure uncertainty module estimate the\nstructure uncertainty better. For output, a robust feature alignment module is\ndesigned to precisely align with the accurate structure of RGB images avoiding\nthe interference of inaccurate GT depth. Extensive experiments on multiple\ndatasets demonstrate the proposed method achieves competitive accuracy and\ngeneralization capabilities across various challenging raw depth maps.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11930", "pdf": "https://arxiv.org/pdf/2504.11930", "abs": "https://arxiv.org/abs/2504.11930", "authors": ["Hairui Ren", "Fan Tang", "He Zhao", "Zixuan Wang", "Dandan Guo", "Yi Chang"], "title": "Beyond Words: Augmenting Discriminative Richness via Diffusions in Unsupervised Prompt Learning", "categories": ["cs.CV"], "comment": null, "summary": "Fine-tuning vision-language models (VLMs) with large amounts of unlabeled\ndata has recently garnered significant interest. However, a key challenge\nremains the lack of high-quality pseudo-labeled data. Current pseudo-labeling\nstrategies often struggle with mismatches between semantic and visual\ninformation, leading to sub-optimal performance of unsupervised prompt learning\n(UPL) methods. In this paper, we introduce a simple yet effective approach\ncalled \\textbf{A}ugmenting D\\textbf{i}scriminative \\textbf{R}ichness via\nDiffusions (AiR), toward learning a richer discriminating way to represent the\nclass comprehensively and thus facilitate classification. Specifically, our\napproach includes a pseudo-label generation module that leverages high-fidelity\nsynthetic samples to create an auxiliary classifier, which captures richer\nvisual variation, bridging text-image-pair classification to a more robust\nimage-image-pair classification. Additionally, we exploit the diversity of\ndiffusion-based synthetic samples to enhance prompt learning, providing greater\ninformation for semantic-visual alignment. Extensive experiments on five public\nbenchmarks, including RESISC45 and Flowers102, and across three learning\nparadigms-UL, SSL, and TRZSL-demonstrate that AiR achieves substantial and\nconsistent performance improvements over state-of-the-art unsupervised prompt\nlearning methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11946", "pdf": "https://arxiv.org/pdf/2504.11946", "abs": "https://arxiv.org/abs/2504.11946", "authors": ["Haoyang Wang", "Liming Liu", "Peiheng Wang", "Junlin Hao", "Jiangkai Wu", "Xinggong Zhang"], "title": "R-Meshfusion: Reinforcement Learning Powered Sparse-View Mesh Reconstruction with Diffusion Priors", "categories": ["cs.CV"], "comment": null, "summary": "Mesh reconstruction from multi-view images is a fundamental problem in\ncomputer vision, but its performance degrades significantly under sparse-view\nconditions, especially in unseen regions where no ground-truth observations are\navailable. While recent advances in diffusion models have demonstrated strong\ncapabilities in synthesizing novel views from limited inputs, their outputs\noften suffer from visual artifacts and lack 3D consistency, posing challenges\nfor reliable mesh optimization. In this paper, we propose a novel framework\nthat leverages diffusion models to enhance sparse-view mesh reconstruction in a\nprincipled and reliable manner. To address the instability of diffusion\noutputs, we propose a Consensus Diffusion Module that filters unreliable\ngenerations via interquartile range (IQR) analysis and performs variance-aware\nimage fusion to produce robust pseudo-supervision. Building on this, we design\nan online reinforcement learning strategy based on the Upper Confidence Bound\n(UCB) to adaptively select the most informative viewpoints for enhancement,\nguided by diffusion loss. Finally, the fused images are used to jointly\nsupervise a NeRF-based model alongside sparse-view ground truth, ensuring\nconsistency across both geometry and appearance. Extensive experiments\ndemonstrate that our method achieves significant improvements in both geometric\nquality and rendering quality.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11966", "pdf": "https://arxiv.org/pdf/2504.11966", "abs": "https://arxiv.org/abs/2504.11966", "authors": ["Linjuan Fan", "Di Wen", "Kunyu Peng", "Kailun Yang", "Jiaming Zhang", "Ruiping Liu", "Yufan Chen", "Junwei Zheng", "Jiamin Wu", "Xudong Han", "Rainer Stiefelhagen"], "title": "Exploring Video-Based Driver Activity Recognition under Noisy Labels", "categories": ["cs.CV", "cs.LG", "cs.RO", "eess.IV"], "comment": "The source code is available at\n  https://github.com/ilonafan/DAR-noisy-labels", "summary": "As an open research topic in the field of deep learning, learning with noisy\nlabels has attracted much attention and grown rapidly over the past ten years.\nLearning with label noise is crucial for driver distraction behavior\nrecognition, as real-world video data often contains mislabeled samples,\nimpacting model reliability and performance. However, label noise learning is\nbarely explored in the driver activity recognition field. In this paper, we\npropose the first label noise learning approach for the driver activity\nrecognition task. Based on the cluster assumption, we initially enable the\nmodel to learn clustering-friendly low-dimensional representations from given\nvideos and assign the resultant embeddings into clusters. We subsequently\nperform co-refinement within each cluster to smooth the classifier outputs.\nFurthermore, we propose a flexible sample selection strategy that combines two\nselection criteria without relying on any hyperparameters to filter clean\nsamples from the training dataset. We also incorporate a self-adaptive\nparameter into the sample selection process to enforce balancing across\nclasses. A comprehensive variety of experiments on the public Drive&Act dataset\nfor all granularity levels demonstrates the superior performance of our method\nin comparison with other label-denoising methods derived from the image\nclassification field. The source code is available at\nhttps://github.com/ilonafan/DAR-noisy-labels.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability", "criteria"], "score": 3}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11967", "pdf": "https://arxiv.org/pdf/2504.11967", "abs": "https://arxiv.org/abs/2504.11967", "authors": ["Yifei Dong", "Fengyi Wu", "Sanjian Zhang", "Guangyu Chen", "Yuzhi Hu", "Masumi Yano", "Jingdong Sun", "Siyu Huang", "Feng Liu", "Qi Dai", "Zhi-Qi Cheng"], "title": "Securing the Skies: A Comprehensive Survey on Anti-UAV Methods, Benchmarking, and Future Directions", "categories": ["cs.CV", "cs.AI", "cs.RO"], "comment": "Accepted at CVPR Workshop Anti-UAV 2025. 15 pages", "summary": "Unmanned Aerial Vehicles (UAVs) are indispensable for infrastructure\ninspection, surveillance, and related tasks, yet they also introduce critical\nsecurity challenges. This survey provides a wide-ranging examination of the\nanti-UAV domain, centering on three core objectives-classification, detection,\nand tracking-while detailing emerging methodologies such as diffusion-based\ndata synthesis, multi-modal fusion, vision-language modeling, self-supervised\nlearning, and reinforcement learning. We systematically evaluate\nstate-of-the-art solutions across both single-modality and multi-sensor\npipelines (spanning RGB, infrared, audio, radar, and RF) and discuss\nlarge-scale as well as adversarially oriented benchmarks. Our analysis reveals\npersistent gaps in real-time performance, stealth detection, and swarm-based\nscenarios, underscoring pressing needs for robust, adaptive anti-UAV systems.\nBy highlighting open research directions, we aim to foster innovation and guide\nthe development of next-generation defense strategies in an era marked by the\nextensive use of UAVs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12018", "pdf": "https://arxiv.org/pdf/2504.12018", "abs": "https://arxiv.org/abs/2504.12018", "authors": ["Xinli Yue", "JianHui Sun", "Junda Lu", "Liangchao Yao", "Fan Xia", "Tianyi Wang", "Fengyun Rao", "Jing Lyu", "Yuetang Deng"], "title": "Instruction-augmented Multimodal Alignment for Image-Text and Element Matching", "categories": ["cs.CV"], "comment": "Accepted to CVPR 2025 Workshop", "summary": "With the rapid advancement of text-to-image (T2I) generation models,\nassessing the semantic alignment between generated images and text descriptions\nhas become a significant research challenge. Current methods, including those\nbased on Visual Question Answering (VQA), still struggle with fine-grained\nassessments and precise quantification of image-text alignment. This paper\npresents an improved evaluation method named Instruction-augmented Multimodal\nAlignment for Image-Text and Element Matching (iMatch), which evaluates\nimage-text semantic alignment by fine-tuning multimodal large language models.\nWe introduce four innovative augmentation strategies: First, the QAlign\nstrategy creates a precise probabilistic mapping to convert discrete scores\nfrom multimodal large language models into continuous matching scores. Second,\na validation set augmentation strategy uses pseudo-labels from model\npredictions to expand training data, boosting the model's generalization\nperformance. Third, an element augmentation strategy integrates element\ncategory labels to refine the model's understanding of image-text matching.\nFourth, an image augmentation strategy employs techniques like random lighting\nto increase the model's robustness. Additionally, we propose prompt type\naugmentation and score perturbation strategies to further enhance the accuracy\nof element assessments. Our experimental results show that the iMatch method\nsignificantly surpasses existing methods, confirming its effectiveness and\npractical value. Furthermore, our iMatch won first place in the CVPR NTIRE 2025\nText to Image Generation Model Quality Assessment - Track 1 Image-Text\nAlignment.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "accuracy", "question answering", "fine-grained"], "score": 4}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12104", "pdf": "https://arxiv.org/pdf/2504.12104", "abs": "https://arxiv.org/abs/2504.12104", "authors": ["Shuo Li", "Fang Liu", "Zehua Hao", "Xinyi Wang", "Lingling Li", "Xu Liu", "Puhua Chen", "Wenping Ma"], "title": "Logits DeConfusion with CLIP for Few-Shot Learning", "categories": ["cs.CV"], "comment": "CVPR 2025", "summary": "With its powerful visual-language alignment capability, CLIP performs well in\nzero-shot and few-shot learning tasks. However, we found in experiments that\nCLIP's logits suffer from serious inter-class confusion problems in downstream\ntasks, and the ambiguity between categories seriously affects the accuracy. To\naddress this challenge, we propose a novel method called Logits DeConfusion,\nwhich effectively learns and eliminates inter-class confusion in logits by\ncombining our Multi-level Adapter Fusion (MAF) module with our Inter-Class\nDeconfusion (ICD) module. Our MAF extracts features from different levels and\nfuses them uniformly to enhance feature representation. Our ICD learnably\neliminates inter-class confusion in logits with a residual structure.\nExperimental results show that our method can significantly improve the\nclassification performance and alleviate the inter-class confusion problem. The\ncode is available at https://github.com/LiShuo1001/LDC.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12222", "pdf": "https://arxiv.org/pdf/2504.12222", "abs": "https://arxiv.org/abs/2504.12222", "authors": ["Yike Liu", "Jianhui Zhang", "Haipeng Li", "Shuaicheng Liu", "Bing Zeng"], "title": "Coding-Prior Guided Diffusion Network for Video Deblurring", "categories": ["cs.CV"], "comment": null, "summary": "While recent video deblurring methods have advanced significantly, they often\noverlook two valuable prior information: (1) motion vectors (MVs) and coding\nresiduals (CRs) from video codecs, which provide efficient inter-frame\nalignment cues, and (2) the rich real-world knowledge embedded in pre-trained\ndiffusion generative models. We present CPGDNet, a novel two-stage framework\nthat effectively leverages both coding priors and generative diffusion priors\nfor high-quality deblurring. First, our coding-prior feature propagation (CPFP)\nmodule utilizes MVs for efficient frame alignment and CRs to generate attention\nmasks, addressing motion inaccuracies and texture variations. Second, a\ncoding-prior controlled generation (CPC) module network integrates coding\npriors into a pretrained diffusion model, guiding it to enhance critical\nregions and synthesize realistic details. Experiments demonstrate our method\nachieves state-of-the-art perceptual quality with up to 30% improvement in IQA\nmetrics. Both the code and the codingprior-augmented dataset will be\nopen-sourced.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12259", "pdf": "https://arxiv.org/pdf/2504.12259", "abs": "https://arxiv.org/abs/2504.12259", "authors": ["Zhihang Yuan", "Rui Xie", "Yuzhang Shang", "Hanling Zhang", "Siyuan Wang", "Shengen Yan", "Guohao Dai", "Yu Wang"], "title": "VGDFR: Diffusion-based Video Generation with Dynamic Latent Frame Rate", "categories": ["cs.CV"], "comment": null, "summary": "Diffusion Transformer(DiT)-based generation models have achieved remarkable\nsuccess in video generation. However, their inherent computational demands pose\nsignificant efficiency challenges. In this paper, we exploit the inherent\ntemporal non-uniformity of real-world videos and observe that videos exhibit\ndynamic information density, with high-motion segments demanding greater detail\npreservation than static scenes. Inspired by this temporal non-uniformity, we\npropose VGDFR, a training-free approach for Diffusion-based Video Generation\nwith Dynamic Latent Frame Rate. VGDFR adaptively adjusts the number of elements\nin latent space based on the motion frequency of the latent space content,\nusing fewer tokens for low-frequency segments while preserving detail in\nhigh-frequency segments. Specifically, our key contributions are: (1) A dynamic\nframe rate scheduler for DiT video generation that adaptively assigns frame\nrates for video segments. (2) A novel latent-space frame merging method to\nalign latent representations with their denoised counterparts before merging\nthose redundant in low-resolution space. (3) A preference analysis of Rotary\nPositional Embeddings (RoPE) across DiT layers, informing a tailored RoPE\nstrategy optimized for semantic and local information capture. Experiments show\nthat VGDFR can achieve a speedup up to 3x for video generation with minimal\nquality degradation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11493", "pdf": "https://arxiv.org/pdf/2504.11493", "abs": "https://arxiv.org/abs/2504.11493", "authors": ["Azizul Zahid", "Jie Fan", "Farong Wang", "Ashton Dy", "Sai Swaminathan", "Fei Liu"], "title": "Toward Aligning Human and Robot Actions via Multi-Modal Demonstration Learning", "categories": ["cs.RO", "cs.AI", "cs.CV"], "comment": "ICRA'25 Workshop: Human-Centered Robot Learning in the Era of Big\n  Data and Large Models", "summary": "Understanding action correspondence between humans and robots is essential\nfor evaluating alignment in decision-making, particularly in human-robot\ncollaboration and imitation learning within unstructured environments. We\npropose a multimodal demonstration learning framework that explicitly models\nhuman demonstrations from RGB video with robot demonstrations in voxelized\nRGB-D space. Focusing on the \"pick and place\" task from the RH20T dataset, we\nutilize data from 5 users across 10 diverse scenes. Our approach combines\nResNet-based visual encoding for human intention modeling and a Perceiver\nTransformer for voxel-based robot action prediction. After 2000 training\nepochs, the human model reaches 71.67% accuracy, and the robot model achieves\n71.8% accuracy, demonstrating the framework's potential for aligning complex,\nmultimodal human and robot behaviors in manipulation tasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.11698", "pdf": "https://arxiv.org/pdf/2504.11698", "abs": "https://arxiv.org/abs/2504.11698", "authors": ["Xingwu Ji", "Haochen Niu", "Dexin Duan", "Rendong Ying", "Fei Wen", "Peilin Liu"], "title": "An Online Adaptation Method for Robust Depth Estimation and Visual Odometry in the Open World", "categories": ["cs.RO", "cs.CV"], "comment": "11 pages, 14 figures", "summary": "Recently, learning-based robotic navigation systems have gained extensive\nresearch attention and made significant progress. However, the diversity of\nopen-world scenarios poses a major challenge for the generalization of such\nsystems to practical scenarios. Specifically, learned systems for scene\nmeasurement and state estimation tend to degrade when the application scenarios\ndeviate from the training data, resulting to unreliable depth and pose\nestimation. Toward addressing this problem, this work aims to develop a visual\nodometry system that can fast adapt to diverse novel environments in an online\nmanner. To this end, we construct a self-supervised online adaptation framework\nfor monocular visual odometry aided by an online-updated depth estimation\nmodule. Firstly, we design a monocular depth estimation network with\nlightweight refiner modules, which enables efficient online adaptation. Then,\nwe construct an objective for self-supervised learning of the depth estimation\nmodule based on the output of the visual odometry system and the contextual\nsemantic information of the scene. Specifically, a sparse depth densification\nmodule and a dynamic consistency enhancement module are proposed to leverage\ncamera poses and contextual semantics to generate pseudo-depths and valid masks\nfor the online adaptation. Finally, we demonstrate the robustness and\ngeneralization capability of the proposed method in comparison with\nstate-of-the-art learning-based approaches on urban, in-house datasets and a\nrobot platform. Code is publicly available at:\nhttps://github.com/jixingwu/SOL-SLAM.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
{"id": "2504.12299", "pdf": "https://arxiv.org/pdf/2504.12299", "abs": "https://arxiv.org/abs/2504.12299", "authors": ["Marko Tot", "Shu Ishida", "Abdelhak Lemkhenter", "David Bignell", "Pallavi Choudhury", "Chris Lovett", "Luis Frana", "Matheus Ribeiro Furtado de Mendona", "Tarun Gupta", "Darren Gehring", "Sam Devlin", "Sergio Valcarcel Macua", "Raluca Georgescu"], "title": "Adapting a World Model for Trajectory Following in a 3D Game", "categories": ["cs.AI", "cs.CV", "cs.LG"], "comment": null, "summary": "Imitation learning is a powerful tool for training agents by leveraging\nexpert knowledge, and being able to replicate a given trajectory is an integral\npart of it. In complex environments, like modern 3D video games, distribution\nshift and stochasticity necessitate robust approaches beyond simple action\nreplay. In this study, we apply Inverse Dynamics Models (IDM) with different\nencoders and policy heads to trajectory following in a modern 3D video game --\nBleeding Edge. Additionally, we investigate several future alignment strategies\nthat address the distribution shift caused by the aleatoric uncertainty and\nimperfections of the agent. We measure both the trajectory deviation distance\nand the first significant deviation point between the reference and the agent's\ntrajectory and show that the optimal configuration depends on the chosen\nsetting. Our results show that in a diverse data setting, a GPT-style policy\nhead with an encoder trained from scratch performs the best, DINOv2 encoder\nwith the GPT-style policy head gives the best results in the low data regime,\nand both GPT-style and MLP-style policy heads had comparable results when\npre-trained on a diverse setting and fine-tuned for a specific behaviour\nsetting.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-04-17.jsonl"}
