{"id": "2506.19191", "categories": ["cs.AI", "cs.CL", "cs.GT", "math.LO", "68T05, 68Q87, 03E20", "I.2.6; I.2.3; F.1.1"], "pdf": "https://arxiv.org/pdf/2506.19191", "abs": "https://arxiv.org/abs/2506.19191", "authors": ["Craig Steven Wright"], "title": "Bayesian Evolutionary Swarm Architecture: A Formal Epistemic System Grounded in Truth-Based Competition", "comment": "83 pages, 14 sections, 92 formal results, no prior conference\n  publication", "summary": "We introduce a mathematically rigorous framework for an artificial\nintelligence system composed of probabilistic agents evolving through\nstructured competition and belief revision. The architecture, grounded in\nBayesian inference, measure theory, and population dynamics, defines agent\nfitness as a function of alignment with a fixed external oracle representing\nground truth. Agents compete in a discrete-time environment, adjusting\nposterior beliefs through observed outcomes, with higher-rated agents\nreproducing and lower-rated agents undergoing extinction. Ratings are updated\nvia pairwise truth-aligned utility comparisons, and belief updates preserve\nmeasurable consistency and stochastic convergence. We introduce hash-based\ncryptographic identity commitments to ensure traceability, alongside causal\ninference operators using do-calculus. Formal theorems on convergence,\nrobustness, and evolutionary stability are provided. The system establishes\ntruth as an evolutionary attractor, demonstrating that verifiable knowledge\narises from adversarial epistemic pressure within a computable, self-regulating\nswarm.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19235", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19235", "abs": "https://arxiv.org/abs/2506.19235", "authors": ["Yu Xie", "Xingkai Ren", "Ying Qi", "Yao Hu", "Lianlei Shan"], "title": "RecLLM-R1: A Two-Stage Training Paradigm with Reinforcement Learning and Chain-of-Thought v1", "comment": null, "summary": "Traditional recommendation systems often grapple with \"filter bubbles\",\nunderutilization of external knowledge, and a disconnect between model\noptimization and business policy iteration. To address these limitations, this\npaper introduces RecLLM-R1, a novel recommendation framework leveraging Large\nLanguage Models (LLMs) and drawing inspiration from the DeepSeek R1\nmethodology. The framework initiates by transforming user profiles, historical\ninteractions, and multi-faceted item attributes into LLM-interpretable natural\nlanguage prompts through a carefully engineered data construction process.\nSubsequently, a two-stage training paradigm is employed: the initial stage\ninvolves Supervised Fine-Tuning (SFT) to imbue the LLM with fundamental\nrecommendation capabilities. The subsequent stage utilizes Group Relative\nPolicy Optimization (GRPO), a reinforcement learning technique, augmented with\na Chain-of-Thought (CoT) mechanism. This stage guides the model through\nmulti-step reasoning and holistic decision-making via a flexibly defined reward\nfunction, aiming to concurrently optimize recommendation accuracy, diversity,\nand other bespoke business objectives. Empirical evaluations on a real-world\nuser behavior dataset from a large-scale social media platform demonstrate that\nRecLLM-R1 significantly surpasses existing baseline methods across a spectrum\nof evaluation metrics, including accuracy, diversity, and novelty. It\neffectively mitigates the filter bubble effect and presents a promising avenue\nfor the integrated optimization of recommendation models and policies under\nintricate business goals.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale", "multi-step reasoning"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset", "accuracy"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19466", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19466", "abs": "https://arxiv.org/abs/2506.19466", "authors": ["Cheng Li", "Jiexiong Liu", "Yixuan Chen", "Qihang Zhou", "KunLun Meta"], "title": "KunLunBaizeRAG: Reinforcement Learning Driven Inference Performance Leap for Large Language Models", "comment": null, "summary": "This paper introduces KunLunBaizeRAG, a reinforcement learning-driven\nreasoning framework designed to enhance the reasoning capabilities of large\nlanguage models (LLMs) in complex multi-hop question-answering tasks. The\nframework addresses key limitations of traditional RAG, such as retrieval\ndrift, information redundancy, and strategy rigidity. Key innovations include\nthe RAG-driven Reasoning Alignment (RDRA) mechanism, the Search-Think Iterative\nEnhancement (STIE) mechanism, the Network-Local Intelligent Routing (NLR)\nmechanism, and a progressive hybrid training strategy. Experimental results\ndemonstrate significant improvements in exact match (EM) and LLM-judged score\n(LJ) across four benchmarks, highlighting the framework's robustness and\neffectiveness in complex reasoning scenarios.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19530", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19530", "abs": "https://arxiv.org/abs/2506.19530", "authors": ["Carlo Romeo", "Andrew D. Bagdanov"], "title": "NTRL: Encounter Generation via Reinforcement Learning for Dynamic Difficulty Adjustment in Dungeons and Dragons", "comment": null, "summary": "Balancing combat encounters in Dungeons & Dragons (D&D) is a complex task\nthat requires Dungeon Masters (DM) to manually assess party strength, enemy\ncomposition, and dynamic player interactions while avoiding interruption of the\nnarrative flow. In this paper, we propose Encounter Generation via\nReinforcement Learning (NTRL), a novel approach that automates Dynamic\nDifficulty Adjustment (DDA) in D&D via combat encounter design. By framing the\nproblem as a contextual bandit, NTRL generates encounters based on real-time\nparty members attributes. In comparison with classic DM heuristics, NTRL\niteratively optimizes encounters to extend combat longevity (+200%), increases\ndamage dealt to party members, reducing post-combat hit points (-16.67%), and\nraises the number of player deaths while maintaining low total party kills\n(TPK). The intensification of combat forces players to act wisely and engage in\ntactical maneuvers, even though the generated encounters guarantee high win\nrates (70%). Even in comparison with encounters designed by human Dungeon\nMasters, NTRL demonstrates superior performance by enhancing the strategic\ndepth of combat while increasing difficulty in a manner that preserves overall\ngame fairness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "comparison"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19686", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19686", "abs": "https://arxiv.org/abs/2506.19686", "authors": ["Ching Fang", "Kanaka Rajan"], "title": "From memories to maps: Mechanisms of in context reinforcement learning in transformers", "comment": null, "summary": "Humans and animals show remarkable learning efficiency, adapting to new\nenvironments with minimal experience. This capability is not well captured by\nstandard reinforcement learning algorithms that rely on incremental value\nupdates. Rapid adaptation likely depends on episodic memory -- the ability to\nretrieve specific past experiences to guide decisions in novel contexts.\nTransformers provide a useful setting for studying these questions because of\ntheir ability to learn rapidly in-context and because their key-value\narchitecture resembles episodic memory systems in the brain. We train a\ntransformer to in-context reinforcement learn in a distribution of planning\ntasks inspired by rodent behavior. We then characterize the learning algorithms\nthat emerge in the model. We first find that representation learning is\nsupported by in-context structure learning and cross-context alignment, where\nrepresentations are aligned across environments with different sensory stimuli.\nWe next demonstrate that the reinforcement learning strategies developed by the\nmodel are not interpretable as standard model-free or model-based planning.\nInstead, we show that in-context reinforcement learning is supported by caching\nintermediate computations within the model's memory tokens, which are then\naccessed at decision time. Overall, we find that memory may serve as a\ncomputational resource, storing both raw experience and cached computations to\nsupport flexible behavior. Furthermore, the representations developed in the\nmodel resemble computations associated with the hippocampal-entorhinal system\nin the brain, suggesting that our findings may be relevant for natural\ncognition. Taken together, our work offers a mechanistic hypothesis for the\nrapid adaptation that underlies in-context learning in artificial and natural\nsettings.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "alignment"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19843", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19843", "abs": "https://arxiv.org/abs/2506.19843", "authors": ["Guo Li", "Zixiang Xu", "Wei Zhang", "Yikuan Hu", "Xinyu Yang", "Nikolay Aristov", "Mingjie Tang", "Elenna R Dugundji"], "title": "Temporal-IRL: Modeling Port Congestion and Berth Scheduling with Inverse Reinforcement Learning", "comment": "TRB2025", "summary": "Predicting port congestion is crucial for maintaining reliable global supply\nchains. Accurate forecasts enableimprovedshipment planning, reducedelaysand\ncosts, and optimizeinventoryanddistributionstrategies, thereby ensuring timely\ndeliveries and enhancing supply chain resilience. To achieve accurate\npredictions, analyzing vessel behavior and their stay times at specific port\nterminals is essential, focusing particularly on berth scheduling under various\nconditions. Crucially, the model must capture and learn the underlying\npriorities and patterns of berth scheduling. Berth scheduling and planning are\ninfluenced by a range of factors, including incoming vessel size, waiting\ntimes, and the status of vessels within the port terminal. By observing\nhistorical Automatic Identification System (AIS) positions of vessels, we\nreconstruct berth schedules, which are subsequently utilized to determine the\nreward function via Inverse Reinforcement Learning (IRL). For this purpose, we\nmodeled a specific terminal at the Port of New York/New Jersey and developed\nTemporal-IRL. This Temporal-IRL model learns berth scheduling to predict vessel\nsequencing at the terminal and estimate vessel port stay, encompassing both\nwaiting and berthing times, to forecast port congestion. Utilizing data from\nMaher Terminal spanning January 2015 to September 2023, we trained and tested\nthe model, achieving demonstrably excellent results.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reward function", "reinforcement learning"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19846", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19846", "abs": "https://arxiv.org/abs/2506.19846", "authors": ["Ai Han", "Junxing Hu", "Pu Wei", "Zhiqian Zhang", "Yuhang Guo", "Jiawei Lu", "Zicheng Zhang"], "title": "JoyAgents-R1: Joint Evolution Dynamics for Versatile Multi-LLM Agents with Reinforcement Learning", "comment": "33 pages, 7 figures, under review", "summary": "Multi-agent reinforcement learning (MARL) has emerged as a prominent paradigm\nfor increasingly complex tasks. However, joint evolution across heterogeneous\nagents remains challenging due to cooperative inefficiency and training\ninstability. In this paper, we propose the joint evolution dynamics for MARL\ncalled JoyAgents-R1, which first applies Group Relative Policy Optimization\n(GRPO) to the joint training of heterogeneous multi-agents. By iteratively\nrefining agents' large language models (LLMs) and memories, the method achieves\nholistic equilibrium with optimal decision-making and memory capabilities.\nSpecifically, JoyAgents-R1 first implements node-wise Monte Carlo sampling on\nthe behavior of each agent across entire reasoning trajectories to enhance GRPO\nsampling efficiency while maintaining policy diversity. Then, our marginal\nbenefit-driven selection strategy identifies top-$K$ sampling groups with\nmaximal reward fluctuations, enabling targeted agent model updates that improve\ntraining stability and maximize joint benefits through cost-effective parameter\nadjustments. Meanwhile, JoyAgents-R1 introduces an adaptive memory evolution\nmechanism that repurposes GRPO rewards as cost-free supervisory signals to\neliminate repetitive reasoning and accelerate convergence. Experiments across\ngeneral and domain-specific scenarios demonstrate that JoyAgents-R1 achieves\nperformance comparable to that of larger LLMs while built on smaller\nopen-source models.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning", "policy optimization"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19191", "categories": ["cs.AI", "cs.CL", "cs.GT", "math.LO", "68T05, 68Q87, 03E20", "I.2.6; I.2.3; F.1.1"], "pdf": "https://arxiv.org/pdf/2506.19191", "abs": "https://arxiv.org/abs/2506.19191", "authors": ["Craig Steven Wright"], "title": "Bayesian Evolutionary Swarm Architecture: A Formal Epistemic System Grounded in Truth-Based Competition", "comment": "83 pages, 14 sections, 92 formal results, no prior conference\n  publication", "summary": "We introduce a mathematically rigorous framework for an artificial\nintelligence system composed of probabilistic agents evolving through\nstructured competition and belief revision. The architecture, grounded in\nBayesian inference, measure theory, and population dynamics, defines agent\nfitness as a function of alignment with a fixed external oracle representing\nground truth. Agents compete in a discrete-time environment, adjusting\nposterior beliefs through observed outcomes, with higher-rated agents\nreproducing and lower-rated agents undergoing extinction. Ratings are updated\nvia pairwise truth-aligned utility comparisons, and belief updates preserve\nmeasurable consistency and stochastic convergence. We introduce hash-based\ncryptographic identity commitments to ensure traceability, alongside causal\ninference operators using do-calculus. Formal theorems on convergence,\nrobustness, and evolutionary stability are provided. The system establishes\ntruth as an evolutionary attractor, demonstrating that verifiable knowledge\narises from adversarial epistemic pressure within a computable, self-regulating\nswarm.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise", "alignment"], "score": 2}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19037", "categories": ["cs.CL", "cs.AI", "cs.IT", "cs.LG", "cs.NE", "math.IT"], "pdf": "https://arxiv.org/pdf/2506.19037", "abs": "https://arxiv.org/abs/2506.19037", "authors": ["Omer Luxembourg", "Haim Permuter", "Eliya Nachmani"], "title": "Plan for Speed -- Dilated Scheduling for Masked Diffusion Language Models", "comment": null, "summary": "Masked diffusion language models (MDLM) have shown strong promise for\nnon-autoregressive text generation, yet existing samplers act as implicit\nplanners, selecting tokens to unmask via denoiser confidence or entropy scores.\nSuch heuristics falter under parallel unmasking - they ignore pairwise\ninteractions between tokens and cannot account for dependencies when unmasking\nmultiple positions at once, limiting their inference time to traditional\nauto-regressive (AR) models. We introduce the Dilated-scheduled Unmasking\nStrategy (DUS), an inference-only, planner-model-free method that requires no\nadditional training. DUS leverages a first-order Markov assumption to partition\nsequence positions into dilation-based groups of non-adjacent tokens, enabling\nindependent, parallel unmasking steps that respect local context that minimizes\nthe joint entropy of each iteration step. Unlike semi-AR block approaches\n(e.g., LLADA and Dream) that still invoke the denoiser per block, DUS reduces\nthe number of denoiser calls to O(log B) per generation block - yielding\nsubstantial speedup over the O(B) run time of state-of-the-art diffusion\nmodels, where B is the block size in the semi-AR inference process. In\nexperiments on math (GSM8K) and code completion (Humaneval, MBPP) benchmarks -\ndomains suited to non-ordinal generation - DUS improves scores over parallel\nconfidence-based planner, without modifying the underlying denoiser. DUS offers\na lightweight, budget-aware approach to efficient, high-quality text\ngeneration, paving the way to unlock the true capabilities of MDLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19058", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19058", "abs": "https://arxiv.org/abs/2506.19058", "authors": ["Mike Zhang", "Rob van der Goot"], "title": "NLPnorth @ TalentCLEF 2025: Comparing Discriminative, Contrastive, and Prompt-Based Methods for Job Title and Skill Matching", "comment": "TalentCLEF 2025", "summary": "Matching job titles is a highly relevant task in the computational job market\ndomain, as it improves e.g., automatic candidate matching, career path\nprediction, and job market analysis. Furthermore, aligning job titles to job\nskills can be considered an extension to this task, with similar relevance for\nthe same downstream tasks. In this report, we outline NLPnorth's submission to\nTalentCLEF 2025, which includes both of these tasks: Multilingual Job Title\nMatching, and Job Title-Based Skill Prediction. For both tasks we compare\n(fine-tuned) classification-based, (fine-tuned) contrastive-based, and\nprompting methods. We observe that for Task A, our prompting approach performs\nbest with an average of 0.492 mean average precision (MAP) on test data,\naveraged over English, Spanish, and German. For Task B, we obtain an MAP of\n0.290 on test data with our fine-tuned classification-based approach.\nAdditionally, we made use of extra data by pulling all the language-specific\ntitles and corresponding \\emph{descriptions} from ESCO for each job and skill.\nOverall, we find that the largest multilingual language models perform best for\nboth tasks. Per the provisional results and only counting the unique teams, the\nranking on Task A is 5$^{\\text{th}}$/20 and for Task B 3$^{\\text{rd}}$/14.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19073", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19073", "abs": "https://arxiv.org/abs/2506.19073", "authors": ["Jackson Trager", "Francielle Vargas", "Diego Alves", "Matteo Guida", "Mikel K. Ngueajio", "Ameeta Agrawal", "Flor Plaza-del-Arco", "Yalda Daryanai", "Farzan Karimi-Malekabadi"], "title": "MFTCXplain: A Multilingual Benchmark Dataset for Evaluating the Moral Reasoning of LLMs through Hate Speech Multi-hop Explanation", "comment": "Under Review", "summary": "Ensuring the moral reasoning capabilities of Large Language Models (LLMs) is\na growing concern as these systems are used in socially sensitive tasks.\nNevertheless, current evaluation benchmarks present two major shortcomings: a\nlack of annotations that justify moral classifications, which limits\ntransparency and interpretability; and a predominant focus on English, which\nconstrains the assessment of moral reasoning across diverse cultural settings.\nIn this paper, we introduce MFTCXplain, a multilingual benchmark dataset for\nevaluating the moral reasoning of LLMs via hate speech multi-hop explanation\nusing Moral Foundation Theory (MFT). The dataset comprises 3,000 tweets across\nPortuguese, Italian, Persian, and English, annotated with binary hate speech\nlabels, moral categories, and text span-level rationales. Empirical results\nhighlight a misalignment between LLM outputs and human annotations in moral\nreasoning tasks. While LLMs perform well in hate speech detection (F1 up to\n0.836), their ability to predict moral sentiments is notably weak (F1 < 0.35).\nFurthermore, rationale alignment remains limited mainly in underrepresented\nlanguages. These findings show the limited capacity of current LLMs to\ninternalize and reflect human moral reasoning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "dataset"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18930", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18930", "abs": "https://arxiv.org/abs/2506.18930", "authors": ["Chong Di", "Shuwang Zhou", "Da Chen", "Jean-Marie Mirebeau", "Minglei Shu", "Laurent D. Cohen"], "title": "Reinforcement Learning-Based Dynamic Grouping for Tubular Structure Tracking", "comment": null, "summary": "The computation of minimal paths for the applications in tracking tubular\nstructures such as blood vessels and roads is challenged by complex\nmorphologies and environmental variations. Existing approaches can be roughly\ncategorized into two research lines: the point-wise based models and the\nsegment-wise based models. Although segment-wise approaches have obtained\npromising results in many scenarios, they often suffer from computational\ninefficiency and heavily rely on a prescribed prior to fit the target elongated\nshapes. We propose a novel framework that casts segment-wise tracking as a\nMarkov Decision Process (MDP), enabling a reinforcement learning approach. Our\nmethod leverages Q-Learning to dynamically explore a graph of segments,\ncomputing edge weights on-demand and adaptively expanding the search space.\nThis strategy avoids the high cost of a pre-computed graph and proves robust to\nincomplete initial information. Experimental reuslts on typical tubular\nstructure datasets demonstrate that our method significantly outperforms\nstate-of-the-art point-wise and segment-wise approaches. The proposed method\neffectively handles complex topologies and maintains global path coherence\nwithout depending on extensive prior structural knowledge.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18939", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18939", "abs": "https://arxiv.org/abs/2506.18939", "authors": ["Rui An", "Yifeng Zhang", "Ziran Liang", "Wenqi Fan", "Yuxuan Liang", "Xuequn Shang", "Qing Li"], "title": "Damba-ST: Domain-Adaptive Mamba for Efficient Urban Spatio-Temporal Prediction", "comment": null, "summary": "Training urban spatio-temporal foundation models that generalize well across\ndiverse regions and cities is critical for deploying urban services in unseen\nor data-scarce regions. Recent studies have typically focused on fusing\ncross-domain spatio-temporal data to train unified Transformer-based models.\nHowever, these models suffer from quadratic computational complexity and high\nmemory overhead, limiting their scalability and practical deployment. Inspired\nby the efficiency of Mamba, a state space model with linear time complexity, we\nexplore its potential for efficient urban spatio-temporal prediction. However,\ndirectly applying Mamba as a spatio-temporal backbone leads to negative\ntransfer and severe performance degradation. This is primarily due to\nspatio-temporal heterogeneity and the recursive mechanism of Mamba's hidden\nstate updates, which limit cross-domain generalization. To overcome these\nchallenges, we propose Damba-ST, a novel domain-adaptive Mamba-based model for\nefficient urban spatio-temporal prediction. Damba-ST retains Mamba's linear\ncomplexity advantage while significantly enhancing its adaptability to\nheterogeneous domains. Specifically, we introduce two core innovations: (1) a\ndomain-adaptive state space model that partitions the latent representation\nspace into a shared subspace for learning cross-domain commonalities and\nindependent, domain-specific subspaces for capturing intra-domain\ndiscriminative features; (2) three distinct Domain Adapters, which serve as\ndomain-aware proxies to bridge disparate domain distributions and facilitate\nthe alignment of cross-domain commonalities. Extensive experiments demonstrate\nthe generalization and efficiency of Damba-ST. It achieves state-of-the-art\nperformance on prediction tasks and demonstrates strong zero-shot\ngeneralization, enabling seamless deployment in new urban environments without\nextensive retraining or fine-tuning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19708", "categories": ["cs.GR", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19708", "abs": "https://arxiv.org/abs/2506.19708", "authors": ["Matyas Bohacek", "Thomas Fel", "Maneesh Agrawala", "Ekdeep Singh Lubana"], "title": "Uncovering Conceptual Blindspots in Generative Image Models Using Sparse Autoencoders", "comment": null, "summary": "Despite their impressive performance, generative image models trained on\nlarge-scale datasets frequently fail to produce images with seemingly simple\nconcepts -- e.g., human hands or objects appearing in groups of four -- that\nare reasonably expected to appear in the training data. These failure modes\nhave largely been documented anecdotally, leaving open the question of whether\nthey reflect idiosyncratic anomalies or more structural limitations of these\nmodels. To address this, we introduce a systematic approach for identifying and\ncharacterizing \"conceptual blindspots\" -- concepts present in the training data\nbut absent or misrepresented in a model's generations. Our method leverages\nsparse autoencoders (SAEs) to extract interpretable concept embeddings,\nenabling a quantitative comparison of concept prevalence between real and\ngenerated images. We train an archetypal SAE (RA-SAE) on DINOv2 features with\n32,000 concepts -- the largest such SAE to date -- enabling fine-grained\nanalysis of conceptual disparities. Applied to four popular generative models\n(Stable Diffusion 1.5/2.1, PixArt, and Kandinsky), our approach reveals\nspecific suppressed blindspots (e.g., bird feeders, DVD discs, and whitespaces\non documents) and exaggerated blindspots (e.g., wood background texture and\npalm trees). At the individual datapoint level, we further isolate memorization\nartifacts -- instances where models reproduce highly specific visual templates\nseen during training. Overall, we propose a theoretically grounded framework\nfor systematically identifying conceptual blindspots in generative models by\nassessing their conceptual fidelity with respect to the underlying\ndata-generating process.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18943", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.18943", "abs": "https://arxiv.org/abs/2506.18943", "authors": ["Andrew Kiruluta", "Priscilla Burity"], "title": "From Pixels and Words to Waves: A Unified Framework for Spectral Dictionary vLLMs", "comment": null, "summary": "Vision-language models (VLMs) unify computer vision and natural language\nprocessing in a single architecture capable of interpreting and describing\nimages. Most state-of-the-art systems rely on two computationally intensive\ncomponents: convolutions in the vision encoder and quadratic self-attention for\nmultimodal fusion. This work removes both by introducing a spectral dictionary\ntoken mixer, which represents each image patch or wordpiece as a sparse\ncombination of learnable frequency atoms. Our 1.1B-parameter prototype,\nSDict-VLM, achieves BLEU-4 of 39.2, CIDEr of 127.5, and SPICE of 27.0 on\nMS-COCO captioning, along with 50.3 percent accuracy on VQAv2. These results\nclose approximately 85 percent of the performance gap to BLIP-2 while using 60\npercent fewer parameters, 2.3 times less peak GPU memory, and 2.2 times faster\ninference than PaLI-3. To our knowledge, this is the first VLM to eliminate\nboth convolutions and self-attention while matching mid-scale transformer\nbaselines. In addition to its O(L log L) complexity, the shared frequency\ndictionary enables transparent cross-modal alignment and offers a tunable\ntrade-off between accuracy and compute, paving the way for efficient and\ninterpretable VLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18946", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18946", "abs": "https://arxiv.org/abs/2506.18946", "authors": ["Zhe Dong", "Yuzhe Sun", "Tianzhu Liu", "Yanfeng Gu"], "title": "DiffRIS: Enhancing Referring Remote Sensing Image Segmentation with Pre-trained Text-to-Image Diffusion Models", "comment": null, "summary": "Referring remote sensing image segmentation (RRSIS) enables the precise\ndelineation of regions within remote sensing imagery through natural language\ndescriptions, serving critical applications in disaster response, urban\ndevelopment, and environmental monitoring. Despite recent advances, current\napproaches face significant challenges in processing aerial imagery due to\ncomplex object characteristics including scale variations, diverse\norientations, and semantic ambiguities inherent to the overhead perspective. To\naddress these limitations, we propose DiffRIS, a novel framework that harnesses\nthe semantic understanding capabilities of pre-trained text-to-image diffusion\nmodels for enhanced cross-modal alignment in RRSIS tasks. Our framework\nintroduces two key innovations: a context perception adapter (CP-adapter) that\ndynamically refines linguistic features through global context modeling and\nobject-aware reasoning, and a progressive cross-modal reasoning decoder (PCMRD)\nthat iteratively aligns textual descriptions with visual regions for precise\nsegmentation. The CP-adapter bridges the domain gap between general\nvision-language understanding and remote sensing applications, while PCMRD\nenables fine-grained semantic alignment through multi-scale feature\ninteraction. Comprehensive experiments on three benchmark datasets-RRSIS-D,\nRefSegRS, and RISBench-demonstrate that DiffRIS consistently outperforms\nexisting methods across all standard metrics, establishing a new\nstate-of-the-art for RRSIS tasks. The significant performance improvements\nvalidate the effectiveness of leveraging pre-trained diffusion models for\nremote sensing applications through our proposed adaptive framework.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "fine-grained"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18985", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18985", "abs": "https://arxiv.org/abs/2506.18985", "authors": ["Guanxi Shen"], "title": "GLIMPSE: Gradient-Layer Importance Mapping for Prompted Visual Saliency Explanation for Generative LVLMs", "comment": null, "summary": "Recent advances in large vision language models (LVLMs) have unlocked\nunprecedented capabilities in generating coherent responses from visual inputs.\nHowever, interpreting where LVLMs direct their visual attention while\ngenerating free-form textual responses remains a significant challenge, yet is\nessential for understanding model behavior, diagnosing hallucination, exposing\nbias and ensuring transparency. We introduce GLIMPSE (Gradient-Layer Importance\nMapping for Prompted Visual Saliency Explanation), a lightweight,\nmodel-agnostic framework for visualizing the salient image regions that LVLMs\nrely upon during open-ended visual question answering (VQA), while concurrently\nrevealing the multimodal textual saliency. GLIMPSE fuses gradient-weighted\nattention, adaptive layer propagation, and weighted token aggregation to\nproduce holistic response-level attribution heat maps for interpreting\ncross-modal reasoning, outperforming prior interpretability methods in\nhuman-alignment. We demonstrate an analytic explainable AI (XAI) approach using\nGLIMPSE to uncover fine-grained insights into LVLM cross-modal attribution,\ntrace token-level reasoning dynamics, and analyze systematic human-attention\nmisalignment, hallucination, and bias.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering", "fine-grained"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19279", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19279", "abs": "https://arxiv.org/abs/2506.19279", "authors": ["Zhiyang Qi", "Keiko Takamizo", "Mariko Ukiyo", "Michimasa Inaba"], "title": "EmoStage: A Framework for Accurate Empathetic Response Generation via Perspective-Taking and Phase Recognition", "comment": null, "summary": "The rising demand for mental health care has fueled interest in AI-driven\ncounseling systems. While large language models (LLMs) offer significant\npotential, current approaches face challenges, including limited understanding\nof clients' psychological states and counseling stages, reliance on\nhigh-quality training data, and privacy concerns associated with commercial\ndeployment. To address these issues, we propose EmoStage, a framework that\nenhances empathetic response generation by leveraging the inference\ncapabilities of open-source LLMs without additional training data. Our\nframework introduces perspective-taking to infer clients' psychological states\nand support needs, enabling the generation of emotionally resonant responses.\nIn addition, phase recognition is incorporated to ensure alignment with the\ncounseling process and to prevent contextually inappropriate or inopportune\nresponses. Experiments conducted in both Japanese and Chinese counseling\nsettings demonstrate that EmoStage improves the quality of responses generated\nby base models and performs competitively with data-driven methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19325", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19325", "abs": "https://arxiv.org/abs/2506.19325", "authors": ["Hyein Seo", "Taewook Hwang", "Yohan Lee", "sangkeun Jung"], "title": "FEAT: A Preference Feedback Dataset through a Cost-Effective Auto-Generation and Labeling Framework for English AI Tutoring", "comment": "ACL 2025 (Short)", "summary": "In English education tutoring, teacher feedback is essential for guiding\nstudents. Recently, AI-based tutoring systems have emerged to assist teachers;\nhowever, these systems require high-quality and large-scale teacher feedback\ndata, which is both time-consuming and costly to generate manually. In this\nstudy, we propose FEAT, a cost-effective framework for generating teacher\nfeedback, and have constructed three complementary datasets: (1) DIRECT-Manual\n(DM), where both humans and large language models (LLMs) collaboratively\ngenerate high-quality teacher feedback, albeit at a higher cost; (2)\nDIRECT-Generated (DG), an LLM-only generated, cost-effective dataset with lower\nquality;, and (3) DIRECT-Augmented (DA), primarily based on DG with a small\nportion of DM added to enhance quality while maintaining cost-efficiency.\nExperimental results showed that incorporating a small portion of DM (5-10%)\ninto DG leads to superior performance compared to using 100% DM alone.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["preference"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19352", "categories": ["cs.CL", "cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2506.19352", "abs": "https://arxiv.org/abs/2506.19352", "authors": ["Jisu Shin", "Juhyun Oh", "Eunsu Kim", "Hoyun Song", "Alice Oh"], "title": "Spotting Out-of-Character Behavior: Atomic-Level Evaluation of Persona Fidelity in Open-Ended Generation", "comment": "Findings of ACL 2025; github repo:\n  https://github.com/ddindidu/atomic-persona-evaluation/", "summary": "Ensuring persona fidelity in large language models (LLMs) is essential for\nmaintaining coherent and engaging human-AI interactions. However, LLMs often\nexhibit Out-of-Character (OOC) behavior, where generated responses deviate from\nan assigned persona, leading to inconsistencies that affect model reliability.\nExisting evaluation methods typically assign single scores to entire responses,\nstruggling to capture subtle persona misalignment, particularly in long-form\ntext generation. To address this limitation, we propose an atomic-level\nevaluation framework that quantifies persona fidelity at a finer granularity.\nOur three key metrics measure the degree of persona alignment and consistency\nwithin and across generations. Our approach enables a more precise and\nrealistic assessment of persona fidelity by identifying subtle deviations that\nreal users would encounter. Through our experiments, we demonstrate that our\nframework effectively detects persona inconsistencies that prior methods\noverlook. By analyzing persona fidelity across diverse tasks and personality\ntypes, we reveal how task structure and persona desirability influence model\nadaptability, highlighting challenges in maintaining consistent persona\nexpression.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency", "reliability"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19087", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19087", "abs": "https://arxiv.org/abs/2506.19087", "authors": ["Bowen Zhang", "Jesse T. Boulerice", "Nikhil Kuniyil", "Charvi Mendiratta", "Satish Kumar", "Hila Shamon", "B. S. Manjunath"], "title": "RareSpot: Spotting Small and Rare Wildlife in Aerial Imagery with Multi-Scale Consistency and Context-Aware Augmentation", "comment": "Accepted to the CVPR 2025 Workshop on Computer Vision for Animal\n  Behavior Tracking and Modeling (CV4Animals)", "summary": "Automated detection of small and rare wildlife in aerial imagery is crucial\nfor effective conservation, yet remains a significant technical challenge.\nPrairie dogs exemplify this issue: their ecological importance as keystone\nspecies contrasts sharply with their elusive presence--marked by small size,\nsparse distribution, and subtle visual features--which undermines existing\ndetection approaches. To address these challenges, we propose RareSpot, a\nrobust detection framework integrating multi-scale consistency learning and\ncontext-aware augmentation. Our multi-scale consistency approach leverages\nstructured alignment across feature pyramids, enhancing fine-grained object\nrepresentation and mitigating scale-related feature loss. Complementarily,\ncontext-aware augmentation strategically synthesizes challenging training\ninstances by embedding difficult-to-detect samples into realistic environmental\ncontexts, significantly boosting model precision and recall. Evaluated on an\nexpert-annotated prairie dog drone imagery benchmark, our method achieves\nstate-of-the-art performance, improving detection accuracy by over 35% compared\nto baseline methods. Importantly, it generalizes effectively across additional\nwildlife datasets, demonstrating broad applicability. The RareSpot benchmark\nand approach not only support critical ecological monitoring but also establish\na new foundation for detecting small, rare species in complex aerial scenes.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19410", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19410", "abs": "https://arxiv.org/abs/2506.19410", "authors": ["Anas Hattay", "Mayara Ayat", "Fred Ngole Mboula"], "title": "Unsupervised Dataset Dictionary Learning for domain shift robust clustering: application to sitting posture identification", "comment": null, "summary": "This paper introduces a novel approach, Unsupervised Dataset Dictionary\nLearning (U-DaDiL), for totally unsupervised robust clustering applied to\nsitting posture identification. Traditional methods often lack adaptability to\ndiverse datasets and suffer from domain shift issues. U-DaDiL addresses these\nchallenges by aligning distributions from different datasets using Wasserstein\nbarycenter based representation. Experimental evaluations on the Office31\ndataset demonstrate significant improvements in cluster alignment accuracy.\nThis work also presents a promising step for addressing domain shift and robust\nclustering for unsupervised sitting posture identification", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19467", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19467", "abs": "https://arxiv.org/abs/2506.19467", "authors": ["Jingwei Ni", "Yu Fan", "Vilém Zouhar", "Donya Rooein", "Alexander Hoyle", "Mrinmaya Sachan", "Markus Leippold", "Dirk Hovy", "Elliott Ash"], "title": "Can Large Language Models Capture Human Annotator Disagreements?", "comment": "Preprint Under Review", "summary": "Human annotation variation (i.e., annotation disagreements) is common in NLP\nand often reflects important information such as task subjectivity and sample\nambiguity. While Large Language Models (LLMs) are increasingly used for\nautomatic annotation to reduce human effort, their evaluation often focuses on\npredicting the majority-voted \"ground truth\" labels. It is still unclear,\nhowever, whether these models also capture informative human annotation\nvariation. Our work addresses this gap by extensively evaluating LLMs' ability\nto predict annotation disagreements without access to repeated human labels.\nOur results show that LLMs struggle with modeling disagreements, which can be\noverlooked by majority label-based evaluations. Notably, while RLVR-style\n(Reinforcement learning with verifiable rewards) reasoning generally boosts LLM\nperformance, it degrades performance in disagreement prediction. Our findings\nhighlight the critical need for evaluating and improving LLM annotators in\ndisagreement modeling. Code and data at\nhttps://github.com/EdisonNi-hku/Disagreement_Prediction.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "annotation"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19468", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19468", "abs": "https://arxiv.org/abs/2506.19468", "authors": ["Wenhan Han", "Yifan Zhang", "Zhixun Chen", "Binbin Liu", "Haobin Lin", "Bingni Zhang", "Taifeng Wang", "Mykola Pechenizkiy", "Meng Fang", "Yin Zheng"], "title": "MuBench: Assessment of Multilingual Capabilities of Large Language Models Across 61 Languages", "comment": null, "summary": "Multilingual large language models (LLMs) are advancing rapidly, with new\nmodels frequently claiming support for an increasing number of languages.\nHowever, existing evaluation datasets are limited and lack cross-lingual\nalignment, leaving assessments of multilingual capabilities fragmented in both\nlanguage and skill coverage. To address this, we introduce MuBench, a benchmark\ncovering 61 languages and evaluating a broad range of capabilities. We evaluate\nseveral state-of-the-art multilingual LLMs and find notable gaps between\nclaimed and actual language coverage, particularly a persistent performance\ndisparity between English and low-resource languages. Leveraging MuBench's\nalignment, we propose Multilingual Consistency (MLC) as a complementary metric\nto accuracy for analyzing performance bottlenecks and guiding model\nimprovement. Finally, we pretrain a suite of 1.2B-parameter models on English\nand Chinese with 500B tokens, varying language ratios and parallel data\nproportions to investigate cross-lingual transfer dynamics.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "accuracy"], "score": 4}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19174", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19174", "abs": "https://arxiv.org/abs/2506.19174", "authors": ["Jialu Pi", "Juan Maria Farina", "Rimita Lahiri", "Jiwoong Jeong", "Archana Gurudu", "Hyung-Bok Park", "Chieh-Ju Chao", "Chadi Ayoub", "Reza Arsanjani", "Imon Banerjee"], "title": "MOSCARD -- Causal Reasoning and De-confounding for Multimodal Opportunistic Screening of Cardiovascular Adverse Events", "comment": null, "summary": "Major Adverse Cardiovascular Events (MACE) remain the leading cause of\nmortality globally, as reported in the Global Disease Burden Study 2021.\nOpportunistic screening leverages data collected from routine health check-ups\nand multimodal data can play a key role to identify at-risk individuals. Chest\nX-rays (CXR) provide insights into chronic conditions contributing to major\nadverse cardiovascular events (MACE), while 12-lead electrocardiogram (ECG)\ndirectly assesses cardiac electrical activity and structural abnormalities.\nIntegrating CXR and ECG could offer a more comprehensive risk assessment than\nconventional models, which rely on clinical scores, computed tomography (CT)\nmeasurements, or biomarkers, which may be limited by sampling bias and single\nmodality constraints. We propose a novel predictive modeling framework -\nMOSCARD, multimodal causal reasoning with co-attention to align two distinct\nmodalities and simultaneously mitigate bias and confounders in opportunistic\nrisk estimation. Primary technical contributions are - (i) multimodal alignment\nof CXR with ECG guidance; (ii) integration of causal reasoning; (iii) dual\nback-propagation graph for de-confounding. Evaluated on internal, shift data\nfrom emergency department (ED) and external MIMIC datasets, our model\noutperformed single modality and state-of-the-art foundational models - AUC:\n0.75, 0.83, 0.71 respectively. Proposed cost-effective opportunistic screening\nenables early intervention, improving patient outcomes and reducing\ndisparities.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19257", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19257", "abs": "https://arxiv.org/abs/2506.19257", "authors": ["Yinan Xia", "Yilei Jiang", "Yingshui Tan", "Xiaoyong Zhu", "Xiangyu Yue", "Bo Zheng"], "title": "MSR-Align: Policy-Grounded Multimodal Alignment for Safety-Aware Reasoning in Vision-Language Models", "comment": null, "summary": "Vision-Language Models (VLMs) have achieved remarkable progress in multimodal\nreasoning tasks through enhanced chain-of-thought capabilities. However, this\nadvancement also introduces novel safety risks, as these models become\nincreasingly vulnerable to harmful multimodal prompts that can trigger\nunethical or unsafe behaviors. Existing safety alignment approaches, primarily\ndesigned for unimodal language models, fall short in addressing the complex and\nnuanced threats posed by multimodal inputs. Moreover, current safety datasets\nlack the fine-grained, policy-grounded reasoning required to robustly align\nreasoning-capable VLMs. In this work, we introduce {MSR-Align}, a high-quality\nMultimodal Safety Reasoning dataset tailored to bridge this gap. MSR-Align\nsupports fine-grained, deliberative reasoning over standardized safety policies\nacross both vision and text modalities. Our data generation pipeline emphasizes\nmultimodal diversity, policy-grounded reasoning, and rigorous quality filtering\nusing strong multimodal judges. Extensive experiments demonstrate that\nfine-tuning VLMs on MSR-Align substantially improves robustness against both\ntextual and vision-language jailbreak attacks, while preserving or enhancing\ngeneral reasoning performance. MSR-Align provides a scalable and effective\nfoundation for advancing the safety alignment of reasoning-capable VLMs. Our\ndataset is made publicly available at\nhttps://huggingface.co/datasets/Leigest/MSR-Align.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "safety", "fine-grained"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19549", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.19549", "abs": "https://arxiv.org/abs/2506.19549", "authors": ["Debabrata Mahapatra", "Shubham Agarwal", "Apoorv Saxena", "Subrata Mitra"], "title": "RCStat: A Statistical Framework for using Relative Contextualization in Transformers", "comment": null, "summary": "Prior work on input-token importance in auto-regressive transformers has\nrelied on Softmax-normalized attention weights, which obscure the richer\nstructure of pre-Softmax query-key logits. We introduce RCStat, a statistical\nframework that harnesses raw attention logits via Relative Contextualization\n(RC), a random variable measuring contextual alignment between token segments,\nand derive an efficient upper bound for RC. We demonstrate two applications:\n(i) Key-Value compression, where RC-based thresholds drive adaptive key-value\neviction for substantial cache reduction with minimal quality loss; and (ii)\nAttribution, where RC yields higher-fidelity token-, sentence-, and chunk-level\nexplanations than post-Softmax methods. Across question answering,\nsummarization, and attribution benchmarks, RCStat achieves significant\nempirical gains, delivering state-of-the-art compression and attribution\nperformance without any model retraining.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization", "question answering"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19571", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19571", "abs": "https://arxiv.org/abs/2506.19571", "authors": ["Lorenzo Proietti", "Stefano Perrella", "Roberto Navigli"], "title": "Has Machine Translation Evaluation Achieved Human Parity? The Human Reference and the Limits of Progress", "comment": "Accepted at ACL 2025 Main Conference. 24 pages", "summary": "In Machine Translation (MT) evaluation, metric performance is assessed based\non agreement with human judgments. In recent years, automatic metrics have\ndemonstrated increasingly high levels of agreement with humans. To gain a\nclearer understanding of metric performance and establish an upper bound, we\nincorporate human baselines in the MT meta-evaluation, that is, the assessment\nof MT metrics' capabilities. Our results show that human annotators are not\nconsistently superior to automatic metrics, with state-of-the-art metrics often\nranking on par with or higher than human baselines. Despite these findings\nsuggesting human parity, we discuss several reasons for caution. Finally, we\nexplore the broader implications of our results for the research field, asking:\nCan we still reliably measure improvements in MT evaluation? With this work, we\naim to shed light on the limits of our ability to measure progress in the\nfield, fostering discussion on an issue that we believe is crucial to the\nentire MT evaluation community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19599", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19599", "abs": "https://arxiv.org/abs/2506.19599", "authors": ["Zhenke Duan", "Jiqun Pan", "Jiani Tu", "Xiaoyi Wang", "Yanqing Wang"], "title": "ECCoT: A Framework for Enhancing Effective Cognition via Chain of Thought in Large Language Model", "comment": null, "summary": "In the era of large-scale artificial intelligence, Large Language Models\n(LLMs) have made significant strides in natural language processing. However,\nthey often lack transparency and generate unreliable outputs, raising concerns\nabout their interpretability. To address this, the Chain of Thought (CoT)\nprompting method structures reasoning into step-by-step deductions. Yet, not\nall reasoning chains are valid, and errors can lead to unreliable conclusions.\nWe propose ECCoT, an End-to-End Cognitive Chain of Thought Validation\nFramework, to evaluate and refine reasoning chains in LLMs. ECCoT integrates\nthe Markov Random Field-Embedded Topic Model (MRF-ETM) for topic-aware CoT\ngeneration and Causal Sentence-BERT (CSBert) for causal reasoning alignment. By\nfiltering ineffective chains using structured ordering statistics, ECCoT\nimproves interpretability, reduces biases, and enhances the trustworthiness of\nLLM-based decision-making. Key contributions include the introduction of ECCoT,\nMRF-ETM for topic-driven CoT generation, and CSBert for causal reasoning\nenhancement. Code is released at: https://github.com/erwinmsmith/ECCoT.git.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale", "chain of thought"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19607", "categories": ["cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19607", "abs": "https://arxiv.org/abs/2506.19607", "authors": ["Juraj Vladika", "Ihsan Soydemir", "Florian Matthes"], "title": "Correcting Hallucinations in News Summaries: Exploration of Self-Correcting LLM Methods with External Knowledge", "comment": "Accepted to FEVER @ ACL 2025", "summary": "While large language models (LLMs) have shown remarkable capabilities to\ngenerate coherent text, they suffer from the issue of hallucinations --\nfactually inaccurate statements. Among numerous approaches to tackle\nhallucinations, especially promising are the self-correcting methods. They\nleverage the multi-turn nature of LLMs to iteratively generate verification\nquestions inquiring additional evidence, answer them with internal or external\nknowledge, and use that to refine the original response with the new\ncorrections. These methods have been explored for encyclopedic generation, but\nless so for domains like news summarization. In this work, we investigate two\nstate-of-the-art self-correcting systems by applying them to correct\nhallucinated summaries using evidence from three search engines. We analyze the\nresults and provide insights into systems' performance, revealing interesting\npractical findings on the benefits of search engine snippets and few-shot\nprompts, as well as high alignment of G-Eval and human evaluation.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "summarization"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19652", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19652", "abs": "https://arxiv.org/abs/2506.19652", "authors": ["Lucie Galland", "Catherine Pelachaud", "Florian Pecune"], "title": "Tailored Conversations beyond LLMs: A RL-Based Dialogue Manager", "comment": null, "summary": "In this work, we propose a novel framework that integrates large language\nmodels (LLMs) with an RL-based dialogue manager for open-ended dialogue with a\nspecific goal. By leveraging hierarchical reinforcement learning to model the\nstructured phases of dialogue and employ meta-learning to enhance adaptability\nacross diverse user profiles, our approach enhances adaptability and\nefficiency, enabling the system to learn from limited data, transition fluidly\nbetween dialogue phases, and personalize responses to heterogeneous patient\nneeds. We apply our framework to Motivational Interviews, aiming to foster\nbehavior change, and demonstrate that the proposed dialogue manager outperforms\na state-of-the-art LLM baseline in terms of reward, showing a potential benefit\nof conditioning LLMs to create open-ended dialogue systems with specific goals.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19785", "categories": ["cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19785", "abs": "https://arxiv.org/abs/2506.19785", "authors": ["Menglong Zhang", "Fuyuan Qian"], "title": "Learning Task Belief Similarity with Latent Dynamics for Meta-Reinforcement Learning", "comment": "ICLR2025 https://openreview.net/forum?id=5YbuOTUFQ4", "summary": "Meta-reinforcement learning requires utilizing prior task distribution\ninformation obtained during exploration to rapidly adapt to unknown tasks. The\nefficiency of an agent's exploration hinges on accurately identifying the\ncurrent task. Recent Bayes-Adaptive Deep RL approaches often rely on\nreconstructing the environment's reward signal, which is challenging in sparse\nreward settings, leading to suboptimal exploitation. Inspired by bisimulation\nmetrics, which robustly extracts behavioral similarity in continuous MDPs, we\npropose SimBelief-a novel meta-RL framework via measuring similarity of task\nbelief in Bayes-Adaptive MDP (BAMDP). SimBelief effectively extracts common\nfeatures of similar task distributions, enabling efficient task identification\nand exploration in sparse reward environments. We introduce latent task belief\nmetric to learn the common structure of similar tasks and incorporate it into\nthe specific task belief. By learning the latent dynamics across task\ndistributions, we connect shared latent task belief features with specific task\nfeatures, facilitating rapid task identification and adaptation. Our method\noutperforms state-of-the-art baselines on sparse reward MuJoCo and panda-gym\ntasks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19312", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19312", "abs": "https://arxiv.org/abs/2506.19312", "authors": ["Junsei Tokumitsu", "Yuiga Wada"], "title": "Capturing Fine-Grained Alignments Improves 3D Affordance Detection", "comment": "MVA 2025 (Oral)", "summary": "In this work, we address the challenge of affordance detection in 3D point\nclouds, a task that requires effectively capturing fine-grained alignments\nbetween point clouds and text. Existing methods often struggle to model such\nalignments, resulting in limited performance on standard benchmarks. A key\nlimitation of these approaches is their reliance on simple cosine similarity\nbetween point cloud and text embeddings, which lacks the expressiveness needed\nfor fine-grained reasoning. To address this limitation, we propose LM-AD, a\nnovel method for affordance detection in 3D point clouds. Moreover, we\nintroduce the Affordance Query Module (AQM), which efficiently captures\nfine-grained alignment between point clouds and text by leveraging a pretrained\nlanguage model. We demonstrated that our method outperformed existing\napproaches in terms of accuracy and mean Intersection over Union on the 3D\nAffordanceNet dataset.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy", "fine-grained"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19807", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2506.19807", "abs": "https://arxiv.org/abs/2506.19807", "authors": ["Baochang Ren", "Shuofei Qiao", "Wenhao Yu", "Huajun Chen", "Ningyu Zhang"], "title": "KnowRL: Exploring Knowledgeable Reinforcement Learning for Factuality", "comment": "Work in progress", "summary": "Large Language Models (LLMs), particularly slow-thinking models, often\nexhibit severe hallucination, outputting incorrect content due to an inability\nto accurately recognize knowledge boundaries during reasoning. While\nReinforcement Learning (RL) can enhance complex reasoning abilities, its\noutcome-oriented reward mechanism often lacks factual supervision over the\nthinking process, further exacerbating the hallucination problem. To address\nthe high hallucination in slow-thinking models, we propose Knowledge-enhanced\nRL, KnowRL. KnowRL guides models to perform fact-based slow thinking by\nintegrating a factuality reward, based on knowledge verification, into the RL\ntraining process, helping them recognize their knowledge boundaries. KnowRL\nguides models to perform fact-based slow thinking by integrating a factuality\nreward, based on knowledge verification, into the RL training process, helping\nthem recognize their knowledge boundaries. This targeted factual input during\nRL training enables the model to learn and internalize fact-based reasoning\nstrategies. By directly rewarding adherence to facts within the reasoning\nsteps, KnowRL fosters a more reliable thinking process. Experimental results on\nthree hallucination evaluation datasets and two reasoning evaluation datasets\ndemonstrate that KnowRL effectively mitigates hallucinations in slow-thinking\nmodels while maintaining their original strong reasoning capabilities. Our code\nis available at https://github.com/zjunlp/KnowRL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "factuality"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19320", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19320", "abs": "https://arxiv.org/abs/2506.19320", "authors": ["Yuang Yao", "Ruiqi Wu", "Yi Zhou", "Tao Zhou"], "title": "Continual Retinal Vision-Language Pre-training upon Incremental Imaging Modalities", "comment": "Accepted by MICCAI 2025", "summary": "Traditional fundus image analysis models focus on single-modal tasks,\nignoring fundus modality complementarity, which limits their versatility.\nRecently, retinal foundation models have emerged, but most still remain\nmodality-specific. Integrating multiple fundus imaging modalities into a single\nfoundation model is valuable. However, in dynamic environments, data from\ndifferent modalities often arrive incrementally, necessitating continual\npre-training. To address this, we propose RetCoP, the first continual\nvision-language pre-training framework in the fundus domain, which\nincrementally integrates image and text features from different imaging\nmodalities into a single unified foundation model. To mitigate catastrophic\nforgetting in continual pre-training, we introduce a rehearsal strategy\nutilizing representative image-text pairs and an off-diagonal information\ndistillation approach. The former allows the model to revisit knowledge from\nprevious stages, while the latter explicitly preserves the alignment between\nimage and text representations. Experiments show that RetCoP outperforms all\nthe compared methods, achieving the best generalization and lowest forgetting\nrate. The code can be found at https://github.com/Yuang-Yao/RetCoP.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19767", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.19767", "abs": "https://arxiv.org/abs/2506.19767", "authors": ["Yuqian Fu", "Tinghong Chen", "Jiajun Chai", "Xihuai Wang", "Songjun Tu", "Guojun Yin", "Wei Lin", "Qichao Zhang", "Yuanheng Zhu", "Dongbin Zhao"], "title": "SRFT: A Single-Stage Method with Supervised and Reinforcement Fine-Tuning for Reasoning", "comment": null, "summary": "Large language models (LLMs) have achieved remarkable progress in reasoning\ntasks, yet the optimal integration of Supervised Fine-Tuning (SFT) and\nReinforcement Learning (RL) remains a fundamental challenge. Through\ncomprehensive analysis of token distributions, learning dynamics, and\nintegration mechanisms from entropy-based perspectives, we reveal key\ndifferences between these paradigms: SFT induces coarse-grained global changes\nto LLM policy distributions, while RL performs fine-grained selective\noptimizations, with entropy serving as a critical indicator of training\neffectiveness. Building on these observations, we propose Supervised\nReinforcement Fine-Tuning (SRFT), a single-stage method that unifies both\nfine-tuning paradigms through entropy-aware weighting mechanisms. Our approach\nsimultaneously applies SFT and RL to directly optimize the LLM using\ndemonstrations and self-exploration rollouts rather than through two-stage\nsequential methods. Extensive experiments show that SRFT achieves 59.1% average\naccuracy, outperforming zero-RL methods by 9.0% on five mathematical reasoning\nbenchmarks and 10.9% on three out-of-distribution benchmarks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "mathematical reasoning", "fine-grained"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18930", "categories": ["cs.CV", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.18930", "abs": "https://arxiv.org/abs/2506.18930", "authors": ["Chong Di", "Shuwang Zhou", "Da Chen", "Jean-Marie Mirebeau", "Minglei Shu", "Laurent D. Cohen"], "title": "Reinforcement Learning-Based Dynamic Grouping for Tubular Structure Tracking", "comment": null, "summary": "The computation of minimal paths for the applications in tracking tubular\nstructures such as blood vessels and roads is challenged by complex\nmorphologies and environmental variations. Existing approaches can be roughly\ncategorized into two research lines: the point-wise based models and the\nsegment-wise based models. Although segment-wise approaches have obtained\npromising results in many scenarios, they often suffer from computational\ninefficiency and heavily rely on a prescribed prior to fit the target elongated\nshapes. We propose a novel framework that casts segment-wise tracking as a\nMarkov Decision Process (MDP), enabling a reinforcement learning approach. Our\nmethod leverages Q-Learning to dynamically explore a graph of segments,\ncomputing edge weights on-demand and adaptively expanding the search space.\nThis strategy avoids the high cost of a pre-computed graph and proves robust to\nincomplete initial information. Experimental reuslts on typical tubular\nstructure datasets demonstrate that our method significantly outperforms\nstate-of-the-art point-wise and segment-wise approaches. The proposed method\neffectively handles complex topologies and maintains global path coherence\nwithout depending on extensive prior structural knowledge.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19388", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19388", "abs": "https://arxiv.org/abs/2506.19388", "authors": ["Jiahe Chen", "Naoki Tomii", "Ichiro Sakuma", "Etsuko Kobayashi"], "title": "Online camera-pose-free stereo endoscopic tissue deformation recovery with tissue-invariant vision-biomechanics consistency", "comment": null, "summary": "Tissue deformation recovery based on stereo endoscopic images is crucial for\ntool-tissue interaction analysis and benefits surgical navigation and\nautonomous soft tissue manipulation. Previous research suffers from the\nproblems raised from camera motion, occlusion, large tissue deformation, lack\nof tissue-specific biomechanical priors, and reliance on offline processing.\nUnlike previous studies where the tissue geometry and deformation are\nrepresented by 3D points and displacements, the proposed method models tissue\ngeometry as the 3D point and derivative map and tissue deformation as the 3D\ndisplacement and local deformation map. For a single surface point, 6\nparameters are used to describe its rigid motion and 3 parameters for its local\ndeformation. The method is formulated under the camera-centric setting, where\nall motions are regarded as the scene motion with respect to the camera.\nInter-frame alignment is realized by optimizing the inter-frame deformation,\nmaking it unnecessary to estimate camera pose. The concept of the canonical map\nis introduced to optimize tissue geometry and deformation in an online\napproach. Quantitative and qualitative experiments were conducted using in vivo\nand ex vivo laparoscopic datasets. With the inputs of depth and optical flow,\nthe method stably models tissue geometry and deformation even when the tissue\nis partially occluded or moving outside the field of view. Results show that\nthe 3D reconstruction accuracy in the non-occluded and occluded areas reaches\n0.37$\\pm$0.27 mm and 0.39$\\pm$0.21 mm in terms of surface distance,\nrespectively. The method can also estimate surface strain distribution during\nvarious manipulations as an extra modality for mechanical-based analysis.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["consistency", "accuracy"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18939", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18939", "abs": "https://arxiv.org/abs/2506.18939", "authors": ["Rui An", "Yifeng Zhang", "Ziran Liang", "Wenqi Fan", "Yuxuan Liang", "Xuequn Shang", "Qing Li"], "title": "Damba-ST: Domain-Adaptive Mamba for Efficient Urban Spatio-Temporal Prediction", "comment": null, "summary": "Training urban spatio-temporal foundation models that generalize well across\ndiverse regions and cities is critical for deploying urban services in unseen\nor data-scarce regions. Recent studies have typically focused on fusing\ncross-domain spatio-temporal data to train unified Transformer-based models.\nHowever, these models suffer from quadratic computational complexity and high\nmemory overhead, limiting their scalability and practical deployment. Inspired\nby the efficiency of Mamba, a state space model with linear time complexity, we\nexplore its potential for efficient urban spatio-temporal prediction. However,\ndirectly applying Mamba as a spatio-temporal backbone leads to negative\ntransfer and severe performance degradation. This is primarily due to\nspatio-temporal heterogeneity and the recursive mechanism of Mamba's hidden\nstate updates, which limit cross-domain generalization. To overcome these\nchallenges, we propose Damba-ST, a novel domain-adaptive Mamba-based model for\nefficient urban spatio-temporal prediction. Damba-ST retains Mamba's linear\ncomplexity advantage while significantly enhancing its adaptability to\nheterogeneous domains. Specifically, we introduce two core innovations: (1) a\ndomain-adaptive state space model that partitions the latent representation\nspace into a shared subspace for learning cross-domain commonalities and\nindependent, domain-specific subspaces for capturing intra-domain\ndiscriminative features; (2) three distinct Domain Adapters, which serve as\ndomain-aware proxies to bridge disparate domain distributions and facilitate\nthe alignment of cross-domain commonalities. Extensive experiments demonstrate\nthe generalization and efficiency of Damba-ST. It achieves state-of-the-art\nperformance on prediction tasks and demonstrates strong zero-shot\ngeneralization, enabling seamless deployment in new urban environments without\nextensive retraining or fine-tuning.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18946", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18946", "abs": "https://arxiv.org/abs/2506.18946", "authors": ["Zhe Dong", "Yuzhe Sun", "Tianzhu Liu", "Yanfeng Gu"], "title": "DiffRIS: Enhancing Referring Remote Sensing Image Segmentation with Pre-trained Text-to-Image Diffusion Models", "comment": null, "summary": "Referring remote sensing image segmentation (RRSIS) enables the precise\ndelineation of regions within remote sensing imagery through natural language\ndescriptions, serving critical applications in disaster response, urban\ndevelopment, and environmental monitoring. Despite recent advances, current\napproaches face significant challenges in processing aerial imagery due to\ncomplex object characteristics including scale variations, diverse\norientations, and semantic ambiguities inherent to the overhead perspective. To\naddress these limitations, we propose DiffRIS, a novel framework that harnesses\nthe semantic understanding capabilities of pre-trained text-to-image diffusion\nmodels for enhanced cross-modal alignment in RRSIS tasks. Our framework\nintroduces two key innovations: a context perception adapter (CP-adapter) that\ndynamically refines linguistic features through global context modeling and\nobject-aware reasoning, and a progressive cross-modal reasoning decoder (PCMRD)\nthat iteratively aligns textual descriptions with visual regions for precise\nsegmentation. The CP-adapter bridges the domain gap between general\nvision-language understanding and remote sensing applications, while PCMRD\nenables fine-grained semantic alignment through multi-scale feature\ninteraction. Comprehensive experiments on three benchmark datasets-RRSIS-D,\nRefSegRS, and RISBench-demonstrate that DiffRIS consistently outperforms\nexisting methods across all standard metrics, establishing a new\nstate-of-the-art for RRSIS tasks. The significant performance improvements\nvalidate the effectiveness of leveraging pre-trained diffusion models for\nremote sensing applications through our proposed adaptive framework.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "fine-grained"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.18985", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.18985", "abs": "https://arxiv.org/abs/2506.18985", "authors": ["Guanxi Shen"], "title": "GLIMPSE: Gradient-Layer Importance Mapping for Prompted Visual Saliency Explanation for Generative LVLMs", "comment": null, "summary": "Recent advances in large vision language models (LVLMs) have unlocked\nunprecedented capabilities in generating coherent responses from visual inputs.\nHowever, interpreting where LVLMs direct their visual attention while\ngenerating free-form textual responses remains a significant challenge, yet is\nessential for understanding model behavior, diagnosing hallucination, exposing\nbias and ensuring transparency. We introduce GLIMPSE (Gradient-Layer Importance\nMapping for Prompted Visual Saliency Explanation), a lightweight,\nmodel-agnostic framework for visualizing the salient image regions that LVLMs\nrely upon during open-ended visual question answering (VQA), while concurrently\nrevealing the multimodal textual saliency. GLIMPSE fuses gradient-weighted\nattention, adaptive layer propagation, and weighted token aggregation to\nproduce holistic response-level attribution heat maps for interpreting\ncross-modal reasoning, outperforming prior interpretability methods in\nhuman-alignment. We demonstrate an analytic explainable AI (XAI) approach using\nGLIMPSE to uncover fine-grained insights into LVLM cross-modal attribution,\ntrace token-level reasoning dynamics, and analyze systematic human-attention\nmisalignment, hallucination, and bias.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["question answering", "fine-grained"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19037", "categories": ["cs.CL", "cs.AI", "cs.IT", "cs.LG", "cs.NE", "math.IT"], "pdf": "https://arxiv.org/pdf/2506.19037", "abs": "https://arxiv.org/abs/2506.19037", "authors": ["Omer Luxembourg", "Haim Permuter", "Eliya Nachmani"], "title": "Plan for Speed -- Dilated Scheduling for Masked Diffusion Language Models", "comment": null, "summary": "Masked diffusion language models (MDLM) have shown strong promise for\nnon-autoregressive text generation, yet existing samplers act as implicit\nplanners, selecting tokens to unmask via denoiser confidence or entropy scores.\nSuch heuristics falter under parallel unmasking - they ignore pairwise\ninteractions between tokens and cannot account for dependencies when unmasking\nmultiple positions at once, limiting their inference time to traditional\nauto-regressive (AR) models. We introduce the Dilated-scheduled Unmasking\nStrategy (DUS), an inference-only, planner-model-free method that requires no\nadditional training. DUS leverages a first-order Markov assumption to partition\nsequence positions into dilation-based groups of non-adjacent tokens, enabling\nindependent, parallel unmasking steps that respect local context that minimizes\nthe joint entropy of each iteration step. Unlike semi-AR block approaches\n(e.g., LLADA and Dream) that still invoke the denoiser per block, DUS reduces\nthe number of denoiser calls to O(log B) per generation block - yielding\nsubstantial speedup over the O(B) run time of state-of-the-art diffusion\nmodels, where B is the block size in the semi-AR inference process. In\nexperiments on math (GSM8K) and code completion (Humaneval, MBPP) benchmarks -\ndomains suited to non-ordinal generation - DUS improves scores over parallel\nconfidence-based planner, without modifying the underlying denoiser. DUS offers\na lightweight, budget-aware approach to efficient, high-quality text\ngeneration, paving the way to unlock the true capabilities of MDLMs.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["pairwise"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19665", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19665", "abs": "https://arxiv.org/abs/2506.19665", "authors": ["Yuanhe Tian", "Lei Mao", "Yan Song"], "title": "Recurrent Visual Feature Extraction and Stereo Attentions for CT Report Generation", "comment": "7 pages, 3 figures", "summary": "Generating reports for computed tomography (CT) images is a challenging task,\nwhile similar to existing studies for medical image report generation, yet has\nits unique characteristics, such as spatial encoding of multiple images,\nalignment between image volume and texts, etc. Existing solutions typically use\ngeneral 2D or 3D image processing techniques to extract features from a CT\nvolume, where they firstly compress the volume and then divide the compressed\nCT slices into patches for visual encoding. These approaches do not explicitly\naccount for the transformations among CT slices, nor do they effectively\nintegrate multi-level image features, particularly those containing specific\norgan lesions, to instruct CT report generation (CTRG). In considering the\nstrong correlation among consecutive slices in CT scans, in this paper, we\npropose a large language model (LLM) based CTRG method with recurrent visual\nfeature extraction and stereo attentions for hierarchical feature modeling.\nSpecifically, we use a vision Transformer to recurrently process each slice in\na CT volume, and employ a set of attentions over the encoded slices from\ndifferent perspectives to selectively obtain important visual information and\nalign them with textual features, so as to better instruct an LLM for CTRG.\nExperiment results and further analysis on the benchmark M3D-Cap dataset show\nthat our method outperforms strong baseline models and achieves\nstate-of-the-art results, demonstrating its validity and effectiveness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "correlation"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19807", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2506.19807", "abs": "https://arxiv.org/abs/2506.19807", "authors": ["Baochang Ren", "Shuofei Qiao", "Wenhao Yu", "Huajun Chen", "Ningyu Zhang"], "title": "KnowRL: Exploring Knowledgeable Reinforcement Learning for Factuality", "comment": "Work in progress", "summary": "Large Language Models (LLMs), particularly slow-thinking models, often\nexhibit severe hallucination, outputting incorrect content due to an inability\nto accurately recognize knowledge boundaries during reasoning. While\nReinforcement Learning (RL) can enhance complex reasoning abilities, its\noutcome-oriented reward mechanism often lacks factual supervision over the\nthinking process, further exacerbating the hallucination problem. To address\nthe high hallucination in slow-thinking models, we propose Knowledge-enhanced\nRL, KnowRL. KnowRL guides models to perform fact-based slow thinking by\nintegrating a factuality reward, based on knowledge verification, into the RL\ntraining process, helping them recognize their knowledge boundaries. KnowRL\nguides models to perform fact-based slow thinking by integrating a factuality\nreward, based on knowledge verification, into the RL training process, helping\nthem recognize their knowledge boundaries. This targeted factual input during\nRL training enables the model to learn and internalize fact-based reasoning\nstrategies. By directly rewarding adherence to facts within the reasoning\nsteps, KnowRL fosters a more reliable thinking process. Experimental results on\nthree hallucination evaluation datasets and two reasoning evaluation datasets\ndemonstrate that KnowRL effectively mitigates hallucinations in slow-thinking\nmodels while maintaining their original strong reasoning capabilities. Our code\nis available at https://github.com/zjunlp/KnowRL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "factuality"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19442", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19442", "abs": "https://arxiv.org/abs/2506.19442", "authors": ["Róisín Luo", "James McDermott", "Colm O'Riordan"], "title": "Sampling Matters in Explanations: Towards Trustworthy Attribution Analysis Building Block in Visual Models through Maximizing Explanation Certainty", "comment": "Code:\n  https://anonymous.4open.science/r/sampling_matters_reproducibility-BB60/", "summary": "Image attribution analysis seeks to highlight the feature representations\nlearned by visual models such that the highlighted feature maps can reflect the\npixel-wise importance of inputs. Gradient integration is a building block in\nthe attribution analysis by integrating the gradients from multiple derived\nsamples to highlight the semantic features relevant to inferences. Such a\nbuilding block often combines with other information from visual models such as\nactivation or attention maps to form ultimate explanations. Yet, our\ntheoretical analysis demonstrates that the extent to the alignment of the\nsample distribution in gradient integration with respect to natural image\ndistribution gives a lower bound of explanation certainty. Prior works add\nnoise into images as samples and the noise distributions can lead to low\nexplanation certainty. Counter-intuitively, our experiment shows that extra\ninformation can saturate neural networks. To this end, building trustworthy\nattribution analysis needs to settle the sample distribution misalignment\nproblem. Instead of adding extra information into input images, we present a\nsemi-optimal sampling approach by suppressing features from inputs. The sample\ndistribution by suppressing features is approximately identical to the\ndistribution of natural images. Our extensive quantitative evaluation on large\nscale dataset ImageNet affirms that our approach is effective and able to yield\nmore satisfactory explanations against state-of-the-art baselines throughout\nall experimental models.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "dataset"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19087", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19087", "abs": "https://arxiv.org/abs/2506.19087", "authors": ["Bowen Zhang", "Jesse T. Boulerice", "Nikhil Kuniyil", "Charvi Mendiratta", "Satish Kumar", "Hila Shamon", "B. S. Manjunath"], "title": "RareSpot: Spotting Small and Rare Wildlife in Aerial Imagery with Multi-Scale Consistency and Context-Aware Augmentation", "comment": "Accepted to the CVPR 2025 Workshop on Computer Vision for Animal\n  Behavior Tracking and Modeling (CV4Animals)", "summary": "Automated detection of small and rare wildlife in aerial imagery is crucial\nfor effective conservation, yet remains a significant technical challenge.\nPrairie dogs exemplify this issue: their ecological importance as keystone\nspecies contrasts sharply with their elusive presence--marked by small size,\nsparse distribution, and subtle visual features--which undermines existing\ndetection approaches. To address these challenges, we propose RareSpot, a\nrobust detection framework integrating multi-scale consistency learning and\ncontext-aware augmentation. Our multi-scale consistency approach leverages\nstructured alignment across feature pyramids, enhancing fine-grained object\nrepresentation and mitigating scale-related feature loss. Complementarily,\ncontext-aware augmentation strategically synthesizes challenging training\ninstances by embedding difficult-to-detect samples into realistic environmental\ncontexts, significantly boosting model precision and recall. Evaluated on an\nexpert-annotated prairie dog drone imagery benchmark, our method achieves\nstate-of-the-art performance, improving detection accuracy by over 35% compared\nto baseline methods. Importantly, it generalizes effectively across additional\nwildlife datasets, demonstrating broad applicability. The RareSpot benchmark\nand approach not only support critical ecological monitoring but also establish\na new foundation for detecting small, rare species in complex aerial scenes.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "consistency", "accuracy", "fine-grained"], "score": 4}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19848", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19848", "abs": "https://arxiv.org/abs/2506.19848", "authors": ["Long Xing", "Qidong Huang", "Xiaoyi Dong", "Pan Zhang", "Yuhang Zang", "Yuhang Cao", "Jinsong Li", "Shuangrui Ding", "Weiming Zhang", "Nenghai Yu", "Jiaqi Wang", "Feng Wu", "Dahua Lin"], "title": "ScaleCap: Inference-Time Scalable Image Captioning via Dual-Modality Debiasing", "comment": "Code is available at https://github.com/Cooperx521/ScaleCap", "summary": "This paper presents ScaleCap, an inference-time scalable image captioning\nstrategy that generates comprehensive and detailed image captions. The key\nchallenges of high-quality image captioning lie in the inherent biases of\nLVLMs: multimodal bias resulting in imbalanced descriptive granularity,\noffering detailed accounts of some elements while merely skimming over others;\nlinguistic bias leading to hallucinated descriptions of non-existent objects.\nTo address these issues, we propose a scalable debiased captioning strategy,\nwhich continuously enriches and calibrates the caption with increased inference\nbudget. Specifically, we propose two novel components: heuristic question\nanswering and contrastive sentence rating. The former generates\ncontent-specific questions based on the image and answers them to progressively\ninject relevant information into the caption. The latter employs sentence-level\noffline contrastive decoding to effectively identify and eliminate\nhallucinations caused by linguistic biases. With increased inference cost, more\nheuristic questions are raised by ScaleCap to progressively capture additional\nvisual details, generating captions that are more accurate, balanced, and\ninformative. Extensive modality alignment experiments demonstrate the\neffectiveness of ScaleCap. Annotating 450K images with ScaleCap and using them\nfor LVLM pretraining leads to consistent performance gains across 11 widely\nused benchmarks. Furthermore, ScaleCap showcases superb richness and fidelity\nof generated captions with two additional tasks: replacing images with captions\nin VQA task, and reconstructing images from captions to assess semantic\ncoverage. Code is available at https://github.com/Cooperx521/ScaleCap.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19469", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19469", "abs": "https://arxiv.org/abs/2506.19469", "authors": ["Pengfei Hao", "Shuaibo Li", "Hongqiu Wang", "Zhizhuo Kou", "Junhang Zhang", "Guang Yang", "Lei Zhu"], "title": "Surgery-R1: Advancing Surgical-VQLA with Reasoning Multimodal Large Language Model via Reinforcement Learning", "comment": null, "summary": "In recent years, significant progress has been made in the field of surgical\nscene understanding, particularly in the task of Visual Question\nLocalized-Answering in robotic surgery (Surgical-VQLA). However, existing\nSurgical-VQLA models lack deep reasoning capabilities and interpretability in\nsurgical scenes, which limits their reliability and potential for development\nin clinical applications. To address this issue, inspired by the development of\nReasoning Multimodal Large Language Models (MLLMs), we first build the\nSurgery-R1-54k dataset, including paired data for Visual-QA, Grounding-QA, and\nChain-of-Thought (CoT). Then, we propose the first Reasoning MLLM for\nSurgical-VQLA (Surgery-R1). In our Surgery-R1, we design a two-stage\nfine-tuning mechanism to enable the basic MLLM with complex reasoning abilities\nby utilizing supervised fine-tuning (SFT) and reinforcement fine-tuning (RFT).\nFurthermore, for an efficient and high-quality rule-based reward system in our\nRFT, we design a Multimodal Coherence reward mechanism to mitigate positional\nillusions that may arise in surgical scenarios. Experiment results demonstrate\nthat Surgery-R1 outperforms other existing state-of-the-art (SOTA) models in\nthe Surgical-VQLA task and widely-used MLLMs, while also validating its\nreasoning capabilities and the effectiveness of our approach. The code and\ndataset will be organized in https://github.com/FiFi-HAO467/Surgery-R1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19279", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19279", "abs": "https://arxiv.org/abs/2506.19279", "authors": ["Zhiyang Qi", "Keiko Takamizo", "Mariko Ukiyo", "Michimasa Inaba"], "title": "EmoStage: A Framework for Accurate Empathetic Response Generation via Perspective-Taking and Phase Recognition", "comment": null, "summary": "The rising demand for mental health care has fueled interest in AI-driven\ncounseling systems. While large language models (LLMs) offer significant\npotential, current approaches face challenges, including limited understanding\nof clients' psychological states and counseling stages, reliance on\nhigh-quality training data, and privacy concerns associated with commercial\ndeployment. To address these issues, we propose EmoStage, a framework that\nenhances empathetic response generation by leveraging the inference\ncapabilities of open-source LLMs without additional training data. Our\nframework introduces perspective-taking to infer clients' psychological states\nand support needs, enabling the generation of emotionally resonant responses.\nIn addition, phase recognition is incorporated to ensure alignment with the\ncounseling process and to prevent contextually inappropriate or inopportune\nresponses. Experiments conducted in both Japanese and Chinese counseling\nsettings demonstrate that EmoStage improves the quality of responses generated\nby base models and performs competitively with data-driven methods.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19312", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19312", "abs": "https://arxiv.org/abs/2506.19312", "authors": ["Junsei Tokumitsu", "Yuiga Wada"], "title": "Capturing Fine-Grained Alignments Improves 3D Affordance Detection", "comment": "MVA 2025 (Oral)", "summary": "In this work, we address the challenge of affordance detection in 3D point\nclouds, a task that requires effectively capturing fine-grained alignments\nbetween point clouds and text. Existing methods often struggle to model such\nalignments, resulting in limited performance on standard benchmarks. A key\nlimitation of these approaches is their reliance on simple cosine similarity\nbetween point cloud and text embeddings, which lacks the expressiveness needed\nfor fine-grained reasoning. To address this limitation, we propose LM-AD, a\nnovel method for affordance detection in 3D point clouds. Moreover, we\nintroduce the Affordance Query Module (AQM), which efficiently captures\nfine-grained alignment between point clouds and text by leveraging a pretrained\nlanguage model. We demonstrated that our method outperformed existing\napproaches in terms of accuracy and mean Intersection over Union on the 3D\nAffordanceNet dataset.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy", "fine-grained"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19352", "categories": ["cs.CL", "cs.AI", "cs.HC"], "pdf": "https://arxiv.org/pdf/2506.19352", "abs": "https://arxiv.org/abs/2506.19352", "authors": ["Jisu Shin", "Juhyun Oh", "Eunsu Kim", "Hoyun Song", "Alice Oh"], "title": "Spotting Out-of-Character Behavior: Atomic-Level Evaluation of Persona Fidelity in Open-Ended Generation", "comment": "Findings of ACL 2025; github repo:\n  https://github.com/ddindidu/atomic-persona-evaluation/", "summary": "Ensuring persona fidelity in large language models (LLMs) is essential for\nmaintaining coherent and engaging human-AI interactions. However, LLMs often\nexhibit Out-of-Character (OOC) behavior, where generated responses deviate from\nan assigned persona, leading to inconsistencies that affect model reliability.\nExisting evaluation methods typically assign single scores to entire responses,\nstruggling to capture subtle persona misalignment, particularly in long-form\ntext generation. To address this limitation, we propose an atomic-level\nevaluation framework that quantifies persona fidelity at a finer granularity.\nOur three key metrics measure the degree of persona alignment and consistency\nwithin and across generations. Our approach enables a more precise and\nrealistic assessment of persona fidelity by identifying subtle deviations that\nreal users would encounter. Through our experiments, we demonstrate that our\nframework effectively detects persona inconsistencies that prior methods\noverlook. By analyzing persona fidelity across diverse tasks and personality\ntypes, we reveal how task structure and persona desirability influence model\nadaptability, highlighting challenges in maintaining consistent persona\nexpression.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "consistency", "reliability"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19467", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19467", "abs": "https://arxiv.org/abs/2506.19467", "authors": ["Jingwei Ni", "Yu Fan", "Vilém Zouhar", "Donya Rooein", "Alexander Hoyle", "Mrinmaya Sachan", "Markus Leippold", "Dirk Hovy", "Elliott Ash"], "title": "Can Large Language Models Capture Human Annotator Disagreements?", "comment": "Preprint Under Review", "summary": "Human annotation variation (i.e., annotation disagreements) is common in NLP\nand often reflects important information such as task subjectivity and sample\nambiguity. While Large Language Models (LLMs) are increasingly used for\nautomatic annotation to reduce human effort, their evaluation often focuses on\npredicting the majority-voted \"ground truth\" labels. It is still unclear,\nhowever, whether these models also capture informative human annotation\nvariation. Our work addresses this gap by extensively evaluating LLMs' ability\nto predict annotation disagreements without access to repeated human labels.\nOur results show that LLMs struggle with modeling disagreements, which can be\noverlooked by majority label-based evaluations. Notably, while RLVR-style\n(Reinforcement learning with verifiable rewards) reasoning generally boosts LLM\nperformance, it degrades performance in disagreement prediction. Our findings\nhighlight the critical need for evaluating and improving LLM annotators in\ndisagreement modeling. Code and data at\nhttps://github.com/EdisonNi-hku/Disagreement_Prediction.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "annotation"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19468", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19468", "abs": "https://arxiv.org/abs/2506.19468", "authors": ["Wenhan Han", "Yifan Zhang", "Zhixun Chen", "Binbin Liu", "Haobin Lin", "Bingni Zhang", "Taifeng Wang", "Mykola Pechenizkiy", "Meng Fang", "Yin Zheng"], "title": "MuBench: Assessment of Multilingual Capabilities of Large Language Models Across 61 Languages", "comment": null, "summary": "Multilingual large language models (LLMs) are advancing rapidly, with new\nmodels frequently claiming support for an increasing number of languages.\nHowever, existing evaluation datasets are limited and lack cross-lingual\nalignment, leaving assessments of multilingual capabilities fragmented in both\nlanguage and skill coverage. To address this, we introduce MuBench, a benchmark\ncovering 61 languages and evaluating a broad range of capabilities. We evaluate\nseveral state-of-the-art multilingual LLMs and find notable gaps between\nclaimed and actual language coverage, particularly a persistent performance\ndisparity between English and low-resource languages. Leveraging MuBench's\nalignment, we propose Multilingual Consistency (MLC) as a complementary metric\nto accuracy for analyzing performance bottlenecks and guiding model\nimprovement. Finally, we pretrain a suite of 1.2B-parameter models on English\nand Chinese with 500B tokens, varying language ratios and parallel data\nproportions to investigate cross-lingual transfer dynamics.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "evaluation", "consistency", "accuracy"], "score": 4}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19469", "categories": ["cs.CV", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19469", "abs": "https://arxiv.org/abs/2506.19469", "authors": ["Pengfei Hao", "Shuaibo Li", "Hongqiu Wang", "Zhizhuo Kou", "Junhang Zhang", "Guang Yang", "Lei Zhu"], "title": "Surgery-R1: Advancing Surgical-VQLA with Reasoning Multimodal Large Language Model via Reinforcement Learning", "comment": null, "summary": "In recent years, significant progress has been made in the field of surgical\nscene understanding, particularly in the task of Visual Question\nLocalized-Answering in robotic surgery (Surgical-VQLA). However, existing\nSurgical-VQLA models lack deep reasoning capabilities and interpretability in\nsurgical scenes, which limits their reliability and potential for development\nin clinical applications. To address this issue, inspired by the development of\nReasoning Multimodal Large Language Models (MLLMs), we first build the\nSurgery-R1-54k dataset, including paired data for Visual-QA, Grounding-QA, and\nChain-of-Thought (CoT). Then, we propose the first Reasoning MLLM for\nSurgical-VQLA (Surgery-R1). In our Surgery-R1, we design a two-stage\nfine-tuning mechanism to enable the basic MLLM with complex reasoning abilities\nby utilizing supervised fine-tuning (SFT) and reinforcement fine-tuning (RFT).\nFurthermore, for an efficient and high-quality rule-based reward system in our\nRFT, we design a Multimodal Coherence reward mechanism to mitigate positional\nillusions that may arise in surgical scenarios. Experiment results demonstrate\nthat Surgery-R1 outperforms other existing state-of-the-art (SOTA) models in\nthe Surgical-VQLA task and widely-used MLLMs, while also validating its\nreasoning capabilities and the effectiveness of our approach. The code and\ndataset will be organized in https://github.com/FiFi-HAO467/Surgery-R1.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "reliability"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19549", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.19549", "abs": "https://arxiv.org/abs/2506.19549", "authors": ["Debabrata Mahapatra", "Shubham Agarwal", "Apoorv Saxena", "Subrata Mitra"], "title": "RCStat: A Statistical Framework for using Relative Contextualization in Transformers", "comment": null, "summary": "Prior work on input-token importance in auto-regressive transformers has\nrelied on Softmax-normalized attention weights, which obscure the richer\nstructure of pre-Softmax query-key logits. We introduce RCStat, a statistical\nframework that harnesses raw attention logits via Relative Contextualization\n(RC), a random variable measuring contextual alignment between token segments,\nand derive an efficient upper bound for RC. We demonstrate two applications:\n(i) Key-Value compression, where RC-based thresholds drive adaptive key-value\neviction for substantial cache reduction with minimal quality loss; and (ii)\nAttribution, where RC yields higher-fidelity token-, sentence-, and chunk-level\nexplanations than post-Softmax methods. Across question answering,\nsummarization, and attribution benchmarks, RCStat achieves significant\nempirical gains, delivering state-of-the-art compression and attribution\nperformance without any model retraining.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["summarization", "question answering"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19665", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19665", "abs": "https://arxiv.org/abs/2506.19665", "authors": ["Yuanhe Tian", "Lei Mao", "Yan Song"], "title": "Recurrent Visual Feature Extraction and Stereo Attentions for CT Report Generation", "comment": "7 pages, 3 figures", "summary": "Generating reports for computed tomography (CT) images is a challenging task,\nwhile similar to existing studies for medical image report generation, yet has\nits unique characteristics, such as spatial encoding of multiple images,\nalignment between image volume and texts, etc. Existing solutions typically use\ngeneral 2D or 3D image processing techniques to extract features from a CT\nvolume, where they firstly compress the volume and then divide the compressed\nCT slices into patches for visual encoding. These approaches do not explicitly\naccount for the transformations among CT slices, nor do they effectively\nintegrate multi-level image features, particularly those containing specific\norgan lesions, to instruct CT report generation (CTRG). In considering the\nstrong correlation among consecutive slices in CT scans, in this paper, we\npropose a large language model (LLM) based CTRG method with recurrent visual\nfeature extraction and stereo attentions for hierarchical feature modeling.\nSpecifically, we use a vision Transformer to recurrently process each slice in\na CT volume, and employ a set of attentions over the encoded slices from\ndifferent perspectives to selectively obtain important visual information and\nalign them with textual features, so as to better instruct an LLM for CTRG.\nExperiment results and further analysis on the benchmark M3D-Cap dataset show\nthat our method outperforms strong baseline models and achieves\nstate-of-the-art results, demonstrating its validity and effectiveness.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["benchmark", "dataset", "correlation"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19571", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19571", "abs": "https://arxiv.org/abs/2506.19571", "authors": ["Lorenzo Proietti", "Stefano Perrella", "Roberto Navigli"], "title": "Has Machine Translation Evaluation Achieved Human Parity? The Human Reference and the Limits of Progress", "comment": "Accepted at ACL 2025 Main Conference. 24 pages", "summary": "In Machine Translation (MT) evaluation, metric performance is assessed based\non agreement with human judgments. In recent years, automatic metrics have\ndemonstrated increasingly high levels of agreement with humans. To gain a\nclearer understanding of metric performance and establish an upper bound, we\nincorporate human baselines in the MT meta-evaluation, that is, the assessment\nof MT metrics' capabilities. Our results show that human annotators are not\nconsistently superior to automatic metrics, with state-of-the-art metrics often\nranking on par with or higher than human baselines. Despite these findings\nsuggesting human parity, we discuss several reasons for caution. Finally, we\nexplore the broader implications of our results for the research field, asking:\nCan we still reliably measure improvements in MT evaluation? With this work, we\naim to shed light on the limits of our ability to measure progress in the\nfield, fostering discussion on an issue that we believe is crucial to the\nentire MT evaluation community.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["ranking"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "agreement"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19599", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19599", "abs": "https://arxiv.org/abs/2506.19599", "authors": ["Zhenke Duan", "Jiqun Pan", "Jiani Tu", "Xiaoyi Wang", "Yanqing Wang"], "title": "ECCoT: A Framework for Enhancing Effective Cognition via Chain of Thought in Large Language Model", "comment": null, "summary": "In the era of large-scale artificial intelligence, Large Language Models\n(LLMs) have made significant strides in natural language processing. However,\nthey often lack transparency and generate unreliable outputs, raising concerns\nabout their interpretability. To address this, the Chain of Thought (CoT)\nprompting method structures reasoning into step-by-step deductions. Yet, not\nall reasoning chains are valid, and errors can lead to unreliable conclusions.\nWe propose ECCoT, an End-to-End Cognitive Chain of Thought Validation\nFramework, to evaluate and refine reasoning chains in LLMs. ECCoT integrates\nthe Markov Random Field-Embedded Topic Model (MRF-ETM) for topic-aware CoT\ngeneration and Causal Sentence-BERT (CSBert) for causal reasoning alignment. By\nfiltering ineffective chains using structured ordering statistics, ECCoT\nimproves interpretability, reduces biases, and enhances the trustworthiness of\nLLM-based decision-making. Key contributions include the introduction of ECCoT,\nMRF-ETM for topic-driven CoT generation, and CSBert for causal reasoning\nenhancement. Code is released at: https://github.com/erwinmsmith/ECCoT.git.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale", "chain of thought"], "score": 2}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19747", "categories": ["cs.CV", "cs.RO", "I.2.10; I.2.9; I.4.8; I.4.9"], "pdf": "https://arxiv.org/pdf/2506.19747", "abs": "https://arxiv.org/abs/2506.19747", "authors": ["Stephanie Käs", "Sven Peter", "Henrik Thillmann", "Anton Burenko", "David Benjamin Adrian", "Dennis Mack", "Timm Linder", "Bastian Leibe"], "title": "Systematic Comparison of Projection Methods for Monocular 3D Human Pose Estimation on Fisheye Images", "comment": "Presented at IEEE International Conference on Robotics and Automation\n  2025", "summary": "Fisheye cameras offer robots the ability to capture human movements across a\nwider field of view (FOV) than standard pinhole cameras, making them\nparticularly useful for applications in human-robot interaction and automotive\ncontexts. However, accurately detecting human poses in fisheye images is\nchallenging due to the curved distortions inherent to fisheye optics. While\nvarious methods for undistorting fisheye images have been proposed, their\neffectiveness and limitations for poses that cover a wide FOV has not been\nsystematically evaluated in the context of absolute human pose estimation from\nmonocular fisheye images. To address this gap, we evaluate the impact of\npinhole, equidistant and double sphere camera models, as well as cylindrical\nprojection methods, on 3D human pose estimation accuracy. We find that in\nclose-up scenarios, pinhole projection is inadequate, and the optimal\nprojection method varies with the FOV covered by the human pose. The usage of\nadvanced fisheye models like the double sphere model significantly enhances 3D\nhuman pose estimation accuracy. We propose a heuristic for selecting the\nappropriate projection model based on the detection bounding box to enhance\nprediction quality. Additionally, we introduce and evaluate on our novel\ndataset FISHnCHIPS, which features 3D human skeleton annotations in fisheye\nimages, including images from unconventional angles, such as extreme close-ups,\nground-mounted cameras, and wide-FOV poses, available at:\nhttps://www.vision.rwth-aachen.de/fishnchips", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset", "accuracy"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19652", "categories": ["cs.CL", "cs.AI"], "pdf": "https://arxiv.org/pdf/2506.19652", "abs": "https://arxiv.org/abs/2506.19652", "authors": ["Lucie Galland", "Catherine Pelachaud", "Florian Pecune"], "title": "Tailored Conversations beyond LLMs: A RL-Based Dialogue Manager", "comment": null, "summary": "In this work, we propose a novel framework that integrates large language\nmodels (LLMs) with an RL-based dialogue manager for open-ended dialogue with a\nspecific goal. By leveraging hierarchical reinforcement learning to model the\nstructured phases of dialogue and employ meta-learning to enhance adaptability\nacross diverse user profiles, our approach enhances adaptability and\nefficiency, enabling the system to learn from limited data, transition fluidly\nbetween dialogue phases, and personalize responses to heterogeneous patient\nneeds. We apply our framework to Motivational Interviews, aiming to foster\nbehavior change, and demonstrate that the proposed dialogue manager outperforms\na state-of-the-art LLM baseline in terms of reward, showing a potential benefit\nof conditioning LLMs to create open-ended dialogue systems with specific goals.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dialogue"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19808", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19808", "abs": "https://arxiv.org/abs/2506.19808", "authors": ["Yitao Peng", "Lianghua He", "Die Hu"], "title": "One Prototype Is Enough: Single-Prototype Activation for Interpretable Image Classification", "comment": null, "summary": "In this paper, we propose ProtoSolo, a novel deep neural architecture for\ninterpretable image classification inspired by prototypical networks such as\nProtoPNet. Existing prototype networks usually rely on the collaborative\ndecision-making of multiple prototypes to achieve the classification and\ninterpretation of a single category. In contrast, ProtoSolo only requires the\nactivation of a single prototype to complete the classification. This allows\nthe network to explain each category decision by only providing the features\nthat are most similar to the prototype of that category, significantly reducing\nthe cognitive complexity of the explanation. Secondly, we propose a\nfeature-based comparison method, which uses feature map instead of full-channel\nfeature vector as the object of similarity comparison and prototype learning.\nThis design enables ProtoSolo to utilize richer global information for\nclassification while relying on a single prototype activation. In addition, we\npropose a non-prototype projection learning strategy, which preserves the\ninformation association between the prototype and the training image patches\nwhile avoiding the sharp change of the network structure caused by the\nprojection operation, thus avoiding its negative impact on the classification\nperformance. Experiments on the CUB-200-2011 and Stanford Cars datasets show\nthat ProtoSolo achieves superior performance in classification tasks and\nreaches the best level in terms of cognitive complexity of explanations\ncompared to state-of-the-art interpretable methods. The code is available at\nhttps://github.com/pyt19/ProtoSolo.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19708", "categories": ["cs.GR", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19708", "abs": "https://arxiv.org/abs/2506.19708", "authors": ["Matyas Bohacek", "Thomas Fel", "Maneesh Agrawala", "Ekdeep Singh Lubana"], "title": "Uncovering Conceptual Blindspots in Generative Image Models Using Sparse Autoencoders", "comment": null, "summary": "Despite their impressive performance, generative image models trained on\nlarge-scale datasets frequently fail to produce images with seemingly simple\nconcepts -- e.g., human hands or objects appearing in groups of four -- that\nare reasonably expected to appear in the training data. These failure modes\nhave largely been documented anecdotally, leaving open the question of whether\nthey reflect idiosyncratic anomalies or more structural limitations of these\nmodels. To address this, we introduce a systematic approach for identifying and\ncharacterizing \"conceptual blindspots\" -- concepts present in the training data\nbut absent or misrepresented in a model's generations. Our method leverages\nsparse autoencoders (SAEs) to extract interpretable concept embeddings,\nenabling a quantitative comparison of concept prevalence between real and\ngenerated images. We train an archetypal SAE (RA-SAE) on DINOv2 features with\n32,000 concepts -- the largest such SAE to date -- enabling fine-grained\nanalysis of conceptual disparities. Applied to four popular generative models\n(Stable Diffusion 1.5/2.1, PixArt, and Kandinsky), our approach reveals\nspecific suppressed blindspots (e.g., bird feeders, DVD discs, and whitespaces\non documents) and exaggerated blindspots (e.g., wood background texture and\npalm trees). At the individual datapoint level, we further isolate memorization\nartifacts -- instances where models reproduce highly specific visual templates\nseen during training. Overall, we propose a theoretically grounded framework\nfor systematically identifying conceptual blindspots in generative models by\nassessing their conceptual fidelity with respect to the underlying\ndata-generating process.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19838", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19838", "abs": "https://arxiv.org/abs/2506.19838", "authors": ["Liangbin Xie", "Yu Li", "Shian Du", "Menghan Xia", "Xintao Wang", "Fanghua Yu", "Ziyan Chen", "Pengfei Wan", "Jiantao Zhou", "Chao Dong"], "title": "SimpleGVR: A Simple Baseline for Latent-Cascaded Video Super-Resolution", "comment": "Project webpage available at https://simplegvr.github.io/", "summary": "Latent diffusion models have emerged as a leading paradigm for efficient\nvideo generation. However, as user expectations shift toward higher-resolution\noutputs, relying solely on latent computation becomes inadequate. A promising\napproach involves decoupling the process into two stages: semantic content\ngeneration and detail synthesis. The former employs a computationally intensive\nbase model at lower resolutions, while the latter leverages a lightweight\ncascaded video super-resolution (VSR) model to achieve high-resolution output.\nIn this work, we focus on studying key design principles for latter cascaded\nVSR models, which are underexplored currently. First, we propose two\ndegradation strategies to generate training pairs that better mimic the output\ncharacteristics of the base model, ensuring alignment between the VSR model and\nits upstream generator. Second, we provide critical insights into VSR model\nbehavior through systematic analysis of (1) timestep sampling strategies, (2)\nnoise augmentation effects on low-resolution (LR) inputs. These findings\ndirectly inform our architectural and training innovations. Finally, we\nintroduce interleaving temporal unit and sparse local attention to achieve\nefficient training and inference, drastically reducing computational overhead.\nExtensive experiments demonstrate the superiority of our framework over\nexisting methods, with ablation studies confirming the efficacy of each design\nchoice. Our work establishes a simple yet effective baseline for cascaded video\nsuper-resolution generation, offering practical insights to guide future\nadvancements in efficient cascaded synthesis systems.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["sampling strategies"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19767", "categories": ["cs.CL", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2506.19767", "abs": "https://arxiv.org/abs/2506.19767", "authors": ["Yuqian Fu", "Tinghong Chen", "Jiajun Chai", "Xihuai Wang", "Songjun Tu", "Guojun Yin", "Wei Lin", "Qichao Zhang", "Yuanheng Zhu", "Dongbin Zhao"], "title": "SRFT: A Single-Stage Method with Supervised and Reinforcement Fine-Tuning for Reasoning", "comment": null, "summary": "Large language models (LLMs) have achieved remarkable progress in reasoning\ntasks, yet the optimal integration of Supervised Fine-Tuning (SFT) and\nReinforcement Learning (RL) remains a fundamental challenge. Through\ncomprehensive analysis of token distributions, learning dynamics, and\nintegration mechanisms from entropy-based perspectives, we reveal key\ndifferences between these paradigms: SFT induces coarse-grained global changes\nto LLM policy distributions, while RL performs fine-grained selective\noptimizations, with entropy serving as a critical indicator of training\neffectiveness. Building on these observations, we propose Supervised\nReinforcement Fine-Tuning (SRFT), a single-stage method that unifies both\nfine-tuning paradigms through entropy-aware weighting mechanisms. Our approach\nsimultaneously applies SFT and RL to directly optimize the LLM using\ndemonstrations and self-exploration rollouts rather than through two-stage\nsequential methods. Extensive experiments show that SRFT achieves 59.1% average\naccuracy, outperforming zero-RL methods by 9.0% on five mathematical reasoning\nbenchmarks and 10.9% on three out-of-distribution benchmarks.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["accuracy", "mathematical reasoning", "fine-grained"], "score": 3}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19848", "categories": ["cs.CV", "cs.CL"], "pdf": "https://arxiv.org/pdf/2506.19848", "abs": "https://arxiv.org/abs/2506.19848", "authors": ["Long Xing", "Qidong Huang", "Xiaoyi Dong", "Pan Zhang", "Yuhang Zang", "Yuhang Cao", "Jinsong Li", "Shuangrui Ding", "Weiming Zhang", "Nenghai Yu", "Jiaqi Wang", "Feng Wu", "Dahua Lin"], "title": "ScaleCap: Inference-Time Scalable Image Captioning via Dual-Modality Debiasing", "comment": "Code is available at https://github.com/Cooperx521/ScaleCap", "summary": "This paper presents ScaleCap, an inference-time scalable image captioning\nstrategy that generates comprehensive and detailed image captions. The key\nchallenges of high-quality image captioning lie in the inherent biases of\nLVLMs: multimodal bias resulting in imbalanced descriptive granularity,\noffering detailed accounts of some elements while merely skimming over others;\nlinguistic bias leading to hallucinated descriptions of non-existent objects.\nTo address these issues, we propose a scalable debiased captioning strategy,\nwhich continuously enriches and calibrates the caption with increased inference\nbudget. Specifically, we propose two novel components: heuristic question\nanswering and contrastive sentence rating. The former generates\ncontent-specific questions based on the image and answers them to progressively\ninject relevant information into the caption. The latter employs sentence-level\noffline contrastive decoding to effectively identify and eliminate\nhallucinations caused by linguistic biases. With increased inference cost, more\nheuristic questions are raised by ScaleCap to progressively capture additional\nvisual details, generating captions that are more accurate, balanced, and\ninformative. Extensive modality alignment experiments demonstrate the\neffectiveness of ScaleCap. Annotating 450K images with ScaleCap and using them\nfor LVLM pretraining leads to consistent performance gains across 11 widely\nused benchmarks. Furthermore, ScaleCap showcases superb richness and fidelity\nof generated captions with two additional tasks: replacing images with captions\nin VQA task, and reconstructing images from captions to assess semantic\ncoverage. Code is available at https://github.com/Cooperx521/ScaleCap.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["inference-time"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19851", "categories": ["cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19851", "abs": "https://arxiv.org/abs/2506.19851", "authors": ["Zehuan Huang", "Haoran Feng", "Yangtian Sun", "Yuanchen Guo", "Yanpei Cao", "Lu Sheng"], "title": "AnimaX: Animating the Inanimate in 3D with Joint Video-Pose Diffusion Models", "comment": "Project page: https://anima-x.github.io/", "summary": "We present AnimaX, a feed-forward 3D animation framework that bridges the\nmotion priors of video diffusion models with the controllable structure of\nskeleton-based animation. Traditional motion synthesis methods are either\nrestricted to fixed skeletal topologies or require costly optimization in\nhigh-dimensional deformation spaces. In contrast, AnimaX effectively transfers\nvideo-based motion knowledge to the 3D domain, supporting diverse articulated\nmeshes with arbitrary skeletons. Our method represents 3D motion as multi-view,\nmulti-frame 2D pose maps, and enables joint video-pose diffusion conditioned on\ntemplate renderings and a textual motion prompt. We introduce shared positional\nencodings and modality-aware embeddings to ensure spatial-temporal alignment\nbetween video and pose sequences, effectively transferring video priors to\nmotion generation task. The resulting multi-view pose sequences are\ntriangulated into 3D joint positions and converted into mesh animation via\ninverse kinematics. Trained on a newly curated dataset of 160,000 rigged\nsequences, AnimaX achieves state-of-the-art results on VBench in\ngeneralization, motion fidelity, and efficiency, offering a scalable solution\nfor category-agnostic 3D animation. Project page:\n\\href{https://anima-x.github.io/}{https://anima-x.github.io/}.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["alignment"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["dataset"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19708", "categories": ["cs.GR", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2506.19708", "abs": "https://arxiv.org/abs/2506.19708", "authors": ["Matyas Bohacek", "Thomas Fel", "Maneesh Agrawala", "Ekdeep Singh Lubana"], "title": "Uncovering Conceptual Blindspots in Generative Image Models Using Sparse Autoencoders", "comment": null, "summary": "Despite their impressive performance, generative image models trained on\nlarge-scale datasets frequently fail to produce images with seemingly simple\nconcepts -- e.g., human hands or objects appearing in groups of four -- that\nare reasonably expected to appear in the training data. These failure modes\nhave largely been documented anecdotally, leaving open the question of whether\nthey reflect idiosyncratic anomalies or more structural limitations of these\nmodels. To address this, we introduce a systematic approach for identifying and\ncharacterizing \"conceptual blindspots\" -- concepts present in the training data\nbut absent or misrepresented in a model's generations. Our method leverages\nsparse autoencoders (SAEs) to extract interpretable concept embeddings,\nenabling a quantitative comparison of concept prevalence between real and\ngenerated images. We train an archetypal SAE (RA-SAE) on DINOv2 features with\n32,000 concepts -- the largest such SAE to date -- enabling fine-grained\nanalysis of conceptual disparities. Applied to four popular generative models\n(Stable Diffusion 1.5/2.1, PixArt, and Kandinsky), our approach reveals\nspecific suppressed blindspots (e.g., bird feeders, DVD discs, and whitespaces\non documents) and exaggerated blindspots (e.g., wood background texture and\npalm trees). At the individual datapoint level, we further isolate memorization\nartifacts -- instances where models reproduce highly specific visual templates\nseen during training. Overall, we propose a theoretically grounded framework\nfor systematically identifying conceptual blindspots in generative models by\nassessing their conceptual fidelity with respect to the underlying\ndata-generating process.", "survey_categories": {"test_time_scaling": {"chapter_name": "Test-Time Scaling", "matched_keywords": ["scale"], "score": 1}, "reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["comparison"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["fine-grained"], "score": 1}}, "source_file": "2025-06-25.jsonl"}
{"id": "2506.19807", "categories": ["cs.AI", "cs.CL", "cs.CV", "cs.LG", "cs.MA"], "pdf": "https://arxiv.org/pdf/2506.19807", "abs": "https://arxiv.org/abs/2506.19807", "authors": ["Baochang Ren", "Shuofei Qiao", "Wenhao Yu", "Huajun Chen", "Ningyu Zhang"], "title": "KnowRL: Exploring Knowledgeable Reinforcement Learning for Factuality", "comment": "Work in progress", "summary": "Large Language Models (LLMs), particularly slow-thinking models, often\nexhibit severe hallucination, outputting incorrect content due to an inability\nto accurately recognize knowledge boundaries during reasoning. While\nReinforcement Learning (RL) can enhance complex reasoning abilities, its\noutcome-oriented reward mechanism often lacks factual supervision over the\nthinking process, further exacerbating the hallucination problem. To address\nthe high hallucination in slow-thinking models, we propose Knowledge-enhanced\nRL, KnowRL. KnowRL guides models to perform fact-based slow thinking by\nintegrating a factuality reward, based on knowledge verification, into the RL\ntraining process, helping them recognize their knowledge boundaries. KnowRL\nguides models to perform fact-based slow thinking by integrating a factuality\nreward, based on knowledge verification, into the RL training process, helping\nthem recognize their knowledge boundaries. This targeted factual input during\nRL training enables the model to learn and internalize fact-based reasoning\nstrategies. By directly rewarding adherence to facts within the reasoning\nsteps, KnowRL fosters a more reliable thinking process. Experimental results on\nthree hallucination evaluation datasets and two reasoning evaluation datasets\ndemonstrate that KnowRL effectively mitigates hallucinations in slow-thinking\nmodels while maintaining their original strong reasoning capabilities. Our code\nis available at https://github.com/zjunlp/KnowRL.", "survey_categories": {"reward_model_rl": {"chapter_name": "Reward Model for RL", "matched_keywords": ["reinforcement learning"], "score": 1}, "reward_model_benchmark": {"chapter_name": "Reward Model Benchmark", "matched_keywords": ["evaluation", "factuality"], "score": 2}}, "source_file": "2025-06-25.jsonl"}
